[
  {
    "id": "the_fool",
    "name": "愚者",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段充滿純真與可能性的新戀情即將展開。",
          "details": [
            "如果你是單身，這張牌預示著一場輕鬆、無負擔的戀愛即將到來，對方可能是一個充滿活力和冒險精神的人。",
            "如果你正在一段關係中，它鼓勵你們一起嘗試新事物，像孩子一樣重新發現彼此，為關係注入新的活力。",
            "保持開放和信任的心態，不要因為害怕受傷而卻步。這是一段值得你用心去體驗的旅程。"
          ]
        },
        "reversed": {
          "summary": "在感情中顯得過於魯莽和天真，可能會做出不明智的決定。",
          "details": [
            "你可能因為一時的衝動而投入一段不合適的關係，或是忽略了關係中明顯的警訊。",
            "注意不要因為追求新鮮感而逃避對關係應有的責任和承諾。",
            "在做出任何重大的感情決定前，請三思而後行，多聽聽朋友或家人的建議。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "一個全新的職業道路或專案機會正在你面前展開，是時候勇敢地邁出第一步了。",
          "details": [
            "如果你正在考慮換工作、創業或開始一個新專案，現在是最佳時機。相信你的直覺，不要害怕未知。",
            "這張牌鼓勵創新和非傳統的思維方式。你的獨特想法可能會為你帶來意想不到的成功。",
            "保持學習的心態，即使你是一個新手，你的熱情和潛力也將被看見。"
          ]
        },
        "reversed": {
          "summary": "在工作上缺乏計畫、不切實際，你的冒險可能變成魯莽的賭博。",
          "details": [
            "你可能有一個很好的想法，但卻沒有做好充分的市場調查和準備工作，導致專案難以落地。",
            "小心那些看起來好得令人難以置信的機會，它們可能隱藏著未知的風險。",
            "現在是時候回歸現實，制定一個更具體、更可行的計畫，而不是僅僅憑空想像。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "新的友誼或社交圈子正在向你招手，用真誠和開放的心去迎接。",
          "details": [
            "你將有機會認識一些有趣、志同道合的新朋友，他們會為你的生活帶來新的視角。",
            "不要害怕在社交場合中展現你真實、甚至有點古怪的一面，這正是你吸引他人的魅力所在。",
            "這是一個拓展人脈的好時機，對你遇到的每個人都保持一顆好奇和友善的心。"
          ]
        },
        "reversed": {
          "summary": "在人際交往中可能過於輕信他人，或因為行為不當而被孤立。",
          "details": [
            "你需要提高警覺，不是每個人都值得你完全的信任。學會分辨誰是真正的朋友。",
            "你的某些行為可能在不經意間被他人視為不負責任或幼稚，從而影響了你的社交聲譽。",
            "在團體中，多觀察、多傾聽，而不是急於表現自己，這會讓你更受歡迎。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "身心充滿活力，是時候開始一種新的健康生活方式了。",
          "details": [
            "你的身體渴望新的挑戰。嘗試一種你從未做過的運動，如舞蹈、攀岩或瑜伽。",
            "保持樂觀積極的心態對你的健康至關重要，精神上的愉悅會直接反映在身體上。",
            "這也是一個關注心理健康的好時機，可以嘗試冥想或寫日記，開啟內在的探索之旅。"
          ]
        },
        "reversed": {
          "summary": "因為粗心大意而導致健康風險，需要更加關注身體安全。",
          "details": [
            "進行任何運動或戶外活動時，請務必做好熱身和安全措施，避免不必要的傷害。",
            "你可能忽略了身體發出的一些早期警訊，建議安排一次健康檢查。",
            "在飲食和作息上，你需要更有規律，混亂的生活方式正在損害你的健康。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正站在人生的新起點上，一個充滿無限可能的探索之旅即將開始。",
          "details": [
            "拋開過去的包袱，勇敢地擁抱未知。現在是跟隨你的心，去追求真正夢想的時候了。",
            "相信你的直覺和內在的指引，即使前方的道路看起來並不清晰，第一步也至關重要。",
            "這是一個關於靈性成長和自我發現的絕佳時機，你的潛力遠超你自己的想像。"
          ]
        },
        "reversed": {
          "summary": "感到迷茫和猶豫不決，害怕踏出新的一步，導致停滯不前。",
          "details": [
            "你可能因為害怕失敗或他人的眼光，而錯失了成長的機會。你需要找到內在的勇氣。",
            "你是否在盲目地跟隨他人的道路，而不是傾聽自己內心的聲音？是時候進行一次深刻的內省了。",
            "從小的、可控的步驟開始，可以幫助你重建信心，逐步走出迷霧。"
          ]
        }
      }
    }
  },
  {
    "id": "the_magician",
    "name": "魔術師",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你掌握著主動權，有能力將你理想中的愛情變為現實。",
          "details": [
            "現在是採取主動的最佳時機。運用你的溝通技巧和個人魅力，去吸引你心儀的對象。",
            "如果你正在一段關係中，這張牌鼓勵你主動創造浪漫和驚喜，將關係提升到一個新的層次。",
            "你的自信和創造力是目前最強大的愛情魔法，善用它們來實現你的願望。"
          ]
        },
        "reversed": {
          "summary": "關係中可能存在不誠實、欺騙或權力濫用的問題。",
          "details": [
            "警惕那些甜言蜜語但缺乏實際行動的人。你需要分辨對方是真誠的，還是在玩弄技巧。",
            "反思自己是否在關係中過於強勢或試圖操控對方，這會破壞信任的基礎。",
            "溝通出現了障礙，或者你感覺自己被蒙在鼓裡。是時候進行一次開誠布公的對話了。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的才華和技能將得到充分展現，是時候將想法付諸行動了。",
          "details": [
            "你擁有成功所需的所有工具和資源，現在需要的是將它們整合並執行。",
            "這是在工作中展現領導力和創造力的好時機，你的提案將會受到重視。",
            "如果你想開始副業或個人專案，現在是將藍圖化為現實的絕佳機會。"
          ]
        },
        "reversed": {
          "summary": "你的才能被誤用或浪費，專案可能因計畫不周而停滯。",
          "details": [
            "你可能感到有才華卻無處施展，或因為缺乏自信而不敢行動。",
            "小心那些華而不實的計畫，它們可能聽起來很棒，但缺乏實際的可行性。",
            "現在不是投機取巧的時候，你需要的是專注和務實，將精力集中在一個明確的目標上。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是社交場合的焦點，你的智慧和魅力能輕易地建立新的連結。",
          "details": [
            "你的溝通能力處於巔峰，能夠清晰地表達自己，並有效地解決朋友間的誤會。",
            "你是團體中的發起者和組織者，能夠將不同的人聚集在一起，創造和諧的氛圍。",
            "利用你的影響力去幫助他人，這會為你贏得更多的尊重和真誠的友誼。"
          ]
        },
        "reversed": {
          "summary": "人際關係中可能存在不真誠或操控的行為，導致信任危機。",
          "details": [
            "你或你身邊的人可能言行不一，為了個人利益而說謊或誇大其詞。",
            "警惕那些試圖利用你的人，他們可能會用花言巧語來達到自己的目的。",
            "在做出承諾前請三思，確保你能兌現，否則會損害你的信譽。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你有強大的意志力來改善健康，是時候採取積極的行動了。",
          "details": [
            "這是戒除一個壞習慣（如抽菸、熬夜）並建立健康生活方式的絕佳時機。",
            "你的精神力量很強，可以嘗試透過冥想、正面肯定等方式來輔助身體的療癒。",
            "主動去學習健康知識，並為自己量身打造一個可行的飲食和運動計畫。"
          ]
        },
        "reversed": {
          "summary": "因為意志力薄弱或資訊混亂，你的健康計畫可能難以執行。",
          "details": [
            "你可能知道該怎麼做，但總是缺乏堅持下去的動力，導致計畫半途而廢。",
            "小心那些網路上的不實健康資訊，它們可能會誤導你，甚至對身體造成傷害。",
            "你可能感到身心能量低下，建議尋求專業醫師或心理諮詢師的幫助，而不是自己亂試偏方。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你內在的潛能與外在的世界完美連結，是顯化夢想的時刻。",
          "details": [
            "你的思想、言語和行動具有強大的創造力。你所專注的，都將可能變為現實。",
            "這是一個學習新技能、新知識的絕佳時機，你的領悟力和學習能力都非常強。",
            "你有能力將抽象的意念轉化為具體的成果。相信自己，你就是自己命運的創造者。"
          ]
        },
        "reversed": {
          "summary": "你的潛力被堵塞或誤用，感到有志難伸，充滿無力感。",
          "details": [
            "你可能擁有許多天賦，但卻不知道該如何運用它們，或者將它們用在了錯誤的地方。",
            "你是否感到自己的想法無法被他人理解，或者在現實中處處碰壁？",
            "你需要重新連結你的內在意志，問問自己：『我真正想要創造的是什麼？』然後專注於此，排除所有干擾。"
          ]
        }
      }
    }
  },
  {
    "id": "the_high_priestess",
    "name": "女祭司",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段充滿神秘感與心靈連結的深層關係。",
          "details": [
            "你們之間的吸引力更多是精神層面的，可能存在一種『心有靈犀』的默契。",
            "這段關係可能不會過於張揚，你們更享受兩人世界的寧靜與深刻交流。",
            "相信你的直覺，它會引導你在這段關係中做出正確的決定。有些事情不需要言語，用心去感受。"
          ]
        },
        "reversed": {
          "summary": "關係中存在秘密或誤解，你可能忽視了內心的聲音。",
          "details": [
            "你或對方可能隱藏著某些秘密，導致關係缺乏透明度，存在不信任感。",
            "你是否因為過於理性分析而忽略了自己真實的感受？你的直覺可能在警告你一些事情。",
            "表面的平靜之下可能暗流洶湧。是時候進行一次誠實的自我對話，或與伴侶揭開謎團了。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的直覺和洞察力是目前最強大的武器，適合從事需要深度思考的工作。",
          "details": [
            "在做重要的職業決策時，請相信你的第一直覺，它往往比繁複的數據分析更準確。",
            "你可能會接觸到一些尚未公開的資訊或機會，保持敏銳的觀察力。",
            "這是一個適合學習、研究、進修的時期，深入鑽研你的專業領域將會大有收穫。"
          ]
        },
        "reversed": {
          "summary": "資訊不對稱或錯過關鍵細節，可能導致你在事業上做出錯誤判斷。",
          "details": [
            "你是否感覺自己被排除在核心決策圈之外，或者總是最後一個知道消息的人？",
            "避免參與辦公室八卦，這可能會讓你捲入不必要的麻煩，或根據不實資訊做出判斷。",
            "現在是時候放慢腳步，仔細審查你手中的所有資訊，而不是急於採取行動。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你與朋友之間存在深刻的心靈默契，是一種『知己』般的關係。",
          "details": [
            "你更傾向於與少數幾個朋友進行深度交流，而不是參加大型的社交聚會。",
            "你是朋友們的傾聽者和秘密的守護者，他們非常信任你。",
            "保持適當的個人空間和界限感，會讓你的友誼更加健康和長久。"
          ]
        },
        "reversed": {
          "summary": "在社交中感到孤立或格格不入，可能與朋友產生了隔閡。",
          "details": [
            "你可能過於封閉自己，不願意與他人分享真實的感受，導致了距離感。",
            "小心背後的閒言碎語或秘密的洩漏，這可能會破壞你們的友誼。",
            "如果你感覺與朋友之間有誤會，不要僅僅靠猜測，嘗試進行一次溫和而真誠的溝通。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "傾聽你身體的聲音，你的直覺會告訴你它需要什麼。",
          "details": [
            "這張牌強烈指向與女性健康、荷爾蒙或生理週期相關的問題，請多加關注。",
            "冥想、瑜伽或任何能讓你內心平靜的活動，都對你目前的健康狀況非常有益。",
            "你的身體可能對環境和情緒非常敏感，學會保護自己的能量場，避免受到負面影響。"
          ]
        },
        "reversed": {
          "summary": "你可能在刻意忽略身體發出的警訊，導致健康問題惡化。",
          "details": [
            "情緒的壓抑，如焦慮、憂鬱，可能正在以生理症狀的形式表現出來。",
            "你是否因為害怕面對真相而遲遲不去看醫生？現在是正視問題的時候了。",
            "注意調節你的內分泌系統，不規律的作息和飲食習慣正在對你造成傷害。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "這是深入探索你內在世界、潛意識和靈性層面的絕佳時機。",
          "details": [
            "你的夢境、直覺和靈感都非常活躍，嘗試用日記把它們記錄下來，其中隱藏著重要的訊息。",
            "學習神秘學、心理學或任何能幫助你理解內在運作的知識，都會讓你受益匪淺。",
            "學會獨處，在寧靜中與你的高我連結，你會發現所有答案早已在你心中。"
          ]
        },
        "reversed": {
          "summary": "你與自己的內在智慧失去了連結，感到困惑和不安。",
          "details": [
            "你可能過於依賴外在的邏輯和理性，而壓抑了自己真實的情感和直覺。",
            "你是否感到自己像一個空殼，對生活失去了熱情和方向？是時候重新點燃你內在的火焰了。",
            "避免逃避現實，不要用忙碌來麻痺自己。你需要勇敢地向內看，去面對那些被你壓抑的陰影。"
          ]
        }
      }
    }
  },
  {
    "id": "the_empress",
    "name": "皇后",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段充滿愛、溫暖和滋養的豐盛關係。",
          "details": [
            "你的愛情生活將進入一個穩定而甜蜜的階段，充滿了關懷和安全感。",
            "這張牌常常與懷孕、新生命的到來或家庭的擴展有關。",
            "盡情享受被愛和愛人的感覺，你的溫柔和包容是這段關係中最寶貴的財富。"
          ]
        },
        "reversed": {
          "summary": "關係中可能存在過度依賴、佔有慾或創造力受阻的問題。",
          "details": [
            "你是否感到在關係中失去了自我，或者過於依賴對方來獲取安全感？",
            "小心不要將你的關心變成控制，給予對方適當的空間是維持關係健康的關鍵。",
            "你可能感到情感上或創造力上停滯不前，需要重新找回滋養自己內心的能力。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的創造力將會結果，事業上將迎來豐收的時期。",
          "details": [
            "你的專案將會順利發展並取得豐碩的成果，你的努力將得到回報。",
            "這是一個非常適合從事與藝術、設計、美學或任何與創造相關工作的時期。",
            "你的工作環境將充滿和諧與合作，你的 nurturing（滋養）特質能讓團隊更有凝聚力。"
          ]
        },
        "reversed": {
          "summary": "工作上感到停滯、缺乏靈感，或者資源被浪費。",
          "details": [
            "你可能感到自己的創造力被壓抑，或者工作進入了一個瓶頸期，無法突破。",
            "注意財務或資源的管理，避免因為計畫不周而導致不必要的浪費。",
            "你可能過於關注他人的需求而忽略了自己的事業發展，是時候重新將焦點放回自己身上了。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你如同團體中的母親，用愛與關懷滋養著你的人際網絡。",
          "details": [
            "你是朋友們傾訴的對象和依靠的港灣，你的存在讓大家感到溫暖和安全。",
            "多花時間與家人和親密的朋友相處，這些關係會為你帶來巨大的幸福感。",
            "你的慷慨和樂於助人將會為你贏得良好的人緣，享受這份和諧的社交生活吧。"
          ]
        },
        "reversed": {
          "summary": "在人際關係中可能過於溺愛、控制或過度付出。",
          "details": [
            "你是否對朋友或家人過於保護，甚至干涉了他們的個人選擇？",
            "你需要設定健康的界線，學會區分『關心』和『控制』，避免讓你的愛成為對方的負擔。",
            "反思一下你是否在關係中過度付出而忽略了自己，一段健康的關係是雙向的。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "身心處於和諧豐盛的狀態，充滿生命力。",
          "details": [
            "這張牌與大地和自然有很強的連結，多去戶外走走、接觸大自然對你的健康非常有益。",
            "關注你的飲食，選擇天然、有營養的食物來滋養你的身體。",
            "這也是一張與生育能力和女性健康密切相關的牌，預示著良好的狀態。"
          ]
        },
        "reversed": {
          "summary": "感到疲憊、缺乏活力，或者過於放縱而影響健康。",
          "details": [
            "你可能因為過於照顧他人而耗盡了自己的能量，是時候好好休息，優先照顧自己了。",
            "注意不要因為情緒化而暴飲暴食，或沉迷於不健康的習慣。",
            "這張牌也提醒你要關注婦科相關的健康問題，如有不適請及時檢查。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "連結你內在的創造力和豐盛的能量，學會愛自己。",
          "details": [
            "現在是時候去創造一些能給你帶來美感和喜悅的事物了，無論是畫畫、烹飪還是園藝。",
            "學會像對待你最愛的人一樣，用溫柔和耐心來對待自己，滿足自己的需求。",
            "你的感官非常敏銳，多去體驗生活中的美好，如美食、音樂、藝術，這些都能滋養你的靈魂。"
          ]
        },
        "reversed": {
          "summary": "你與自己的創造力和女性能量脫節，感到空虛或缺乏自信。",
          "details": [
            "你可能過於注重外在的成就而忽略了內心的感受，導致生活失去了色彩。",
            "你是否對自己的外表或價值感到不滿？是時候停止自我批判，學會無條件地接納自己了。",
            "你需要重新找到能點燃你熱情和創造力的人事物，讓自己重新感受到生命的豐盛與喜悅。"
          ]
        }
      }
    }
  },
  {
    "id": "the_emperor",
    "name": "皇帝",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段穩定、有承諾且充滿安全感的關係。",
          "details": [
            "這段關係建立在穩固的基礎之上，充滿了責任感和長期的承諾。",
            "如果你正在尋求一段認真的關係，這張牌預示著一個可靠、成熟的伴侶即將出現。",
            "在關係中，建立清晰的規則和共同的目標，將有助於你們的長遠發展。"
          ]
        },
        "reversed": {
          "summary": "關係中存在過度的控制、固執和權力鬥爭。",
          "details": [
            "你或你的伴侶是否過於強勢，試圖將自己的意志強加給對方？這會讓關係變得窒息。",
            "缺乏彈性和變通，使得關係中的小問題演變成大的衝突。",
            "你需要學會放手，給予對方更多的信任和自由，而不是試圖掌控一切。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的領導才能和組織能力將得到認可，事業進入一個穩定的掌控期。",
          "details": [
            "這是一個建立權威、獲得晉升或成功創業的絕佳時機。",
            "你的決策果斷而有效，能夠為團隊帶來清晰的方向和秩序。",
            "為你的專案或團隊建立清晰的結構和規則，這將是成功的關鍵。"
          ]
        },
        "reversed": {
          "summary": "在工作中可能變得過於專制、僵化，導致與他人發生衝突。",
          "details": [
            "你是否因為過於堅持己見而聽不進他人的建議？這會阻礙團隊的發展。",
            "你的管理方式可能過於嚴苛，讓下屬或同事感到壓抑和不滿。",
            "你需要學會更靈活地應對變化，並在堅持原則的同時，適當地下放權力。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你在朋友圈中扮演著領導者和保護者的角色，深受他人信賴。",
          "details": [
            "你的穩定和可靠為朋友們提供了強大的支持，他們在遇到困難時會首先想到你。",
            "你善於組織活動，並為團體建立秩序，讓每個人都感到安全和有歸屬感。",
            "這是一個鞏固重要友誼、建立長期社交聯盟的好時機。"
          ]
        },
        "reversed": {
          "summary": "在社交中可能顯得過於強勢、好為人師，讓人感到壓力。",
          "details": [
            "你是否總想在朋友面前扮演權威的角色，對他人的生活指手畫腳？",
            "放鬆一點，不是所有事情都需要在你的掌控之中。學會平等地與朋友相處。",
            "有時候，過度的保護會變成控制，給朋友一些獨立解決問題的空間。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的自律能力將幫助你建立穩定的健康習慣。",
          "details": [
            "這是制定並嚴格執行一個運動計畫或飲食計畫的最佳時機，你的毅力會讓你看到成果。",
            "規律的作息對你至關重要，建立一個穩定的生理時鐘。",
            "這張牌也代表著強壯的體魄和骨骼，但仍需注意關節的保護。"
          ]
        },
        "reversed": {
          "summary": "過於固執或缺乏紀律，可能導致健康問題。",
          "details": [
            "你可能因為工作過度而忽視了身體的休息需求，導致能量耗盡。",
            "『我的身體我最清楚』的固執想法，可能會讓你錯過尋求專業醫療幫助的最佳時機。",
            "你需要的是『彈性的紀律』，而不是極端的放縱或極端的嚴苛，學會傾聽身體的需求。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "是時候為你的生活建立秩序，實現真正的自我掌控。",
          "details": [
            "透過設定清晰的目標、制定可行的計畫，並用自律去執行，你將能掌控自己的命運。",
            "這張牌鼓勵你建立自己的原則和價值體系，並勇敢地去捍衛它。",
            "你內在的陽性力量、邏輯和理性思維非常強大，善用它們來建構你想要的人生。"
          ]
        },
        "reversed": {
          "summary": "感到生活失控，或被自己或他人的規則束縛得透不過氣。",
          "details": [
            "你是否感到自己的人生被各種『應該』和『必須』所綁架，而失去了真正的自由？",
            "你可能在反抗權威，但這種反抗是出於叛逆，還是你真的找到了更好的方式？",
            "你需要重新審視你為自己設定的規則，看看它們是在幫助你，還是在限制你。學會打破那些不再為你服務的規則。"
          ]
        }
      }
    }
  },
  {
    "id": "the_hierophant",
    "name": "教皇",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段遵循傳統、充滿承諾的關係，可能步入婚姻的殿堂。",
          "details": [
            "你們的關係得到了社會或家庭的認可，正在朝著更穩定、更長久的未來發展。",
            "這張牌常常預示著訂婚、結婚或舉行某種儀式，來公開確認你們的伴侶關係。",
            "在愛情中，共同的價值觀和信仰是你們關係穩固的基石。"
          ]
        },
        "reversed": {
          "summary": "關係受到傳統觀念的束縛，或者你正在挑戰不適合你的愛情模式。",
          "details": [
            "你是否感到被家庭壓力或社會期望所困，無法自由地選擇你想要的愛情？",
            "這張牌鼓勵你打破陳規，去尋找一種更適合你個人需求的、非傳統的伴侶關係。",
            "你們之間可能因為價值觀的巨大差異而產生衝突，需要進行坦誠的溝通。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "在體制內或傳統行業中將獲得成功，尋求導師的指引。",
          "details": [
            "這是一個非常適合在大型公司、政府機構或教育領域發展的時期，遵循既定規則會讓你事半功倍。",
            "尋找一位你尊敬的、經驗豐富的前輩作為你的導師，他的指導將為你指明方向。",
            "團隊合作和遵守流程是成功的關鍵，現在不是單打獨鬥或標新立異的時候。"
          ]
        },
        "reversed": {
          "summary": "你可能在挑戰既有的規則和權威，或感到被僵化的體制所束縛。",
          "details": [
            "你的創新想法可能與公司的傳統文化格格不入，讓你感到有志難伸。",
            "你需要思考你的反抗是具有建設性的，還是僅僅為了反對而反對？",
            "這可能是一個離開僵化體制，去尋找一個更自由、更能發揮你才華的環境的時機。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "加入一個有共同信仰或興趣的團體，你將在其中找到歸屬感。",
          "details": [
            "你可能會在一個學習小組、讀書會或宗教團體中，扮演一個傳授知識或經驗的角色。",
            "與志同道合的朋友分享你的價值觀，會讓你的友誼更加深刻和有意義。",
            "你是朋友們信賴的顧問，他們樂於向你尋求建議和智慧。"
          ]
        },
        "reversed": {
          "summary": "因為觀念不合而與朋友或團體疏遠，或感到被群體壓力所迫。",
          "details": [
            "你是否感到自己所在的圈子過於保守或教條，讓你無法做真實的自己？",
            "小心不要陷入盲從，你需要保持獨立思考的能力，而不是被群體意識所裹挾。",
            "如果一段友誼讓你感到壓抑和不被尊重，也許是時候考慮離開了。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "尋求傳統、權威的醫療建議，並遵循經過驗證的健康體系。",
          "details": [
            "如果你有健康問題，現在是時候去看醫生，並嚴格遵循專業的治療方案。",
            "這張牌強調的是『預防勝於治療』，建立一個系統性的、規律的健康管理計畫。",
            "加入一個健身課程或健康互助小組，在群體的支持下，你會更容易堅持下去。"
          ]
        },
        "reversed": {
          "summary": "你可能在質疑主流的醫療建議，或嘗試一些未經驗證的激進療法。",
          "details": [
            "對權威保持適度的懷疑是健康的，但完全拒絕專業建議可能會延誤治療。",
            "在嘗試任何非主流療法之前，請務必做好充分的研究，並謹慎評估其風險。",
            "你的健康問題可能與心理上的叛逆或不願遵守規則有關，需要從心態上做出調整。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "透過有系統的學習和傳統智慧，你將找到人生的信仰和意義。",
          "details": [
            "這是一個非常適合進行深度學習的時期，例如攻讀一個學位、學習一門宗教或哲學。",
            "尋找一位靈性導師或加入一個精神團體，將極大地加速你的個人成長。",
            "你正在建立一套屬於自己的、穩固的價值觀和信仰體系，這將成為你人生的燈塔。"
          ]
        },
        "reversed": {
          "summary": "你正在打破內在的舊有信念，或反抗不再適合你的傳統價值觀。",
          "details": [
            "你感到過去所學的知識和信條已經無法解釋你現在的生命經驗，正在尋求新的答案。",
            "這是一個充滿困惑但極具創造力的時期，你正在打破舊的框架，建立全新的自我認知。",
            "相信你內在的聲音，即使它與外界的權威相悖。你正在成為自己人生的最高權威。"
          ]
        }
      }
    }
  },
  {
    "id": "the_lovers",
    "name": "戀人",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段充滿激情、和諧與深刻連結的完美結合。",
          "details": [
            "這代表了一段真正心意相通的關係，你們在身體、心靈和精神層面上都高度契合。",
            "如果你是單身，一個能與你產生深刻靈魂連結的伴侶即將出現。",
            "這張牌也代表一個重要的選擇，通常是關於承諾的。跟隨你的心，它會給你正確的答案。"
          ]
        },
        "reversed": {
          "summary": "關係中出現了不和諧、溝通不良或價值觀的衝突。",
          "details": [
            "你們之間的溝通可能完全不在一個頻道上，導致了頻繁的誤會和爭吵。",
            "你可能正在為了一個錯誤的選擇而感到後悔，或者在兩段關係之間猶豫不決。",
            "是時候重新審視你們的核心價值觀是否一致了，一個基於錯誤基礎的關係是無法長久的。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "一個重要的商業合作或職業選擇擺在你面前，它與你的價值觀高度一致。",
          "details": [
            "你將有機會與一個完美的夥伴合作，你們的技能和理念能夠互補，共同創造成功。",
            "在做職業選擇時，不僅要考慮薪水和職位，更要考慮這份工作是否符合你內心的熱情和價值觀。",
            "這是一個建立基於信任和共同目標的長期合作關係的絕佳時機。"
          ]
        },
        "reversed": {
          "summary": "與合作夥伴的關係破裂，或做出了與自己價值觀相悖的職業選擇。",
          "details": [
            "你和你的商業夥伴之間可能出現了嚴重的分歧和不信任，導致合作難以為繼。",
            "你目前的工作可能讓你感到內心充滿衝突，因為它違背了你的個人原則。",
            "在簽署任何合約或做出重大承諾之前，請務必仔細閱讀條款，並確保它符合你的長遠利益。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你將與某人建立起一種基於真誠溝通和相互理解的深刻友誼。",
          "details": [
            "這是一段和諧、平衡且雙向奔赴的友誼，你們能夠公開地分享彼此的想法和感受。",
            "你可能會遇到一個『靈魂伴侶』般的朋友，你們的連結將非常深刻和有意義。",
            "在人際交往中，堅持你的價值觀，這會為你吸引來真正志同道合的人。"
          ]
        },
        "reversed": {
          "summary": "人際關係中充滿了不和諧、誤解和價值觀的衝突。",
          "details": [
            "你和朋友之間的溝通可能完全不在一個頻道上，導致了頻繁的誤會和爭吵。",
            "你可能感到在這段友誼中，只有你一個人在努力維持，關係已經嚴重失衡。",
            "你需要誠實地問自己，這段關係是否還值得你投入精力，或者它已經與你的核心價值觀背道而馳。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "身心達到和諧統一的狀態，做出對健康有益的選擇。",
          "details": [
            "你的健康狀況良好，這是因為你在飲食、運動和心理健康之間找到了完美的平衡。",
            "這張牌鼓勵你選擇那些讓你身心都感到愉悅的健康方式，而不是強迫自己。",
            "與一個夥伴（如健身教練、營養師或一起運動的朋友）合作，將會讓你的健康計畫更有效。"
          ]
        },
        "reversed": {
          "summary": "不和諧的生活方式正在損害你的健康，你可能做出了錯誤的選擇。",
          "details": [
            "你是否在工作與休息、放縱與自律之間失去了平衡？這正在對你的身體造成傷害。",
            "你可能因為聽信了錯誤的建議，而採取了不適合你、甚至有害的健康方法。",
            "你的心臟和循環系統可能需要特別關注。是時候重新評估你的生活方式，並做出對你真正有益的選擇了。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正處於一個重要的十字路口，需要做出一個符合你核心價值觀的重大選擇。",
          "details": [
            "這個選擇將會對你的人產生深遠的影響，它關乎你將成為什麼樣的人。",
            "在做決定時，不要被外在的壓力或誘惑所迷惑，深入你的內心，傾聽你靈魂的聲音。",
            "這個選擇的過程，本身就是一次深刻的自我發現之旅，它會讓你更清楚自己的真實身份和人生目標。"
          ]
        },
        "reversed": {
          "summary": "內心的衝突和猶豫不決，讓你無法做出決定，感到停滯不前。",
          "details": [
            "你可能在兩個選項之間搖擺不定，因為你的頭腦和你的心在告訴你不同的答案。",
            "你是否因為害怕選擇的後果，而遲遲不敢做出決定？但有時候，不做決定本身就是一個最壞的決定。",
            "你需要花時間獨處，釐清你的核心價值觀。只有當你清楚什麼對你最重要時，你才能做出不讓自己後悔的選擇。"
          ]
        }
      }
    }
  },
  {
    "id": "the_chariot",
    "name": "戰車",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "憑藉堅定的意志，你們的關係將克服障礙，朝著共同的目標高速前進。",
          "details": [
            "如果你們的關係遇到了阻礙（如遠距離、家庭反對），現在是你們團結一致、共同克服的時候了。",
            "這張牌代表著一種目標導向的愛情，你們有著共同的未來藍圖，並正為之努力。",
            "在關係中，你需要展現出你的決心和行動力，帶領這段關係走向勝利。"
          ]
        },
        "reversed": {
          "summary": "關係失去控制和方向，充滿了衝突和失控的衝動。",
          "details": [
            "你們可能因為缺乏共同目標而各自為政，或者在關係的發展方向上產生了嚴重分歧。",
            "一方可能表現出過度的控制慾和攻擊性，導致另一方感到壓力重重。",
            "你需要停下來，重新評估你們的方向。失控的戰車只會導致兩敗俱傷。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "憑藉強大的意志力和決心，你將在事業上取得重大的勝利和突破。",
          "details": [
            "這是一個充滿競爭和挑戰的時期，但你的自信和專注將讓你脫穎而出。",
            "你為自己設定了清晰的目標，並且正以不可阻擋的勢頭向著它前進。",
            "這張牌也常常與旅行、交通或需要快速行動的專案有關。"
          ]
        },
        "reversed": {
          "summary": "專案失控、方向錯誤，或者因為過於魯莽而導致失敗。",
          "details": [
            "你可能因為急於求成而缺乏周詳的計畫，導致行動變得混亂且無效。",
            "你是否感到自己的努力沒有得到應有的結果，好像在原地打轉？你需要重新校準你的目標。",
            "小心不要將你的雄心變成具攻擊性的行為，這會讓你與同事和上司產生不必要的衝突。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "在社交中，你目標明確、充滿自信，能夠主導並達成你的社交目的。",
          "details": [
            "你清楚自己想從社交中獲得什麼，並會採取直接、有效的方式去建立對你有幫助的人脈。",
            "你是一個充滿活力和領導力的人，能夠帶領朋友們一起去完成某個共同的目標。",
            "你的自信和決心會吸引他人，但也要注意在過程中是否給予了他人足夠的尊重。"
          ]
        },
        "reversed": {
          "summary": "在人際關係中可能顯得過於強勢、有攻擊性，導致關係緊張。",
          "details": [
            "你是否為了達到自己的目的而不擇手段，甚至犧牲了他人的感受？",
            "你的好勝心可能會讓你與朋友之間產生不必要的競爭和衝突。",
            "你需要學會控制你的脾氣和衝動，在追求目標的同時，也要考慮他人的立場。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的意志力是你最強大的健康武器，是時候去戰勝一個健康挑戰了。",
          "details": [
            "這是克服一個健康難題（如完成一次馬拉松、成功減重）的絕佳時機，你的決心將無人能擋。",
            "你的身體充滿了能量和活力，適合進行高強度的運動。",
            "將你的好勝心用在積極的方面，例如為自己設定一個具有挑戰性的健身目標。"
          ]
        },
        "reversed": {
          "summary": "能量失控或缺乏自律，可能導致意外傷害或健康狀況惡化。",
          "details": [
            "你可能因為過於衝動而在運動中受傷，或者因為缺乏自制力而暴飲暴食。",
            "你感到自己的健康計畫完全失控，缺乏前進的動力和方向。",
            "你需要重新找回對自己身體的掌控權，從小的、可持續的習慣開始，一步步重建你的健康秩序。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "這是掌控自己人生方向、憑藉意志力實現目標的時刻。",
          "details": [
            "你內心充滿了自信和決心，清楚地知道自己想要什麼，以及如何去得到它。",
            "這張牌告訴你，成功來自於將你內在相互矛盾的力量（如理智與情感）統一在一個共同的目標之下。",
            "不要再猶豫了，現在就駕馭你的戰車，朝著你的夢想全速前進吧！"
          ]
        },
        "reversed": {
          "summary": "內心充滿矛盾，感到失控和無力，人生戰車失去了方向。",
          "details": [
            "你感到自己被不同的慾望和情緒拉扯，無法集中精力朝著一個方向前進。",
            "你可能為自己設定了目標，但卻缺乏實現它的自律和意志力。",
            "你需要停下來，進行一次深刻的內省，去整合你內在的衝突。在你重新掌控方向盤之前，不要輕舉妄動。"
          ]
        }
      }
    }
  },
  {
    "id": "strength",
    "name": "力量",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "用溫柔與耐心，你將能建立一段充滿激情且深度連結的關係。",
          "details": [
            "真正的力量不是控制，而是溫柔的引導。用你的同情心和理解，去化解關係中的緊張和衝突。",
            "你們的關係中充滿了激情，但這種激情是受控且具有建設性的，能夠加深你們的連結。",
            "這張牌鼓勵你接納並引導伴侶的『野性』一面，用愛去包容，而不是試圖改變對方。"
          ]
        },
        "reversed": {
          "summary": "關係中可能存在恐懼、不安全感，或壓抑了真實的情感。",
          "details": [
            "你是否因為害怕失去對方而不敢表達自己真實的需求和不滿？",
            "你可能感到在這段關係中失去了力量和自信，變得軟弱和依賴。",
            "是時候重新找回你內在的勇氣了。一段健康的關係，需要你先擁有愛自己的力量。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的耐心和毅力將幫助你克服挑戰，贏得同事和客戶的信任。",
          "details": [
            "面對困難的專案或難纏的客戶，不要使用強硬的手段，溫柔而堅定的溝通會更有效。",
            "你的內在力量和自信會讓你散發出專業的氣場，即使身處逆境也能保持冷靜和優雅。",
            "這是一個適合從事需要耐心和同情心的工作的時期，如諮商、教育或人力資源。"
          ]
        },
        "reversed": {
          "summary": "在工作中感到缺乏自信、軟弱無力，或者你的才能被壓抑。",
          "details": [
            "你可能因為害怕衝突而不敢在會議上提出自己的觀點，導致機會流失。",
            "你是否感到自己的工作熱情正在消退，對一切都提不起勁？",
            "你需要一個『內部』的激勵。重新點燃你對這份工作的熱情，或者勇敢地去尋找一個能讓你發光發熱的新舞台。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你的同理心和耐心是你最受歡迎的特質，能夠化解任何緊張氣氛。",
          "details": [
            "當朋友們發生爭執時，你總能扮演那個溫柔的調解者，幫助他們找到共識。",
            "你能夠用愛和包容去接納朋友們不完美的一面，因此贏得了他們深深的信任。",
            "這張牌提醒你，真正的影響力來自於內在的平靜和溫柔，而不是外在的強勢。"
          ]
        },
        "reversed": {
          "summary": "在社交中感到不安和恐懼，或者因為壓抑自己的情緒而顯得格格不入。",
          "details": [
            "你是否害怕在朋友面前展現你脆弱的一面，總是戴著堅強的面具？",
            "你需要建立自信，學會溫和而堅定地對不合理的要求說『不』，這並不會讓你失去朋友。",
            "壓抑的憤怒或不滿可能會在某個時刻突然爆發，學會用健康的方式去疏導你的負面情緒。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "憑藉堅韌的毅力，你將能戰勝疾病或養成健康的習慣。",
          "details": [
            "這是一張關於『恢復』的牌。即使你現在正處於一個健康挑戰中，你的內在生命力也將幫助你度過難關。",
            "溫和而持續的運動，如瑜伽、太極或散步，比劇烈的短期運動更適合你。",
            "你的精神力量對你的身體有著巨大的影響。保持積極的心態，相信自己能夠痊癒。"
          ]
        },
        "reversed": {
          "summary": "你可能感到被自己的慾望或壞習慣所控制，缺乏改變的意志力。",
          "details": [
            "你是否感到被自己的食慾、惰性或成癮行為所支配，對自己的身體失去了掌控？",
            "你可能因為壓抑了太多的情緒而感到精疲力竭，身心能量低下。",
            "你需要尋求幫助，無論是來自朋友、家人還是專業人士。承認自己的軟弱，是重新獲得力量的第一步。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "這是擁抱並整合你內在『野獸』的時刻，實現真正的完整。",
          "details": [
            "你內心深處的本能、慾望和激情並不可怕，它們是你生命力的來源。學會用愛去引導它們。",
            "真正的勇氣不是沒有恐懼，而是帶著恐懼依然前行。勇敢地去面對你內心的陰暗面。",
            "透過接納和整合你內在的所有部分（光明與黑暗），你將達到一個前所未有的、充滿力量與平靜的境界。"
          ]
        },
        "reversed": {
          "summary": "你可能在壓抑自己的本能和情感，或被它們所吞噬。",
          "details": [
            "你是否因為社會的期待或道德的束縛，而不敢承認自己內心的真實慾望？",
            "被壓抑的能量不會消失，它可能會以憤怒、焦慮或疾病的形式爆發出來。",
            "你需要找到一個安全的、具有建設性的方式來釋放你的內在能量，例如透過藝術創作、劇烈運動或心理治療。"
          ]
        }
      }
    }
  },
  {
    "id": "the_hermit",
    "name": "隱者",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你需要從愛情中暫時抽離，專注於自我探索和內在成長。",
          "details": [
            "這不是關於分手，而是關於給自己一些空間去思考你真正想要的是什麼。",
            "如果你是單身，這是一個享受獨處、提升自己的好時機，而不是急於尋找伴侶。",
            "一段成熟的關係需要兩個完整的個體，而現在是你讓自己變得完整的時刻。"
          ]
        },
        "reversed": {
          "summary": "你可能因為害怕受傷而過度孤立自己，或者被迫結束一段獨處時期。",
          "details": [
            "你是否因為過去的陰影而不敢向他人敞開心扉？過度的自我保護會讓你錯過真正的連結。",
            "你可能感到非常孤獨，渴望與人連結，但又不知道如何開始。",
            "是時候慢慢地走出你的洞穴了。試著從一些小的社交活動開始，重新與世界連結。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你需要暫時從日常工作中抽離，進行深入的研究、反思或尋求導師的指引。",
          "details": [
            "這是一個非常適合進修、學習或規劃未來職業道路的時期。",
            "你可能會遇到一位智慧的導師，他將為你指點迷津。",
            "不要害怕獨自工作，這段時間的獨立思考將為你帶來巨大的突破。"
          ]
        },
        "reversed": {
          "summary": "你在工作中感到孤立無援，或者因為固執己見而拒絕他人的幫助。",
          "details": [
            "你是否覺得自己與團隊格格不入，或者你的建議總是被忽視？",
            "過度的完美主義或不願尋求幫助，可能會讓你陷入困境。",
            "你需要學會與他人合作。尋求建議並不代表你軟弱，而是智慧的表現。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你需要一些獨處的時間，暫時遠離社交圈，以便更好地了解自己。",
          "details": [
            "告訴你的朋友們你需要一些個人空間，真正的朋友會理解並尊重你的決定。",
            "這段時間的內省將讓你更清楚自己在人際關係中的需求和界限。",
            "當你再次回到人群中時，你將會是一個更清晰、更真實的朋友。"
          ]
        },
        "reversed": {
          "summary": "你可能感到被朋友孤立，或者因為害怕孤獨而過度參與社交活動。",
          "details": [
            "你是否感到被排擠，或者覺得自己無法融入任何圈子？",
            "另一種可能是，你用無盡的社交活動來填補內心的空虛，逃避與自己獨處。",
            "你需要找到獨處和社交之間的平衡。學會享受自己的陪伴，是建立健康人際關係的基礎。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身心需要一次徹底的休息和靜養，遠離外界的喧囂。",
          "details": [
            "這是一個非常適合進行冥想、瑜伽或任何能讓你內心平靜的活動的時期。",
            "你的身體可能在提醒你，你需要放慢腳步，給自己充電的時間。",
            "尋求一位有智慧的醫生或治療師的建議，他能為你提供身心靈層面的指導。"
          ]
        },
        "reversed": {
          "summary": "你可能因為過度孤立而忽視了你的健康問題，或者拒絕尋求必要的醫療幫助。",
          "details": [
            "你是否因為害怕而不敢去看醫生，或者固執地相信自己可以獨自解決所有問題？",
            "心理上的孤獨感可能會加劇你的生理症狀。",
            "你需要向外界求助。與家人、朋友或專業人士談談你的健康問題，會讓你感到不再孤單。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正走在一條向內探索的道路上，尋求靈魂深處的智慧和真理。",
          "details": [
            "這是你生命中的一個『朝聖之旅』。關掉外界的噪音，傾聽你內心的聲音。",
            "你不需要向任何人證明什麼。你的旅程是個人的，你的答案只能在你自己身上找到。",
            "相信你內在的提燈人，他會引導你穿過黑暗，找到屬於你自己的光明。"
          ]
        },
        "reversed": {
          "summary": "你可能在逃避必要的內省，或者在獨處的道路上迷失了方向。",
          "details": [
            "你是否害怕獨自面對你內心的陰影和恐懼？",
            "你可能感到與你的內在指引失去了連結，不知道下一步該往哪裡走。",
            "不要害怕。即使在最深的黑暗中，你內在的光芒也從未熄滅。你需要重新點燃它，或者尋求一位導師來幫助你找到方向。"
          ]
        }
      }
    }
  },
  {
    "id": "wheel_of_fortune",
    "name": "命運之輪",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你的愛情生活即將迎來一個重大的、通常是積極的轉折點。",
          "details": [
            "命運正在介入，可能會帶來一段意想不到的新戀情，或者讓現有關係進入下一個階段。",
            "這是一個關於『時機』的時刻。過去的努力或等待即將得到回報。",
            "順應這股變化的能量，保持開放的心態，好運正在向你走來。"
          ]
        },
        "reversed": {
          "summary": "愛情中出現了意料之外的波折和不穩定，讓你感到失控。",
          "details": [
            "事情的發展可能不如你所願，讓你感到沮海外和失望。",
            "這段時間的混亂和不確定性讓你對關係的未來感到擔憂。",
            "記住，命運之輪總是在轉動的。即使現在處於低谷，這也只是暫時的。從這次經歷中學習，為下一次的上升做好準備。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的事業將迎來一個重要的機會和轉變，好運降臨。",
          "details": [
            "一個意想不到的晉升、工作機會或專案可能會突然出現。",
            "你正處於一個正確的時間和正確的地點。你的事業將會進入一個上升的軌道。",
            "抓住這個機會，但要記住保持謙遜，因為命運之輪總是在轉動。"
          ]
        },
        "reversed": {
          "summary": "事業上遇到了意料之外的挫折和延誤，讓你感到力不從心。",
          "details": [
            "一個本來看似板上釘釘的機會可能突然告吹，或者專案進展受阻。",
            "你可能感到自己是外部環境變化的受害者，對局面失去了控制。",
            "不要抵抗變化。接受這個暫時的低潮，重新評估你的計畫，並從中吸取教訓。這段經歷將使你在未來變得更強大。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你的人際關係網絡將發生變化，可能會遇到新的、重要的朋友。",
          "details": [
            "你的社交圈子可能會擴大，你會遇到一些能給你帶來好運和新機會的人。",
            "一段友誼可能會發生意想不到的積極轉變，變得更加親密。",
            "順其自然，享受這段充滿活力的社交時期。"
          ]
        },
        "reversed": {
          "summary": "人際關係中出現了動盪和不確定性，讓你感到不安。",
          "details": [
            "你和朋友之間的關係可能因為一些外部因素而變得緊張。",
            "你可能感到自己的社交生活失去了控制，事情的發展出乎你的意料。",
            "在混亂中保持冷靜。不要做出任何衝動的決定。當塵埃落定後，你將會看清誰是真正的朋友。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康狀況將迎來一個積極的轉機。",
          "details": [
            "如果你正在生病，這張牌預示著一個意想不到的好轉或康復的開始。",
            "這是一個改變生活習慣、開始新的健康計畫的好時機，你會得到事半功倍的效果。",
            "你的能量水平正在提升，整體感覺良好。"
          ]
        },
        "reversed": {
          "summary": "健康上出現了意料之外的問題或反覆，讓你感到沮喪。",
          "details": [
            "一個本已好轉的健康問題可能突然復發，或者出現新的、意想不到的症狀。",
            "你可能感到自己的健康狀況失控，讓你感到無助和焦慮。",
            "不要灰心。這只是康復過程中的一個波折。你需要耐心，並與你的醫生密切合作，共同應對這個挑戰。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你的人生正處於一個關鍵的轉折點，宇宙正在為你開啟一扇新的大門。",
          "details": [
            "這是一個關於『宿命』和『機遇』的時刻。你過去的所作所為，無論好壞，都將在此刻得到回報或結果。",
            "你無法控制輪子的轉動，但你可以選擇如何應對。擁抱變化，相信宇宙的安排。",
            "這是一個週期的結束，也是另一個週期的開始。準備好迎接你人生的下一個篇章。"
          ]
        },
        "reversed": {
          "summary": "你可能在抗拒一個不可避免的改變，或者感到自己是命運的犧牲品。",
          "details": [
            "你是否在試圖控制一些你根本無法控制的事情？這種抗拒只會給你帶來更多的痛苦。",
            "你可能因為一系列的壞運氣而感到沮喪，覺得整個世界都在與你作對。",
            "你需要學會放手。接受『世事無常』這個宇宙法則。當你停止抗拒，順應流動時，你才能重新找到你的力量。"
          ]
        }
      }
    }
  },
  {
    "id": "justice",
    "name": "正義",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段建立在公平、誠實和理性基礎上的關係。",
          "details": [
            "你們的關係是平等的，雙方都願意為這段關係承擔應有的責任。",
            "這張牌常常與法律層面的結合有關，例如婚姻、婚前協議或同居協議。",
            "在做出任何關於關係的重大決定時，請保持客觀和理性，不要被情緒所左右。"
          ]
        },
        "reversed": {
          "summary": "關係中存在不公平、欺騙或逃避責任的問題。",
          "details": [
            "你是否感到在這段關係中，你付出的遠比得到的多？或者反之？",
            "過去未解決的爭端或謊言可能會浮出水面，現在是面對真相的時候了。",
            "不要因為偏見或不實的指責而做出錯誤的判斷，你需要尋找客觀的證據。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的努力將得到公平的回報，是時候簽署合約或解決法律糾紛了。",
          "details": [
            "因果報應的時刻。如果你一直努力工作，你將得到應得的獎勵或晉升。",
            "這是一個處理法律文件、簽署合約或進行商業談判的絕佳時機，你會得到一個公平的結果。",
            "在工作中，請保持絕對的誠信和客觀，這會為你贏得長期的聲譽。"
          ]
        },
        "reversed": {
          "summary": "你可能在工作中遭遇了不公平的對待，或者你的不誠實行為將被揭露。",
          "details": [
            "你是否感到自己的功勞被他人搶走，或者在績效評估中得到了不公正的評價？",
            "如果你在工作中走了捷徑或做了不誠實的事情，現在它們很可能會被曝光。",
            "避免任何法律上的糾紛，在做出任何有爭議的決定前，請務必諮詢專業人士。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "在人際關係中，公平和誠信是你最重要的原則。",
          "details": [
            "你能夠客觀地看待朋友之間的爭執，並給出公正的建議，因此深受大家信賴。",
            "你為自己的言行負責，這讓你成為一個非常可靠和值得交往的朋友。",
            "這是一個解決與朋友之間長期誤會的好時機，坦誠的溝通將會帶來和解。"
          ]
        },
        "reversed": {
          "summary": "你可能對朋友抱有偏見，或在人際關係中採取了雙重標準。",
          "details": [
            "你是否在用一套標準要求自己，卻用另一套更嚴苛的標準去評判你的朋友？",
            "你可能因為一些不實的謠言而對某個朋友產生了誤解，你需要去尋找真相。",
            "反思一下你最近是否做出了任何不負責任或不誠實的行為，如果是，現在是時候去道歉和彌補了。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康狀況取決於你生活方式的平衡。",
          "details": [
            "這張牌強調的是因果關係。你今天為健康付出的努力，都會在未來得到回報。",
            "你需要一個均衡的飲食、規律的運動和充足的休息，任何一方面的失衡都會影響整體健康。",
            "如果你正在等待一份體檢報告或診斷結果，它將會是一個客觀而準確的反映。"
          ]
        },
        "reversed": {
          "summary": "不平衡的生活方式正在對你的健康造成損害。",
          "details": [
            "你可能因為工作過度而犧牲了休息，或者因為飲食不均而導致營養不良。",
            "你在為過去不健康的生活方式付出代價，現在是時候正視問題，並做出徹底的改變了。",
            "不要再為自己的壞習慣找藉口，你需要對自己的健康負起全部的責任。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "這是為你的人生做出一次公正的審視，並為你的選擇負責的時刻。",
          "details": [
            "客觀地回顧你的人生道路，看看你的哪些選擇導致了現在的結果。從中學習，不要評判。",
            "你需要做出一個重要的、理性的決定。收集所有相關資訊，權衡利弊，然後做出最符合你長遠利益的選擇。",
            "這張牌的核心是『真理』。對自己誠實，勇敢地去面對那些你可能一直不願承認的真相。"
          ]
        },
        "reversed": {
          "summary": "你可能在逃避為自己的行為承擔責任，或在自我評判中過於苛刻。",
          "details": [
            "你是否總是在為自己的失敗找藉口，將責任推卸給他人或環境？",
            "另一種可能是，你陷入了無休止的自責中，無法原諒自己過去的錯誤。你需要學會寬恕自己。",
            "你可能因為害怕真相而不敢做出決定，但逃避只會讓情況變得更糟。你需要的是勇氣和誠實。"
          ]
        }
      }
    }
  },
  {
    "id": "the_hanged_man",
    "name": "吊人",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "是時候暫停一下，用一個全新的視角來看待你的感情生活了。",
          "details": [
            "如果你正在一段關係中，這張牌暗示著一個『暫停期』。這不是結束，而是給彼此一些空間去反思。",
            "有時候，為了關係的長遠發展，需要做出一些短期的犧牲。",
            "試著從對方的角度看問題，你會對你們的關係有全新的理解和洞見。"
          ]
        },
        "reversed": {
          "summary": "你可能在關係中做出了無謂的犧牲，或者因為害怕改變而停滯不前。",
          "details": [
            "你是否感到你的付出沒有得到應有的回報，或者你一直在為一個不值得的人浪費時間？",
            "你可能被困在一個不健康的關係中，卻因為害怕孤獨而不敢離開。",
            "現在是時候採取行動了。無休止的等待和犧牲並不能解決問題，你需要為自己的幸福做出決斷。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的專案或事業可能需要暫時擱置，以便你從新的角度尋找突破口。",
          "details": [
            "當你感到卡關時，最好的方法不是埋頭硬幹，而是退後一步，審視全局。",
            "這是一個『以退為進』的策略。利用這段時間去學習、思考、規劃，而不是急於行動。",
            "你的耐心和等待將會換來一個更有創意的解決方案或一個更好的時機。"
          ]
        },
        "reversed": {
          "summary": "你的努力和犧牲沒有得到回報，或者你因為拖延而錯失了良機。",
          "details": [
            "你可能在一個沒有前景的專案上浪費了太多的時間和精力，是時候考慮止損了。",
            "你是否因為猶豫不決而錯過了一個重要的截止日期或機會？",
            "你需要打破目前的僵局。有時候，即使是一個錯誤的行動，也比完全不行動要好。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "試著從朋友的角度看問題，你的同理心將會化解矛盾。",
          "details": [
            "如果你和朋友之間有誤會，暫時不要急於解釋或爭辯，先靜下來，試著去理解對方的立場。",
            "有時候，為了維持一段重要的友誼，需要做出一些小小的讓步或犧牲。",
            "這是一個練習換位思考和無私付出的好時機，你會因此變得更加成熟。"
          ]
        },
        "reversed": {
          "summary": "你可能感到在友誼中被誤解或被利用，你的付出沒有得到尊重。",
          "details": [
            "你是否總是在遷就朋友，而忽略了自己的感受和需求？",
            "你需要設立健康的界線，一段好的友誼不應該讓你感到委屈和犧牲。",
            "如果你感到被朋友誤解，不要再沉默了。勇敢地、平靜地表達你的真實想法。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身體需要休息和放鬆，是時候暫停一下了。",
          "details": [
            "這張牌常常與需要『懸掛』或『倒立』的運動有關，例如瑜伽、空中瑜伽或倒立機。",
            "如果你正在從疾病或手術中恢復，請給予你的身體足夠的時間去療癒，不要急於恢復正常活動。",
            "這也是一個進行心理排毒的好時機，放下你的焦慮和壓力，讓你的心靈得到喘息。"
          ]
        },
        "reversed": {
          "summary": "你可能在逃避一個健康問題，或者因為拖延而讓小病變成了大問題。",
          "details": [
            "你是否一直在忽視身體的某些不適，告訴自己『沒關係』？現在是正視它的時候了。",
            "你可能因為害怕聽到壞消息而不敢去看醫生，但拖延只會讓情況變得更糟。",
            "你需要打破目前的僵局，立即採取行動，為你的健康負責。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "放下你的舊有觀念，從一個完全相反的角度來看待世界，你將獲得靈性的頓悟。",
          "details": [
            "世界在你眼中是顛倒的，還是你其實是顛倒地看世界？這是一個深刻的哲學問題。",
            "這張牌邀請你臣服於生命之流，放棄無謂的掙扎和控制，你會發現一切都恰到好處。",
            "透過犧牲小我（ego），你將會獲得與宇宙合一的大智慧。這是一次靈魂的洗禮。"
          ]
        },
        "reversed": {
          "summary": "你因為固執己見而卡在一個困境中，拒絕接受新的可能性。",
          "details": [
            "你是否緊抓著一個不再適合你的信念或身份不放，即使它給你帶來了痛苦？",
            "你害怕改變，害怕放手，因為你無法想像一個沒有它的未來。",
            "你需要明白，有時候，你必須先放手，才能騰出手來，去擁抱更好的東西。這個犧牲是值得的。"
          ]
        }
      }
    }
  },
  {
    "id": "death",
    "name": "死神",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段關係的結束，是為了給新的、更適合你的關係騰出空間。",
          "details": [
            "這張牌並不總是代表物理上的分手，它更多地是指一種深刻的轉變，例如從迷戀到真愛，或結束不健康的依賴。",
            "雖然這個過程可能伴隨著痛苦，但它是一個必要的清理，讓你能夠迎接一個更真實的未來。",
            "不要抗拒這個結束，它是你成長的催化劑。學會放手，你會發現更好的正在前方等你。"
          ]
        },
        "reversed": {
          "summary": "你正在抗拒一個不可避免的結束，導致痛苦的延長。",
          "details": [
            "你可能因為害怕孤獨而緊抓著一段已經名存實亡的關係不放。",
            "你無法從過去的傷痛中走出來，這讓你無法開始新的生活。",
            "你需要明白，抗拒改變比改變本身更痛苦。勇敢地面對結束，才能迎來真正的新生。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "一個舊的職業生涯或專案即將結束，一個全新的開始正在等待著你。",
          "details": [
            "這可能意味著裁員、辭職或一個重大專案的終結。雖然令人不安，但這是一個清理和重塑的機會。",
            "你需要放下那些不再為你服務的工作模式或職業道路，去探索新的可能性。",
            "這是一個徹底轉型的時刻，不要害怕從零開始，你的未來充滿了新的潛力。"
          ]
        },
        "reversed": {
          "summary": "你正在抗拒工作上必要的變革，導致自己停滯不前，處於危險之中。",
          "details": [
            "你可能因為害怕失去安全感而拒絕學習新技能或接受新的工作模式。",
            "公司的轉型或市場的變化是不可避免的，如果你不隨之改變，你將被淘汰。",
            "不要再懷念過去的『好時光』了。你需要向前看，積極地擁抱變化，才能在新的環境中找到你的位置。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "一些舊的友誼可能需要結束，以便為新的、更健康的關係讓路。",
          "details": [
            "你可能會意識到，某些朋友已經不再和你在同一個成長軌道上，是時候優雅地告別了。",
            "這個結束是自然且必要的，它會為你的社交圈帶來新的、更積極的能量。",
            "不要為失去而悲傷，為即將到來的新連結而慶祝吧。"
          ]
        },
        "reversed": {
          "summary": "你緊抓著一段有毒的或已經結束的友誼不放，這正在消耗你的能量。",
          "details": [
            "你是否因為念舊或害怕衝突，而無法離開一個不斷給你帶來負面影響的朋友？",
            "你需要為自己的人際關係進行一次『斷捨離』，清除那些不再滋養你的連結。",
            "學會設立界線，並勇敢地告別。你的能量應該用在那些能讓你變得更好的人身上。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "是時候徹底告別一個嚴重損害你健康的不良習慣了。",
          "details": [
            "這張牌代表著一個徹底的轉變。如果你有吸菸、酗酒或不健康的飲食習慣，現在是徹底戒除它們的時候了。",
            "這個過程可能像經歷一次『戒斷症狀』一樣痛苦，但這是通往新生的必經之路。",
            "這也可能代表一個手術，它會切除你身體的病灶，為你帶來長期的健康。"
          ]
        },
        "reversed": {
          "summary": "你正在抗拒一個對你健康至關重要的改變，這可能會導致嚴重的後果。",
          "details": [
            "你可能因為害怕手術或治療的痛苦，而選擇了逃避，但這只會讓病情惡化。",
            "你明知道自己的某个習慣非常有害，但就是無法下定決心去改變它。",
            "你需要尋求外部的幫助和支持，无论是來自醫生、家人還是支持團體。你不需要獨自面對這場戰鬥。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在經歷一次深刻的蛻變，舊的自我正在死去，新的自我即將誕生。",
          "details": [
            "這是一個放下不再屬於你的身份、信念和行為模式的過程。",
            "這個過程可能會讓你感到迷失和恐懼，因為你正在告別你所熟悉的一切。",
            "請相信這個轉化的力量。當你從灰燼中重生時，你會變得比以往任何時候都更強大、更真實。"
          ]
        },
        "reversed": {
          "summary": "你極度害怕改變，緊抓著舊的自我不放，導致靈魂的停滯。",
          "details": [
            "你是否寧願忍受熟悉的痛苦，也不願面對未知的未來？",
            "你可能正在經歷一段憂鬱或麻木的時期，因為你的靈魂渴望改變，而你的頭腦卻在抗拒。",
            "你需要明白，『死亡』並不是終點，而是一個新的開始。你需要勇敢地放手，讓自己重生。"
          ]
        }
      }
    }
  },
  {
    "id": "temperance",
    "name": "節制",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段和諧、平衡且充滿耐心的關係，你們是彼此完美的補充。",
          "details": [
            "你們找到了將彼此的差異完美融合的方式，創造出一個『1+1>2』的和諧整體。",
            "這是一段溫和、平靜且充滿療癒力量的愛情，你們在彼此的陪伴中共同成長。",
            "耐心是這段關係的關鍵。慢慢來，享受這個相互調和、逐漸加深的過程。"
          ]
        },
        "reversed": {
          "summary": "關係失去了平衡，充滿了極端的情緒和行為。",
          "details": [
            "你們的關係可能在兩個極端之間搖擺：一時極度親密，一時又極度冷漠。",
            "你或你的伴侶可能缺乏耐心，總是急於求成，導致關係中充滿了不必要的衝突。",
            "你需要退後一步，尋找你們生活中的中間地帶。學會妥協和調和是你們現在最重要的課題。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的耐心和合作精神將幫助你調和不同的意見，創造出卓越的成果。",
          "details": [
            "你是一個出色的團隊合作者，能夠將不同部門或不同觀點的人凝聚在一起。",
            "在執行一個長期專案時，你的耐心和遠見將是成功的關鍵。不要急於看到結果。",
            "這是一個適合進行談判、調解或任何需要高度合作工作的時期。"
          ]
        },
        "reversed": {
          "summary": "團隊合作出現問題，或者你因為急躁而造成了混亂。",
          "details": [
            "你可能與你的同事或合作夥伴產生了嚴重的衝突，導致專案停滯不前。",
            "你是否因為過於追求短期利益而破壞了長期的計畫？",
            "你需要放慢腳步，重新評估你的策略。學會傾聽他人的意見，尋找一個對所有人都公平的解決方案。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是朋友圈中的和平使者，總能用你的智慧化解衝突。",
          "details": [
            "你擁有與不同類型的人和諧相處的能力，你的社交圈子因此非常廣泛。",
            "當朋友們需要一個中立的傾聽者或調解人時，他們總會來找你。",
            "你的耐心和同理心是你最寶貴的社交資產，繼續用它們來創造和諧的人際關係吧。"
          ]
        },
        "reversed": {
          "summary": "你可能因為缺乏耐心而與朋友產生摩擦，或感到與周圍的環境格格不入。",
          "details": [
            "你是否覺得身邊的人都與你意見不合，讓你感到不耐煩和沮喪？",
            "你需要學會包容與你不同的人和觀點，世界不是非黑即白的。",
            "在做出任何評判之前，先嘗試去理解對方的處境。一點點的同理心就能避免許多不必要的衝突。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "『中庸之道』是你健康的關鍵詞。",
          "details": [
            "你的健康需要全面的平衡：均衡的飲食、適度的運動、充足的休息和穩定的情緒。",
            "這是一個進行溫和療癒的好時機，例如芳香療法、聲音治療或能量治療。",
            "傾聽你身體的聲音，它會告訴你它需要什麼。學會與你的身體和諧共處。"
          ]
        },
        "reversed": {
          "summary": "極端的生活方式正在損害你的健康。",
          "details": [
            "你可能在暴飲暴食和過度節食之間搖擺，或者在過度勞累和極度懶散之間切換。",
            "這種失衡正在對你的身心造成壓力，你需要盡快找到一個可持續的中間路線。",
            "從一個小的、容易實現的目標開始，例如『每天散步20分鐘』，逐步重建你的健康平衡。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在將內在相互矛盾的部分完美地融合，達到一個更高層次的和諧。",
          "details": [
            "這是一個煉金術般的過程，你正在將你生命中看似對立的元素（如工作與生活、理智與情感）轉化為一個和諧的整體。",
            "你擁有強大的內在平靜和智慧，能夠以一種超然的態度看待生活中的起起落落。",
            "你的耐心、遠見和適應能力是你此刻最強大的力量。"
          ]
        },
        "reversed": {
          "summary": "你感到內心充滿衝突，在兩個極端之間搖擺不定，找不到方向。",
          "details": [
            "你是否感到自己的人格是分裂的，在不同的場合扮演著完全不同的角色？",
            "你可能因為缺乏一個明確的長期目標，而將精力浪費在許多短期的、相互衝突的事物上。",
            "你需要尋找你的『中心』。冥想、寫日記或與一位智者交談，都能幫助你重新整合內在，找到平衡點。"
          ]
        }
      }
    }
  },
  {
    "id": "the_devil",
    "name": "惡魔",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段充滿激情、慾望但可能不健康的關係，你被束縛住了。",
          "details": [
            "你們之間的吸引力非常強烈，但這段關係可能建立在物質、慾望或相互依賴之上，而非真愛。",
            "你可能感到自己被困在這段關係中，無法離開，即使你知道它對你無益。",
            "你需要誠實地問自己，這段關係是滋養你，還是在消耗你？你所謂的『愛』，是否只是對失去的恐懼？"
          ]
        },
        "reversed": {
          "summary": "你正在意識到關係中的束縛，並開始尋求掙脫和自由。",
          "details": [
            "你終於看清了這段關係不健康的一面，並開始質疑它。這是解放的第一步。",
            "掙脫束縛的過程可能會很困難，但這是你重獲獨立和自由的必經之路。",
            "你正在打破一個有害的愛情模式，這將為你未來建立更健康的關係鋪平道路。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你可能被一份高薪但讓你痛苦的工作所束縛，或者在工作中感到了誘惑。",
          "details": [
            "你是否為了金錢或地位，而留在一份你討厭的工作中？你感到自己像被金手銬鎖住了。",
            "小心工作中的權力鬥爭、不道德的誘惑或成癮性的工作模式（工作狂）。",
            "這張牌提醒你要警惕那些看起來很美好但代價高昂的捷徑。"
          ]
        },
        "reversed": {
          "summary": "你正在擺脫一個有毒的工作環境，或意識到自己工作成癮的問題。",
          "details": [
            "你可能決定辭職，離開一個讓你感到壓抑和不快樂的工作場所。",
            "你開始意識到工作與生活的平衡是多麼重要，並採取行動來改變現狀。",
            "這是一個重新評估你的職業目標，尋找一份真正能讓你感到自由和有價值的工作的時機。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你可能被一段有毒的友誼或不健康的社交圈子所束縛。",
          "details": [
            "這段關係可能充滿了嫉妒、控制和負能量，但你卻因為某些原因而無法離開。",
            "你是否在一個讓你感到不舒服，但為了利益或歸屬感而必須迎合的圈子裡？",
            "你需要識別出那些正在消耗你能量的人際關係，並找到擺脫它們的勇氣。"
          ]
        },
        "reversed": {
          "summary": "你正在掙脫一段不健康的友誼，或看清了某人的真面目。",
          "details": [
            "你終於下定決心，與那個不斷給你帶來負面影響的朋友保持距離。",
            "你意識到，真正的友誼不應該是相互束縛，而是相互支持和共同成長。",
            "這個過程可能會讓你暫時感到孤獨，但這是建立更健康社交網絡的必要步驟。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你可能沉迷於某種不健康的習慣或成癮行為。",
          "details": [
            "這張牌直接指向成癮問題，如菸、酒、藥物、賭博或暴飲暴食。",
            "你的健康問題可能根植於心理層面的束縛，如壓力、焦慮或負面的自我認知。",
            "現在是時候尋求專業幫助了。承認問題的存在，是解決問題的第一步。"
          ]
        },
        "reversed": {
          "summary": "你正在努力戒除一個壞習慣，或開始正視自己的心理健康問題。",
          "details": [
            "你已經意識到問題的嚴重性，並開始採取行動來擺脫成癮或不健康的模式。",
            "這是一個充滿挑戰但非常有希望的過程。請為自己邁出的每一步感到驕傲。",
            "尋求支持系統的幫助，無論是家人、朋友還是專業的治療師，都會讓這條路走得更容易一些。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "是時候勇敢地直面你內心的陰影、恐懼和慾望了。",
          "details": [
            "你被自己內心的某些東西所束縛，可能是物質慾望、錯誤的信念，或是對過去的執著。",
            "這張牌邀請你深入你的潛意識，去看看那些你一直不願承認的、被你壓抑的部分。",
            "只有當你承認並理解你的陰影時，你才能真正地從它的束縛中解脫出來。"
          ]
        },
        "reversed": {
          "summary": "你正在打破限制你的內在枷鎖，走向真正的自由和覺醒。",
          "details": [
            "你正在經歷一個深刻的自我揭示過程，看清了那些一直以來束縛你的假象。",
            "這是一個釋放舊有創傷、打破負面思維模式的絕佳時機。",
            "你正在收回你的力量，不再做自己慾望或恐懼的奴隸。你正在成為自己真正的主人。"
          ]
        }
      }
    }
  },
  {
    "id": "the_tower",
    "name": "高塔",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一個突如其來的、震撼性的事件將徹底顛覆你們的關係。",
          "details": [
            "這可能是一場突如其來的分手、一個被揭露的謊言，或是一次徹底動搖關係基礎的爭吵。",
            "雖然這個過程極其痛苦，但它摧毀的是一個建立在虛假或不穩固基礎上的結構。",
            "這個崩塌是為了讓你們有機會在更真實、更穩固的基礎上重建，或者徹底離開，去尋找更適合的關係。"
          ]
        },
        "reversed": {
          "summary": "你正在預感一場危機的到來，並試圖避免它，或者危機的衝擊沒有預想中那麼大。",
          "details": [
            "你可能已經意識到關係中存在著巨大的問題，但你一直在逃避，不願面對。",
            "你可能僥倖躲過了一次大的分手危機，但根本問題依然存在，隨時可能再次爆發。",
            "不要再自欺欺人了。主動去面對和解決問題，雖然痛苦，但遠比等待高塔在最意想不到的時候崩塌要好。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的事業將遭遇一次突如其來的、顛覆性的打擊。",
          "details": [
            "這可能是一次突然的裁員、一個重大專案的徹底失敗，甚至是公司的倒閉。",
            "所有你認為穩固的結構——你的職位、你的權威、你的計畫——都將在瞬間崩塌。",
            "雖然這是一場災難，但它也給了你一個徹底擺脫舊有束縛、從零開始的機會。在廢墟之上，你才能建造真正屬於你的東西。"
          ]
        },
        "reversed": {
          "summary": "你正在避免一場本該發生的職業危機，或者危機的影響被減弱了。",
          "details": [
            "你可能明知道公司或行業正在走向衰退，但你卻因為害怕改變而選擇視而不見。",
            "你可能僥倖躲過了一次裁員，但這並不意味著警報已經解除。",
            "這張牌警告你，不要抗拒必要的改變。如果你現在不主動跳出這座搖搖欲墜的高塔，當它倒塌時，你會被埋在下面。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "一段友誼或一個社交圈子將因為一次突發事件而徹底破裂。",
          "details": [
            "這可能是一次激烈的爭吵、一個背叛行為的曝光，導致信任的徹底崩潰。",
            "你可能會突然發現，你所在的社交圈子是建立在謊言或虛假的價值觀之上的。",
            "雖然失去朋友是痛苦的，但這個事件幫助你看清了真相，讓你能夠離開不健康的關係。"
          ]
        },
        "reversed": {
          "summary": "你正在努力維繫一段瀕臨破裂的關係，或者避免一場不可避免的衝突。",
          "details": [
            "你和朋友之間可能存在著巨大的矛盾，但你們都在假裝一切都好。",
            "這種粉飾太平的狀態是無法持久的，被壓抑的能量只會以更具破壞性的方式爆發。",
            "你需要勇氣去面對這個潛在的衝突。一次坦誠的、即使是痛苦的對話，也比在謊言中煎熬要好。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康可能出現突如其來的危機。",
          "details": [
            "這可能是一次意外的傷害、一個急性疾病的發作，或是一個令人震驚的診斷結果。",
            "這個事件迫使你徹底重新審視你的生活方式和健康觀念。",
            "雖然這是一個巨大的打擊，但它也是一個警鐘，提醒你必須做出徹底的改變，才能重獲健康。"
          ]
        },
        "reversed": {
          "summary": "你可能在忽視一個嚴重的健康警訊，或者一個潛在的危機被你僥倖避免了。",
          "details": [
            "你是否一直在忽視身體的疼痛或不適？不要再拖延了，立即去看醫生。",
            "你可能逃過了一次意外，或者一個疾病的早期症狀自行緩解了，但這不代表問題已經解決。",
            "你需要從根本上改變你的生活方式，而不是僅僅祈禱壞事不要發生。主動預防遠勝於被動治療。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "一個長期以來你所信賴的核心信念或自我認知，將被徹底顛覆。",
          "details": [
            "這是一次『覺醒』，雖然過程可能是痛苦和混亂的，因為你整個世界觀都崩塌了。",
            "所有你認為理所當然的、你賴以建立自我認知的基礎，都被證明是虛假的。",
            "不要害怕這個過程。只有當舊的監獄被摧毀，你的靈魂才能獲得真正的自由，去建立一個更廣闊、更真實的實相。"
          ]
        },
        "reversed": {
          "summary": "你正在抗拒一次必要的、痛苦的自我轉變。",
          "details": [
            "你可能已經意識到你的某些核心信念是錯誤的，但你因為害怕失去身份認同而不敢放手。",
            "你緊緊地抓住舊的結構不放，即使它已經搖搖欲墜，因為你害怕未知。",
            "改變是不可避免的。你越是抗拒，這個過程就會越痛苦。學會放手，讓舊的自我死去，新的你才能誕生。"
          ]
        }
      }
    }
  },
  {
    "id": "the_star",
    "name": "星星",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "在經歷了一段困難時期後，你的愛情生活終於迎來了希望、療癒和寧靜。",
          "details": [
            "如果你剛結束一段痛苦的關係，這張牌預示著療癒的開始，你將重拾對愛的信心。",
            "這是一段充滿靈性連結和真誠交流的關係，你們能夠在彼此面前展現最真實的一面。",
            "保持希望和樂觀，宇宙正在引導你走向一段更光明、更充滿愛的未來。"
          ]
        },
        "reversed": {
          "summary": "你可能對愛情感到失望和幻滅，暫時失去了希望。",
          "details": [
            "過去的傷害可能讓你對建立新的關係感到恐懼和不信任。",
            "你可能感到與伴侶之間失去了連結，關係變得冷淡和缺乏靈感。",
            "你需要給自己一些時間來療癒。不要強迫自己，當你準備好時，愛的光芒自然會再次照耀你。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的事業前景一片光明，充滿了靈感、希望和新的機會。",
          "details": [
            "這是一個追隨你內心真正熱情的絕佳時機，做你熱愛的工作，成功將會隨之而來。",
            "你的才華和創造力將得到他人的認可，你可能會在一個公開的場合大放異彩。",
            "相信你的願景，並朝著你的目標前進。宇宙正在為你鋪平道路。"
          ]
        },
        "reversed": {
          "summary": "在工作中感到缺乏靈感、目標不明確，或對自己的職業道路感到失望。",
          "details": [
            "你可能感到目前的工作讓你筋疲力盡，耗盡了你所有的創造力。",
            "你是否對自己的職業未來感到迷茫，不知道下一步該往哪裡走？",
            "你需要重新連結你的內在指引。花些時間去思考什麼樣的工作才能真正點燃你的熱情。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你的人際關係充滿了真誠、希望和相互支持。",
          "details": [
            "你正在與朋友們建立深刻而有意義的連結，你們能夠相互啟發，共同成長。",
            "這是一個拓展社交圈的好時機，你會吸引來那些與你頻率相同、充滿正能量的人。",
            "在團體中，慷慨地分享你的希望和靈感，你的積極性會感染身邊的每一個人。"
          ]
        },
        "reversed": {
          "summary": "在社交中感到孤獨、脫節，或對人際關係感到失望。",
          "details": [
            "你可能感到與朋友們格格不入，或者覺得沒有人能夠真正地理解你。",
            "你可能需要暫時從社交媒體或大型聚會中抽離，給自己一些安靜的時間。",
            "不要對人性失去信心。當你重新找回內在的平靜和希望時，你自然會吸引來真誠的友誼。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "這是一張代表著療癒和恢復的牌，你的健康狀況將得到極大的改善。",
          "details": [
            "如果你正在從疾病中恢復，這張牌預示著一個充滿希望的康復過程。",
            "任何與水有關的治療方法，如水療、游泳或僅僅是多喝水，都對你非常有益。",
            "心理健康方面，這是一個釋放過去創傷、重獲內心平靜的絕佳時機。"
          ]
        },
        "reversed": {
          "summary": "你可能對自己的健康狀況感到悲觀和絕望。",
          "details": [
            "你是否因為長期的病痛而對康復失去了信心？請不要放棄希望。",
            "你可能感到身心俱疲，缺乏任何改變現狀的動力。",
            "你需要重新點燃希望的火花。尋求支持，無論是來自醫生、家人還是病友團體，都會對你有所幫助。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "在黑暗之後，你終於找到了指引你的那顆星，充滿了希望和信念。",
          "details": [
            "這是一個與宇宙重新連結、感受靈性指引的時刻。你的直覺非常敏銳。",
            "相信你的夢想，並勇敢地去追隨它們。你正走在一條正確的道路上。",
            "你內在的光芒正在閃耀，它不僅照亮了你自己的道路，也將為他人帶來希望。"
          ]
        },
        "reversed": {
          "summary": "你感到迷失在黑暗中，暫時與你的內在指引和希望失去了連結。",
          "details": [
            "你可能對未來感到極度的迷茫和不確定，甚至開始懷疑自己的人生目標。",
            "不要讓絕望吞噬你。即使在最黑暗的夜晚，星星也依然在那裡，只是暫時被烏雲遮蔽了。",
            "你需要重新找回你的信念。從小事做起，做一些能讓你感到快樂和有意義的事情，逐步找回你的光芒。"
          ]
        }
      }
    }
  },
  {
    "id": "the_moon",
    "name": "月亮",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "關係中充滿了不確定性、幻想和隱藏的情緒。",
          "details": [
            "你或你的伴侶可能沒有完全坦誠，關係中存在著秘密或誤解。",
            "你的不安全感和嫉妒心可能被放大，讓你對關係產生了許多不必要的猜疑。",
            "這張牌提醒你要相信你的直覺。如果你感覺不對勁，那很可能就是真的不對勁。"
          ]
        },
        "reversed": {
          "summary": "混亂和誤解正在消散，真相即將水落石出。",
          "details": [
            "一個長期存在的秘密或謊言將被揭露，雖然過程可能痛苦，但這是關係走向健康的必要步驟。",
            "你正在從自己的幻想中清醒過來，能夠更清晰、更理性地看待這段關係。",
            "是時候進行一次開誠布公的對話，澄清所有的誤會和猜疑了。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "工作環境中充滿了不確定性、資訊不明或潛在的風險。",
          "details": [
            "你可能對自己的職業道路感到迷茫，不清楚下一步該怎麼走。",
            "小心辦公室政治或背後的謠言，你所聽到的可能不是全部的真相。",
            "在做出任何重大的職業決定前，請務必做好充分的調查，不要僅僅依賴直覺。"
          ]
        },
        "reversed": {
          "summary": "混亂的局面開始變得清晰，你逐漸找到了方向。",
          "details": [
            "你可能發現了一個之前被隱藏的機會，或者一個複雜問題的解決方案變得清晰起來。",
            "你正在克服工作中的恐懼和焦慮，重拾自信。",
            "這是一個理清思路、制定清晰計畫的好時機。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "人際關係中可能存在誤解、猜忌或背後的閒話。",
          "details": [
            "你可能感覺朋友之間有些事情沒有說開，氣氛有些詭異。",
            "警惕那些看似友好但意圖不明的人，不要輕易地吐露你的秘密。",
            "你的直覺在人際交往中非常重要，它可以幫助你分辨誰是真正的朋友。"
          ]
        },
        "reversed": {
          "summary": "一個長期的誤會得到澄清，或者你選擇遠離一個有毒的社交圈。",
          "details": [
            "你終於看清了某個朋友的真面目，或者一個關於你的謠言被澄清了。",
            "你正在從不健康的社交焦慮中走出來，能夠更輕鬆、更自信地與人交往。",
            "這是清理你的社交網絡，只留下那些真誠、積極的朋友的好時機。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康問題可能與心理壓力和情緒有關，或者難以診斷。",
          "details": [
            "這張牌強烈指向與焦慮、憂鬱、失眠或夢境相關的心理健康問題。",
            "你的身體症狀可能很模糊，難以被現代醫學診斷，可以考慮尋求替代療法的幫助。",
            "注意你的內分泌系統和生理週期，它們可能因為情緒的波動而失調。"
          ]
        },
        "reversed": {
          "summary": "你正在正視並處理一個長期存在的心理或情緒問題。",
          "details": [
            "你開始理解你的生理症狀背後的心理根源，並尋求有效的治療。",
            "你正在從長期的焦慮或憂鬱中逐漸恢復，找到了管理自己情緒的方法。",
            "一個之前難以診斷的健康問題，現在終於找到了原因和解決方案。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "這是深入探索你潛意識、夢境和內心最深層恐懼的時刻。",
          "details": [
            "月亮邀請你走進你內心的黑暗森林，去面對那些你一直不敢觸碰的陰影和創傷。",
            "你的夢境在這段時間會非常活躍且充滿寓意，嘗試將它們記錄下來並加以解讀。",
            "雖然這個過程可能會讓你感到不安和恐懼，但這是通往更高智慧和自我整合的必經之路。"
          ]
        },
        "reversed": {
          "summary": "你正在從混亂和恐懼中走出來，內心的迷霧正在散去。",
          "details": [
            "你正在釋放一個長期壓抑的恐懼或創傷，讓自己從過去的陰影中解放出來。",
            "你不再被自己的想像和幻覺所困擾，能夠更清晰、更客觀地看待自己和世界。",
            "這是一個巨大的突破，你正在從潛意識的奴役中解放出來，成為一個更完整、更有力量的人。"
          ]
        }
      }
    }
  },
  {
    "id": "the_sun",
    "name": "太陽",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段充滿陽光、喜悅和純粹快樂的關係。",
          "details": [
            "這是塔羅牌中最積極的愛情牌之一，預示著幸福、成功和滿足。",
            "你們的關係充滿了活力、熱情和真誠，沒有任何陰影和懷疑。",
            "盡情享受這段美好的時光吧！你們的愛如同太陽一樣，溫暖、明亮，並為周圍的人帶來快樂。"
          ]
        },
        "reversed": {
          "summary": "關係中的快樂被暫時遮蔽，或者你對未來過於樂觀。",
          "details": [
            "你們之間可能有一些小的誤會或暫時的困難，導致關係的熱情有所降溫。",
            "你是否因為過於自信而忽略了關係中的一些潛在問題？",
            "這只是暫時的烏雲，只要你們坦誠溝通，太陽很快就會再次出現。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的事業將迎來巨大的成功、認可和清晰的方向。",
          "details": [
            "你的才華和努力將被所有人看見，你可能會獲得晉升、獎勵或一個重要的成功。",
            "你對自己的工作充滿了熱情和自信，並且清楚地知道自己的目標。",
            "這是一個大放異彩的時刻，勇敢地去展現你的能力，享受成功的喜悅吧！"
          ]
        },
        "reversed": {
          "summary": "你可能對自己的能力過於自信，或者專案的成功被延遲了。",
          "details": [
            "雖然你充滿熱情，但可能因為計畫不夠周詳而導致了一些小挫折。",
            "你是否設定了一個過於樂觀、難以實現的目標？是時候進行一次更務實的評估了。",
            "成功可能比你預期的要晚一些到來，但不要灰心，繼續努力，光明就在前方。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你的社交生活充滿了陽光、歡笑和真誠的友誼。",
          "details": [
            "你是朋友們中的小太陽，你的存在總能給大家帶來快樂和正能量。",
            "這是一個非常適合參加派對、聚會和各種社交活動的時期，你會玩得很開心。",
            "你的真誠和熱情會為你吸引來許多新的、志同道合的朋友。"
          ]
        },
        "reversed": {
          "summary": "你可能在社交中感到有些孤獨，或者與朋友之間產生了小小的隔閡。",
          "details": [
            "你是否感到自己無法融入朋友們的快樂氛圍中？",
            "可能是一些小的誤會或溝通不暢，導致了你和朋友之間的距離感。",
            "主動一點，用你的熱情去融化這些小小的冰山。一個真誠的微笑或問候就能解決問題。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身心充滿了前所未有的活力和能量。",
          "details": [
            "這是一張代表著極佳健康狀況的牌，你的身體充滿了生命力。",
            "多去戶外走走，曬曬太陽，進行一些能讓你出汗的運動，會讓你的狀態更好。",
            "你的精神狀態也非常陽光，充滿了積極樂觀的能量。"
          ]
        },
        "reversed": {
          "summary": "你可能感到有些疲憊，或者因為過於樂觀而忽略了一些健康上的小問題。",
          "details": [
            "雖然整體狀況不錯，但你可能因為過度消耗能量而感到有些精力不足。",
            "不要因為感覺良好就忽視了規律的作息和健康的飲食。",
            "即使只是一點點的不適，也值得你去關注。預防總是勝於治療。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "這是你生命中最光明、最充滿喜悅的時刻，你的內在小孩正在歡呼。",
          "details": [
            "你充滿了自信、樂觀和對生命的熱愛，能夠清晰地看到自己的價值和方向。",
            "放下所有的懷疑和恐懼，盡情地去展現你最真實、最閃耀的自我。",
            "你的快樂和成功將會感染和啟發你身邊的人。你就是一道光。"
          ]
        },
        "reversed": {
          "summary": "你暫時無法連結到你內在的喜悅和光芒，感到有些沮喪。",
          "details": [
            "你是否對自己過於苛刻，或者被一些短期的困難蒙蔽了雙眼，忘記了自己有多麼出色？",
            "你可能很難看到事物積極的一面，總是專注於那些不完美的地方。",
            "你需要重新點燃你內心的太陽。去做一些能讓你感到快樂和有成就感的事情，無論它多麼微小。"
          ]
        }
      }
    }
  },
  {
    "id": "judgement",
    "name": "審判",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段關係將迎來審判和重生的時刻，是時候做出最終決定了。",
          "details": [
            "你們需要回顧整段關係，進行一次誠實的評估。這個決定將是最終的，無論是結合還是分離。",
            "這可能代表著一次和解，你們願意原諒彼此過去的錯誤，以全新的姿態重新開始。",
            "如果你是單身，這張牌意味著你需要從過去的感情陰影中徹底解放出來，才能迎接新的愛情。"
          ]
        },
        "reversed": {
          "summary": "你正在逃避一個必要的決定，或者在不斷地進行自我批判。",
          "details": [
            "你可能因為害怕面對後果而遲遲不肯對這段關係做出判斷，導致雙方都處於不確定的痛苦中。",
            "你是否在為過去的錯誤而過度地自責，無法原諒自己？",
            "你需要停止自我懷疑和猶豫不決。傾聽你內心的召喚，做出那個你早就知道該做的決定。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的職業生涯將迎來一個決定性的時刻，你的過去將被評估。",
          "details": [
            "這可能是一次重要的績效評估、升職面試或一個決定你未來走向的機會。",
            "你的所有努力和成就都將被看見，並得到公正的評價。",
            "這也是一個反思你職業道路的時刻，問問自己這是否是你真正想做的事情，並做出相應的調整。"
          ]
        },
        "reversed": {
          "summary": "你可能因為害怕失敗而錯失良機，或者對自己的能力產生了不公正的自我懷疑。",
          "details": [
            "一個重要的機會擺在你面前，但你卻因為過度擔心自己無法勝任而猶豫不決。",
            "你是否因為一次失敗而全盤否定自己過去所有的努力？這種自我批判是不公平的。",
            "你需要更客觀地看待自己。列出你的成就和優點，重拾你的自信。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "一段友誼可能需要一次徹底的清算與和解。",
          "details": [
            "如果你和朋友之間有長期的矛盾，現在是時候把它們都攤開來講清楚了。",
            "這是一個關於『原諒』的時刻，無論是原諒對方，還是請求對方的原諒。",
            "這次深刻的交流將會讓你們的友誼重生，或者讓你們意識到是時候分道揚鑣了。"
          ]
        },
        "reversed": {
          "summary": "你可能在背後說朋友的閒話，或者因為不願溝通而讓誤會加深。",
          "details": [
            "你是否在對朋友的行為進行不公正的評判，而沒有去了解他背後的原因？",
            "你可能因為害怕衝突而選擇了沉默，但這只會讓問題像雪球一樣越滾越大。",
            "你需要停止在背後抱怨，鼓起勇氣進行一次面對面的、誠實的對話。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康狀況將迎來一個決定性的轉折點。",
          "details": [
            "這是一個『覺醒』的時刻，你終於意識到你需要為自己的健康負起責任，並開始採取行動。",
            "一個長期的健康問題可能會得到明確的診斷，讓你能夠對症下藥。",
            "你的康復需要一次徹底的生活方式的改變，告別過去，迎接新生。"
          ]
        },
        "reversed": {
          "summary": "你可能在忽視一個嚴重的健康問題，或者對自己的康復能力產生了懷疑。",
          "details": [
            "你是否在不斷地自我診斷，卻不願意去聽取專業醫生的意見？",
            "你可能因為一次治療的失敗而對整個醫療體系失去了信心。",
            "你需要克服你的自我懷疑。你的身體擁有強大的自癒能力，但你需要給它一個機會，並配合專業的治療。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你聽到了來自靈魂深處的召喚，一個重大的覺醒和轉變即將發生。",
          "details": [
            "這是你人生的『算總帳』時刻。你需要回顧你的一生，整合所有的經驗，無論好壞。",
            "你將會對你的人生有一個全新的、更高層次的理解，並找到你真正的使命。",
            "不要害怕這個召喚。這是你靈魂的進化，是你重生為一個更完整、更覺醒的存在的機會。"
          ]
        },
        "reversed": {
          "summary": "你在刻意忽略你內心的聲音，或者被過度的自我批判所困擾。",
          "details": [
            "你的直覺和你的靈魂在不斷地給你發送信號，但你卻用各種藉口來忽視它們。",
            "你是否陷入了對過去錯誤的無盡悔恨中，無法前行？學會原諒自己是覺醒的第一步。",
            "你需要安靜下來，傾聽內心的聲音。你不能再假裝聽不見那個召喚你走向更高自我的聲音了。"
          ]
        }
      }
    }
  },
  {
    "id": "the_world",
    "name": "世界",
    "type": "major",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段關係達到了圓滿和成功的頂點，你們共同完成了一個重要的生命週期。",
          "details": [
            "你們的愛情開花結果，達到了一個非常和諧、完整和滿足的狀態。",
            "這張牌代表著一個成功週期的完成，例如長跑多年的愛情終於步入婚姻，或共同完成了某個重大家庭目標。",
            "盡情享受這份圓滿的喜悅吧，這是你們共同努力的結果。"
          ]
        },
        "reversed": {
          "summary": "你感到關係中缺少了什麼，或者一個重要的目標遲遲無法完成。",
          "details": [
            "你們的關係可能看起來很完美，但你內心深處卻感到一絲空虛和不滿足。",
            "你們可能離一個重要的里程碑（如結婚、生子）只有一步之遙，但卻因為某些原因而卡住了。",
            "你需要找出那個讓你感到『不完整』的原因。有時候，你需要先完成一些個人的課題，才能迎來關係的圓滿。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的事業達到了一個成功的頂峰，一個重要的專案或職業生涯階段圓滿完成。",
          "details": [
            "你終於達成了你長久以來為之奮鬥的目標，享受這份成就感和滿足感吧。",
            "這是一個慶祝成功、收穫果實的時刻。你的努力得到了全世界的認可。",
            "這張牌也常常與國際旅行、海外工作或與世界接軌的事業有關。"
          ]
        },
        "reversed": {
          "summary": "你離成功只有一步之遙，但卻因為某些原因而無法完成最後的衝刺。",
          "details": [
            "你是否在專案的最後階段感到了鬆懈，或者忽略了一些關鍵的細節？",
            "不要走捷徑。你需要有始有終，將最後的工作完成，才能真正地享受成功的果實。",
            "你可能需要回頭去彌補一些之前遺漏的環節，才能讓整個專案圓滿結束。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你擁有一個和諧、完整的社交圈，感到四海一家。",
          "details": [
            "你與你的朋友們共同完成了一個重要的目標，正在一起慶祝你們的成就。",
            "你感到自己是世界的一部分，與來自不同文化、不同背景的人都能和諧相處。",
            "這是一個非常適合旅行的時期，你將會在旅途中感受到世界的美好和人與人之間的連結。"
          ]
        },
        "reversed": {
          "summary": "你可能感到與你的社交圈格格不入，或者一個重要的團體目標未能達成。",
          "details": [
            "你可能感到自己無法融入某個圈子，或者與朋友們的關係變得停滯不前。",
            "一個你們共同期待的旅行或聚會可能因為某些原因而被取消或延期。",
            "你需要找到讓你感到不完整的原因。是時候去建立一個能讓你真正有歸屬感的社交網絡了。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身心靈達到了前所未有的完整與和諧。",
          "details": [
            "這是一張代表著整體健康的牌。你的身體、心理和精神都處於一個完美的平衡狀態。",
            "一個長期的健康問題終於得到了徹底的解決，你感到重獲新生。",
            "繼續保持你健康的生活方式，享受這份完整的生命力吧。"
          ]
        },
        "reversed": {
          "summary": "你感到自己的健康計畫缺少了關鍵的一環，導致效果不彰。",
          "details": [
            "你可能非常注重飲食和運動，但卻忽略了心理健康，反之亦然。",
            "你需要一個更全面的健康計畫，將身體、心理和精神都考慮進去。",
            "不要因為離目標還差一步就放棄。找出那個缺失的環節，補上它，你就能達到健康的圓滿狀態。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你已經完成了一個重要的人生課題，達到了一個完整、圓滿的境界。",
          "details": [
            "這是你靈魂旅程的一個重要里程碑。你整合了所有的經驗，成為了一個更完整、更智慧的人。",
            "你感到與整個世界都合而為一，充滿了平靜、喜悅和滿足。",
            "享受這個時刻，慶祝你的旅程。然後，準備好迎接下一個全新的、從『愚者』開始的循環。"
          ]
        },
        "reversed": {
          "summary": "你感到自己的人生缺少了什麼，無法達到真正的圓滿。",
          "details": [
            "你可能已經取得了許多外在的成就，但內心深處卻依然感到空虛。",
            "你是否在逃避某個你必須完成的人生課題？在你完成它之前，你將無法進入下一個階段。",
            "你需要去尋找那個讓你感到不完整的『拼圖』。它可能是一個未竟的夢想、一段需要和解的關係，或是一個需要被療癒的創傷。"
          ]
        }
      }
    }
  },
  {
    "id": "ace_of_wands",
    "name": "權杖一",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段充滿激情和活力的戀情正要展開，或者現有關係中注入了新的火花。",
          "details": [
              "你是否感覺到一股新的吸引力或衝動？這是一個採取主動、表達你熱情的絕佳時機。",
              "對於單身者，這張牌預示著一個讓你心動不已的新對象即將出現。",
              "在現有關係中，這代表著重燃愛火、共同開展新冒險的機會。"
            ]
        },
        "reversed": {
          "summary": "熱情正在消退，或是開始時的激情難以持續，感到猶豫不決或缺乏動力。",
          "details": [
              "你是否對這段關係感到厭倦或提不起勁？",
              "這可能是一個錯誤的開始，或是時機不對，導致關係停滯不前。",
              "小心不要因為一時的衝動而做出承諾，你可能還沒有準備好迎接一段新關係。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "一個充滿潛力的新項目、新工作或創業機會出現，你的創造力處於巔峰。",
          "details": [
              "你腦中是否湧現出一個絕佳的點子？現在就去執行它！這是開創事業、接受新挑戰的完美時機。",
              "你的熱情和能量將會感染同事和上司，為你帶來新的機遇。",
              "如果你一直在考慮換工作或創業，權杖一鼓勵你勇敢地邁出第一步。"
            ]
        },
        "reversed": {
          "summary": "項目延遲、缺乏靈感或動力，感覺事情無法順利啟動，方向不明。",
          "details": [
              "你是否感到創意枯竭或對工作失去熱情？",
              "計劃可能被擱置，或者你對自己的職業方向感到迷茫。",
              "建議重新評估你的目標，找到那最初點燃你熱情的火花，而不是盲目地開始。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你充滿活力，準備結交新朋友，或在社交圈中發起新的活動。",
          "details": [
              "這是一個擴大社交圈、參加新活動的好時機。",
              "你的熱情和積極性會吸引很多人，讓你成為團體中的焦點。",
              "可能會認識一位能激發你靈感的新朋友。"
            ]
        },
        "reversed": {
          "summary": "在社交上感到尷尬或缺乏熱情，對結識新朋友或參加活動感到厭倦。",
          "details": [
              "你可能覺得自己與周圍的人格格不入，或者不想進行無意義的社交。",
              "一個潛在的新友誼可能因為你的猶豫而未能發展。",
              "給自己一些獨處的時間是好的，但不要完全封閉自己。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "充滿活力和生命力，是開始新的健身計劃或改善生活習慣的絕佳時機。",
          "details": [
              "你的身體充滿了能量，非常適合開始運動、戒掉壞習慣。",
              "如果你正在康復中，這張牌預示著快速且充滿活力的恢復過程。",
              "傾聽你身體的聲音，它正渴望著行動和挑戰。"
            ]
        },
        "reversed": {
          "summary": "感到疲勞、精力不足或倦怠，新的健康計劃可能難以堅持。",
          "details": [
              "你是否感到身心俱疲，對任何事都提不起勁？",
              "注意不要因為過度消耗而透支你的體力，你需要休息和充電。",
              "一個不切實際的健康目標可能會讓你很快就放棄，試著從小的改變開始。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "一個靈感的火花被點燃，你發現了新的熱情或人生目標，充滿了探索的渴望。",
          "details": [
              "你可能會突然對某個新領域產生強烈的好奇心，這是一個追隨直覺的信號。",
              "這是學習新技能、開啟新旅程、探索未知自我的絕佳機會。",
              "不要壓抑你的創造衝動，讓內心的火焰指引你前行。"
            ]
        },
        "reversed": {
          "summary": "感到迷失方向，缺乏靈感，不知道自己熱情的火花在哪裡。",
          "details": [
              "你可能感到內心空虛，對生活失去了方向感和目標。",
              "一個曾經讓你充滿熱情的想法，現在可能看起來毫無吸引力。",
              "不要強迫自己，試著透過冥想、旅行或接觸大自然，重新找回與內在自我的連結。"
            ]
        }
      }
    }
 },
  {
    "id": "two_of_wands",
    "name": "權杖二",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你和伴侶正在共同規劃未來，或者在一段關係中做出重要的長遠決定。",
          "details": [
              "這是一個討論未來、設定共同目標的好時機，例如同居、結婚或一起旅行。",
              "對於單身者，你可能正在評估不同的潛在對象，思考哪一個更符合你對未來的期望。",
              "你可能需要做出一個選擇：是維持現狀，還是將關係推進到下一個階段？"
            ]
        },
        "reversed": {
          "summary": "對關係的未來感到恐懼或不確定，害怕做出承諾，或者雙方目標不一致。",
          "details": [
              "你是否害怕離開目前的舒適圈，即使這段關係已經不再適合你？",
              "你和伴侶對於未來的規劃可能存在分歧，導致關係停滯不前。",
              "過於狹隘的視野讓你看不清關係中的其他可能性。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你正處於一個規劃階段，評估職業生涯的下一步，準備做出重大決策。",
          "details": [
              "你已經取得了一些成就，現在是時候放眼未來，規劃更長遠的目標了。",
              "這可能涉及到海外工作、跨部門合作或一個需要你走出舒適圈的新項目。",
              "你的遠見和規劃能力將是你成功的關鍵。相信你的直覺，大膽規劃。"
            ]
        },
        "reversed": {
          "summary": "計劃不周、缺乏遠見，或者害怕冒險，導致錯失良機。",
          "details": [
              "你是否因為害怕失敗而不敢嘗試新的機會？",
              "一個意想不到的挑戰打亂了你原有的計劃，讓你感到措手不及。",
              "過於安於現狀可能會讓你錯過事業發展的黃金時期。你需要更大膽的視野。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你正在考慮將一段友誼發展成更深的關係，或者在現有的人際關係中尋求新的可能性。",
          "details": [
              "你可能會在兩個朋友或兩個社交圈之間做出選擇。",
              "這是一個與朋友共同規劃未來、比如一起創業或旅行的好時機。",
              "你的人際關係網絡正在擴大，為你帶來新的視角和機會。"
            ]
        },
        "reversed": {
          "summary": "在人際關係中感到孤立，或者因為害怕改變而不敢結識新朋友。",
          "details": [
              "你可能覺得自己被困在一個小圈子裡，渴望與外界有更多的連結。",
              "與朋友之間的規劃可能出現分歧，導致合作關係破裂。",
              "你需要更主動地去探索新的人際關係，而不是被動地等待。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你正在為自己的健康做出長遠的規劃，而不僅僅是短期的改變。",
          "details": [
              "這是一個評估你整體生活方式並制定長期健康目標的好時機。",
              "你可能會在不同的治療方案或健身計劃之間做出選擇。",
              "你的決定將對你未來的健康產生深遠的影響，請謹慎規劃。"
            ]
        },
        "reversed": {
          "summary": "對健康問題視而不見，或者因為缺乏計劃而導致健康狀況停滯不前。",
          "details": [
              "你是否在逃避一個需要你做出決定的健康問題？",
              "缺乏長遠的健康規劃，可能讓你的努力都只是曇花一現。",
              "你需要停止猶豫，為自己的健康負起責任，並制定一個可行的計劃。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你站在人生的十字路口，意識到自己擁有多種可能性，並準備做出選擇。",
          "details": [
              "世界在你的腳下，你擁有選擇自己未來道路的力量。",
              "這是一個探索新哲學、新信仰或新世界觀的時刻，你的視野正在被打開。",
              "不要害怕未知。你踏出的第一步，將決定你未來能走多遠。"
            ]
        },
        "reversed": {
          "summary": "害怕離開自己的舒適區，對未來感到迷茫，缺乏探索新事物的勇氣。",
          "details": [
              "你是否感覺自己被困住了，看不清未來的方向？",
              "你可能擁有無限的潛力，但你內心的恐懼限制了你的發展。",
              "你需要勇敢地去面對你內心的不安全感，並相信自己有能力去創造一個不同的未來。"
            ]
        }
      }
    }
},
  {
    "id": "three_of_wands",
    "name": "權杖三",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你們的關係正在進入一個新的、更廣闊的階段，共同的努力開始看到回報。",
          "details": [
              "這可能是一段異地戀的開始，雖然充滿挑戰，但也預示著未來的發展空間。",
              "你和伴侶的共同計劃（如旅行、搬家）正在順利進行，你們對未來充滿期待。",
              "對於單身者，你的眼光可能放得更遠，願意接受來自不同文化背景或遠方的新戀情。"
            ]
        },
        "reversed": {
          "summary": "關係的發展受阻，共同的未來計劃出現延誤或意外，感到失望。",
          "details": [
              "異地戀可能帶來了超出預期的困難，讓你們的關係停滯不前。",
              "你或你的伴侶可能還沒有準備好進入關係的下一個階段，導致計劃被擱置。",
              "對未來的過度幻想破滅了，你需要更務實地看待你們的關係。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的初步計劃已成功啟動，現在是擴展業務、放眼全球市場的時候。",
          "details": [
              "你的努力開始顯現成果，這給了你更大的信心去追求更宏大的目標。",
              "這張牌強烈暗示著國際貿易、海外擴張或與外國公司的合作機會。",
              "保持耐心，你的船隊正在回航的路上，豐碩的成果即將到來。"
            ]
        },
        "reversed": {
          "summary": "計劃延誤、海外擴張失敗或遇到意外阻礙，讓你感到挫敗和失望。",
          "details": [
              "你可能過於急躁，在還沒打好基礎時就急於擴張，導致了失敗。",
              "國際合作或海外項目可能遇到了文化差異、溝通不暢等問題。",
              "你需要重新評估你的計劃，找出問題所在，而不是盲目地等待一個不會到來的結果。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你的人際關係網絡正在擴大，特別是與來自不同背景或地區的人。",
          "details": [
              "你可能會透過網路、旅行或學習結識來自世界各地的朋友。",
              "與朋友的合作項目進展順利，你們的共同努力即將開花結果。",
              "你的視野變得更開闊，更能理解和包容不同的觀點。"
            ]
        },
        "reversed": {
          "summary": "在人際交往中感到受限，與朋友的合作計劃停滯不前。",
          "details": [
              "你可能覺得自己的社交圈太小，渴望與外界有更多的連結，但又缺乏行動。",
              "與朋友的合作可能因為溝通問題或目標不一致而陷入僵局。",
              "不要把自己限制在一個小圈子裡，世界很大，有很多有趣的人等著你去認識。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康計劃進展順利，你正朝著長期的健康目標穩步前進。",
          "details": [
              "你為健康付出的努力開始看到成效，這讓你更有動力堅持下去。",
              "這可能也代表著你在尋求海外的醫療資源或不同的治療方法。",
              "保持耐心，健康的改善是一個長期的過程，你正走在正確的道路上。"
            ]
        },
        "reversed": {
          "summary": "健康改善計劃遇到瓶頸或延誤，讓你感到沮喪。",
          "details": [
              "你可能因為看不到立竿見影的效果而感到氣餒，甚至想放棄。",
              "一個意想不到的健康問題打亂了你的康復計劃。",
              "你需要重新評估你的健康策略，或者尋求第二意見，不要因為暫時的挫折而放棄。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你的視野正在無限擴大，你開始意識到自己是世界的一部分，充滿了探索的雄心。",
          "details": [
              "你不再滿足於眼前的世界，而是渴望去探索更廣闊的未知領域。",
              "旅行、學習外語或接觸異國文化將會極大地豐富你的內在世界。",
              "你為自己設定的個人成長目標正在逐步實現，這讓你對未來充滿信心。"
            ]
        },
        "reversed": {
          "summary": "自我設限，害怕踏出舒適區，導致個人成長停滯。",
          "details": [
              "你是否因為害怕未知而拒絕了成長的機會？",
              "你可能有很多夢想，但它們只停留在想像階段，從未付諸實踐。",
              "你需要打破自己內心的壁壘，勇敢地去擁抱一個更廣闊的世界和一個更完整的自己。"
            ]
        }
      }
    }
  },
  {
    "id": "four_of_wands",
    "name": "權杖四",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "關係進入穩定、和諧的階段，是慶祝訂婚、結婚或紀念日的絕佳時機。",
          "details": [
              "你們的關係建立在一個非常穩固的基礎上，充滿了安全感和幸福感。",
              "這張牌強烈預示著家庭的團聚、婚禮的慶典或一個值得紀念的里程碑。",
              "享受這段和諧美好的時光，這是你們共同努力的結果。"
            ]
        },
        "reversed": {
          "summary": "關係或家庭內部出現不和諧，穩定性受到動搖，慶祝活動可能被延遲或取消。",
          "details": [
              "你是否感覺和伴侶或家人之間缺乏溝通，導致關係緊張？",
              "一個本應值得慶祝的事件，現在卻讓你感到壓力重重。",
              "你們的基礎可能不如想像中穩固，需要重新審視並解決潛在的問題。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "一個重要的項目成功完成，團隊合作愉快，是時候慶祝成果了。",
          "details": [
              "你在工作上達成了一個重要的里程碑，你的努力得到了認可。",
              "團隊氣氛和諧，合作無間，共同創造了出色的成績。",
              "這是一個享受成功、與同事一起慶祝的時刻。工作與生活的平衡達到了完美的狀態。"
            ]
        },
        "reversed": {
          "summary": "項目成果不如預期，團隊內部出現矛盾，缺乏歸屬感和成就感。",
          "details": [
              "你可能覺得自己的貢獻沒有得到應有的重視，或者與團隊格格不入。",
              "一個重要的項目可能因為內部不和而停滯不前。",
              "工作場所的緊張氣氛讓你感到疲憊，你需要找到問題的根源，重建和諧的工作環境。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "與朋友和家人關係和諧，享受團聚的快樂時光，社區歸屬感強烈。",
          "details": [
              "這是一張代表家庭聚會、朋友婚禮或任何形式的集體慶祝活動的牌。",
              "你感覺自己被一個溫暖、支持你的社群所包圍。",
              "與你所愛的人們一起分享你的喜悅吧，這會讓快樂加倍。"
            ]
        },
        "reversed": {
          "summary": "與家人或朋友的關係緊張，感到被孤立，無法融入集體。",
          "details": [
              "你可能因為某些分歧而與家人或朋友產生了隔閡。",
              "一個本應快樂的聚會，卻讓你感到尷尬或不自在。",
              "你需要主動去修復這些關係，或者找到一個真正讓你感到有歸屬感的社群。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "身體狀況穩定，達成了階段性的健康目標，值得為此慶祝。",
          "details": [
              "你的身體處於一個平衡且和諧的狀態。",
              "如果你之前有健康問題，這張牌預示著一個穩定的恢復期，病情得到了很好的控制。",
              "為你為了健康所付出的努力而慶祝吧，這是你應得的。"
            ]
        },
        "reversed": {
          "summary": "健康狀況不穩定，或者因為家庭壓力而影響了身心健康。",
          "details": [
              "你可能因為家庭或人際關係的緊張而感到壓力山大，進而影響了你的健康。",
              "一個潛在的健康問題可能破壞了你原本穩定的生活。",
              "你需要關注家庭和諧與個人健康的連結，解決根源問題才能真正恢復平衡。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你達成了個人成長的一個重要里程碑，內心感到和諧、平靜與滿足。",
          "details": [
              "你為自己建立了一個穩固的內在基礎，讓你感到安全和自信。",
              "這是反思和慶祝你個人成長旅程的時刻，你已經走了很遠。",
              "享受這份來之不易的內心平靜，並與你所愛的人分享你的喜悅。"
            ]
        },
        "reversed": {
          "summary": "內心感到不和諧，缺乏歸屬感，對自己的成就感到不滿。",
          "details": [
              "你可能達成了外界眼中的成功，但內心卻感到空虛和不穩定。",
              "你與自己的內在價值觀產生了衝突，讓你感到迷失。",
              "你需要重新連結你的內心之家，找到那個讓你感到真正安穩和滿足的地方。"
            ]
        }
      }
    }
  },
  {
    "id": "five_of_wands",
    "name": "權杖五",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "關係中充滿了爭吵和衝突，但這些往往是為了磨合而產生的，不一定是負面的。",
          "details": [
              "你和伴侶可能因為觀點不同而頻繁爭執，這是一個需要學習如何有效溝通的時期。",
              "對於單身者，你可能會發現自己有多個競爭者，或者在追求某人時遇到阻礙。",
              "這些衝突也可能代表著一種充滿活力的激情，只要處理得當，就能增進彼此的了解。"
            ]
        },
        "reversed": {
          "summary": "你正在逃避必要的衝突，或者激烈的爭吵正在演變成惡性攻擊，關係瀕臨破裂。",
          "details": [
              "你是否為了維持表面的和平而壓抑自己的真實想法？這種逃避只會讓問題惡化。",
              "爭吵已經失去了原有的目的，變成了純粹的情緒發洩和互相傷害。",
              "你需要找到解決衝突的根本方法，或者考慮這段關係是否還有繼續的必要。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "工作環境中充滿了競爭、挑戰和不同的意見，這是一個混亂但充滿活力的時期。",
          "details": [
              "你的團隊可能正在進行一場激烈的頭腦風暴，各種想法在碰撞中產生新的火花。",
              "這是一個充滿競爭的環境，你需要努力證明自己的能力才能脫穎而出。",
              "不要害怕衝突，健康的辯論有助於找到最佳方案，推動項目進展。"
            ]
        },
        "reversed": {
          "summary": "惡性競爭、辦公室政治或無法解決的衝突，導致工作環境充滿敵意，效率低下。",
          "details": [
              "團隊合作已經變質為互相扯後腿，所有人都想避免衝突，導致問題無法解決。",
              "你可能厭倦了無休止的鬥爭，感到筋疲力盡，甚至想要逃離這個環境。",
              "你需要找到化解衝突的方法，或者尋求外部的調解，否則情況只會越來越糟。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "朋友圈中存在良性競爭或激烈的辯論，大家都在努力表達自己的觀點。",
          "details": [
              "你和朋友們可能正在進行一場友好的比賽或辯論，氣氛雖然緊張但充滿樂趣。",
              "這是一個充滿活力的社交時期，你會遇到各種不同觀點的人。",
              "學會在衝突中保持尊重，這是增進友誼和互相理解的機會。"
            ]
        },
        "reversed": {
          "summary": "友誼因無法解決的衝突而破裂，或者你因為害怕爭吵而避免社交。",
          "details": [
              "一個小小的誤會可能演變成了嚴重的爭執，導致朋友之間產生了裂痕。",
              "你可能覺得與人交往太累，因為總是需要處理各種不同的意見和衝突。",
              "你需要學會設定界線，並決定哪些爭論是值得參與的，哪些則應該放手。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身體可能正在經歷一場內部鬥爭，例如免疫系統正在對抗病毒。",
          "details": [
              "這張牌可以代表身體為了恢復平衡而進行的內部調整，例如發燒或發炎。",
              "這也可能是一段充滿挑戰的健身時期，你需要與自己的惰性作鬥爭。",
              "將這股鬥爭的能量轉化為積極的動力，去戰勝你的健康挑戰。"
            ]
        },
        "reversed": {
          "summary": "你正在忽視身體發出的警訊，或者內心的壓力正在拖垮你的健康。",
          "details": [
              "長期的壓力和內心衝突正在對你的身體造成傷害。",
              "你可能因為害怕面對而忽視了某些症狀，導致問題惡化。",
              "你需要找到釋放壓力的出口，並正視你的健康問題，尋求內外的和諧。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你的內心充滿了矛盾和衝突的想法，這是一個自我整合的過程。",
          "details": [
              "你不同的價值觀、慾望和信念正在相互碰撞，迫使你去思考什麼對你才是最重要的。",
              "不要害怕這種內心的混亂，這是你成長的必經之路。透過辯證，你會找到更高的真理。",
              "擁抱你內心的多樣性，讓不同的聲音對話，最終你會形成一個更完整、更堅定的自我。"
            ]
        },
        "reversed": {
          "summary": "你被內心的衝突所淹沒，感到焦慮和迷茫，無法做出決定。",
          "details": [
              "你正在極力逃避內心的矛盾，但這種壓抑讓你感到更加痛苦和無力。",
              "你可能因為害怕做出錯誤的選擇而陷入癱瘓狀態，什麼都不敢做。",
              "你需要尋求一個安靜的空間，去傾聽你內心的聲音，並逐一梳理它們。有時候，接受衝突的存在本身就是一種解決方案。"
            ]
        }
      }
    }
  },
  {
    "id": "six_of_wands",
    "name": "權杖六",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你在愛情中取得了勝利，關係公開並得到周圍人的祝福。",
          "details": [
              "如果你一直在追求某人，這張牌預示著你將成功贏得對方的心。",
              "你和伴侶的關係非常穩固，你們是他人眼中的模範情侶，並為此感到自豪。",
              "這是一個將你的伴侶介紹給家人和朋友，並接受大家祝福的好時機。"
            ]
        },
        "reversed": {
          "summary": "關係中缺乏認同感，或者成功追求後發現對方並非如你所想，感到失落。",
          "details": [
              "你可能覺得自己的付出沒有得到伴侶的認可，或者你們的關係不被外界看好。",
              "一段看似成功的戀情，背後可能隱藏著虛榮或不為人知的問題。",
              "你可能贏得了愛情，卻輸掉了自己。小心不要在關係中迷失自我。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你在工作上取得了重大成功，獲得了晉升、獎勵或公開表揚。",
          "details": [
              "你的努力和才華得到了同事和上司的高度認可，你正處於事業的聚光燈下。",
              "一個重要的項目取得了圓滿成功，你作為關鍵人物功不可沒。",
              "享受你的勝利吧！這是你應得的榮耀，你的自信心也因此大增。"
            ]
        },
        "reversed": {
          "summary": "成功曇花一現，或者你的成就被他人竊取，感到不公和挫敗。",
          "details": [
              "你可能取得了一些成就，但沒有得到應有的認可，甚至功勞被別人搶走。",
              "過度的驕傲自滿可能導致你從成功的頂點跌落。",
              "你可能對自己的能力產生了懷疑，或者害怕無法再次複製這次的成功。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你在社交圈中備受歡迎，你的成就得到了朋友們的真心祝賀。",
          "details": [
              "你可能在某個社群或團體中扮演著領導者的角色，並深受大家的愛戴。",
              "你的朋友為你的成功感到驕傲，並樂於與你一起慶祝。",
              "這是一個充滿正面能量的時期，你的自信和魅力吸引了很多人。"
            ]
        },
        "reversed": {
          "summary": "在社交中感到被排擠，或者朋友對你的成功感到嫉妒。",
          "details": [
              "你可能覺得自己不被朋友或社群所接納，缺乏歸屬感。",
              "你的成功可能招來了嫉妒和流言蜚語，讓你感到孤立。",
              "小心那些表面上為你喝彩，背後卻另有目的的「朋友」。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你成功戰勝了疾病，或者在健身、減重等方面取得了顯著的成果。",
          "details": [
              "你的健康狀況良好，充滿了自信和活力。",
              "一個長期的健康計劃終於看到了回報，你的毅力得到了最好的證明。",
              "將你的成功經驗分享給他人，這會給你帶來更大的成就感。"
            ]
        },
        "reversed": {
          "summary": "健康問題復發，或者減重成功後又反彈，讓你感到氣餒。",
          "details": [
              "一個看似已經解決的健康問題可能再次出現，讓你感到沮喪。",
              "你可能因為短期的成功而鬆懈了，導致之前的努力付諸東流。",
              "你需要建立長期的健康策略和毅力，而不僅僅是追求短暫的勝利。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你對自己充滿信心，你的內在價值得到了外界的認可，自我感覺良好。",
          "details": [
              "你清楚地認識到自己的優點和價值，並為此感到自豪。",
              "你內在的信念和外在的行為達成了和諧統一，讓你充滿力量。",
              "這是一個享受自我實現所帶來喜悅的時刻。你就是自己人生的英雄。"
            ]
        },
        "reversed": {
          "summary": "缺乏自信，懷疑自己的價值，或者過度依賴外界的認可。",
          "details": [
              "你可能取得了很多成就，但內心深處仍然感到不安全和自我懷疑。",
              "你是否將自己的價值完全建立在他人的評價之上？",
              "你需要學會從內在肯定自己，而不是永遠在追逐外界的掌聲。真正的勝利來源於內心的平靜與自信。"
            ]
        }
      }
    }
  },
  {
    "id": "seven_of_wands",
    "name": "權杖七",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你需要為你的關係或愛情觀而戰，捍衛你們的感情不受外界干擾。",
          "details": [
              "你們的關係可能正受到家人、朋友或社會輿論的反對，你需要堅定地站出來保護它。",
              "在關係內部，你可能需要為自己的立場和需求進行辯護，以求得平等的對待。",
              "對於單身者，這代表你需要勇敢地表達自己的擇偶標準，不向壓力妥協。"
            ]
        },
        "reversed": {
          "summary": "在壓力下感到不堪重負，放棄了捍衛自己的立場，或者在關係中感到無力。",
          "details": [
              "你可能因為外界的壓力而對這段感情產生了動搖，甚至想要放棄。",
              "在爭吵中，你感到孤立無援，完全處於下風，失去了溝通的勇氣。",
              "你對自己的魅力或在關係中的價值產生了懷疑。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你需要捍衛自己的工作成果、職位或創新的想法，勇敢面對挑戰和質疑。",
          "details": [
              "你的項目或想法可能正受到同事或競爭對手的挑戰，你需要用事實和數據來為自己辯護。",
              "這是一個需要你堅持不懈、保護自己勞動成果的關鍵時刻。",
              "即使感到孤軍奮戰，也要相信你的立場是正確的，你的勇氣將為你贏得最終的尊重。"
            ]
        },
        "reversed": {
          "summary": "在競爭中感到力不從心，壓力過大，或者因為害怕衝突而放棄了自己的立場。",
          "details": [
              "你可能被排山倒海的批評和質疑所淹沒，感到無力反擊。",
              "因為害怕得罪人，你選擇了妥協，但這讓你感到屈辱和不甘。",
              "你可能需要承認自己的計劃確實存在漏洞，或者尋求盟友的支持，而不是一個人硬撐。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你需要為你的朋友或你的原則而辯護，即使這會讓你與其他人產生對立。",
          "details": [
              "當你的朋友受到不公正的對待時，你勇敢地站出來為他/她說話。",
              "你正在為一個你所信仰的社會議題或原則而奮鬥，即使你是少數派。",
              "這種堅持會讓你贏得真正的朋友，並篩選掉那些價值觀不合的人。"
            ]
        },
        "reversed": {
          "summary": "因為害怕被孤立而不敢表達自己的真實想法，或者在朋友間的爭執中選擇逃避。",
          "details": [
              "你可能為了融入集體而放棄了自己的原則，隨波逐流。",
              "在朋友需要你的時候，你因為害怕惹上麻煩而選擇了沉默。",
              "這種妥協可能會讓你暫時安全，但長遠來看，你會失去他人的尊重和對自己的認同。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你正在積極地與疾病作鬥爭，用堅強的意志力捍衛自己的健康。",
          "details": [
              "面對健康挑戰，你展現出了驚人的勇氣和毅力。",
              "你需要為自己選擇的治療方案進行辯護，不被外界的雜音所干擾。",
              "你的精神力量是你戰勝疾病的最強大武器。"
            ]
        },
        "reversed": {
          "summary": "感到無力對抗疾病，被各種相互矛盾的醫療建議所困擾，精神壓力巨大。",
          "details": [
              "你可能覺得自己的努力都是徒勞的，對康復失去了信心。",
              "太多的資訊和建議讓你不知所措，無法做出決定。",
              "你需要找到一個你信任的醫療權威，並專注於一個治療方案，而不是在猶豫和焦慮中消耗自己。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在為自己的獨特性和個人信念而戰，堅定地走在自己的道路上。",
          "details": [
              "即使全世界都不理解你，你也有勇氣堅持做自己。",
              "這是一個挑戰傳統、質疑權威、建立自己獨立價值體系的過程。",
              "你的與眾不同正是你最大的力量。不要害怕因此而來的挑戰。"
            ]
        },
        "reversed": {
          "summary": "在外界的壓力下放棄了自我，感到自我懷疑，失去了獨特性。",
          "details": [
              "你是否為了迎合他人而磨平了自己的棱角，變得面目模糊？",
              "你對自己的信念產生了動搖，開始懷疑自己是否從一開始就錯了。",
              "你需要重新找回自己的聲音和立場。記住，你的價值不需要由任何人來定義。"
            ]
        }
      }
    }
  },
  {
    "id": "eight_of_wands",
    "name": "權杖八",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "愛情發展迅速，可能是一見鍾情或關係在短時間內急速升溫。",
          "details": [
              "你可能會收到一封充滿愛意的訊息，或者一個讓你心跳加速的告白。",
              "這是一段充滿激情和活力的時期，你們的關係進展一日千里。",
              "對於單身者，愛情可能會在你最意想不到的時候，以最快的速度降臨。"
            ]
        },
        "reversed": {
          "summary": "關係進展停滯，溝通不暢，或者因為過於倉促而導致誤解和爭吵。",
          "details": [
              "你是否在焦急地等待對方的回覆，卻杳無音信？",
              "你們的關係可能因為發展太快而基礎不穩，現在激情退去，問題開始浮現。",
              "嫉妒或倉促的決定可能會給這段關係帶來不必要的麻煩。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "項目進展神速，商業機會接踵而至，或者有緊急的出差任務。",
          "details": [
              "之前停滯不前的項目現在突然掃清了所有障礙，正在全速前進。",
              "你可能會收到一個重要的工作消息或一個不容錯過的機會，需要你快速做出反應。",
              "這張牌也常常與航空旅行有關，可能預示著一次重要的商務旅行。"
            ]
        },
        "reversed": {
          "summary": "項目延誤，計劃受阻，或者因為倉促決策而導致混亂和失敗。",
          "details": [
              "一個看似很好的機會可能因為準備不足而錯失，或者項目因意外而停擺。",
              "你是否感到事情的進展非常緩慢，處處受阻？",
              "在做出重要決定前請三思，過於草率的行動可能會帶來反效果。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "社交活動頻繁，你會收到很多邀請，人際關係充滿活力。",
          "details": [
              "你可能會在短時間內認識很多新朋友，或者與老朋友的聯繫突然變得頻繁。",
              "這是一個充滿快速、有趣對話的時期，資訊在朋友間迅速流動。",
              "可能會有一場說走就走的旅行，增進你和朋友們的感情。"
            ]
        },
        "reversed": {
          "summary": "與朋友產生誤解，溝通不暢，或者社交活動被取消或延遲。",
          "details": [
              "你發出的訊息可能石沉大海，或者在群組對話中感到被忽視。",
              "朋友間的爭吵可能因為失言或衝動的言論而起。",
              "你可能需要放慢腳步，給彼此一些空間，而不是強求立即的互動。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "健康狀況迅速好轉，或者一個新的、高效的治療方案帶來了立竿見影的效果。",
          "details": [
              "你的身體充滿了能量，恢復速度很快。",
              "這是一個採取快速、果斷行動來改善健康的好時機，例如開始一項高強度間歇訓練(HIIT)。",
              "你可能會很快收到一份重要的體檢報告或診斷結果。"
            ]
        },
        "reversed": {
          "summary": "健康恢復緩慢，或者因為過於急躁而導致運動傷害。",
          "details": [
              "你可能對緩慢的康復過程感到不耐煩，但欲速則不達。",
              "一個突然出現的健康問題打亂了你的生活節奏。",
              "在進行任何劇烈運動前，請務必做好熱身，避免因為倉促而受傷。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你的思緒飛速運轉，靈感迸發，個人成長進入一個快速發展的階段。",
          "details": [
              "你可能會在短時間內吸收大量新知識，或者突然對某個問題豁然開朗。",
              "這是一個「頓悟」的時刻，你的意識水平正在快速提升。",
              "跟隨你的靈感，它會像飛行的權杖一樣，帶你迅速到達目的地。"
            ]
        },
        "reversed": {
          "summary": "思緒混亂，無法集中精力，或者因為接收太多資訊而感到不知所措。",
          "details": [
              "你是否感到自己的想法太多太雜，無法理清頭緒？",
              "你可能因為急於求成而在學習或成長的道路上遇到了瓶頸。",
              "你需要放慢速度，關掉外界的噪音，專注於一件事情上，才能重新找到清晰的方向。"
            ]
        }
      }
    }
  },
  {
    "id": "nine_of_wands",
    "name": "權杖九",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你在過去的感情中受過傷，因此在新的關係面前顯得小心翼翼，充滿防備。",
          "details": [
              "你是否因為害怕再次受傷而不敢完全敞開心扉？",
              "這張牌提醒你，雖然需要保護自己，但不要讓過去的陰影阻礙你迎接新的幸福。",
              "在現有關係中，這可能代表著在一次大吵之後的疲憊期，雙方都在舔舐傷口，但並未放棄。"
            ]
        },
        "reversed": {
          "summary": "你被過去的傷痛所困， paranoia（偏執）和不安全感正在侵蝕你的關係。",
          "details": [
              "你是否對伴侶充滿了不必要的猜忌和懷疑？",
              "過去的創傷讓你無法前進，你不斷地在重複同樣的防禦模式，即使現在的環境已經安全。",
              "你需要放下過去的包袱，否則你將永遠無法真正地信任和投入一段關係。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "在項目即將完成之際，你遇到了最後的挑戰，但你有足夠的毅力堅持下去。",
          "details": [
              "你已經付出了很多努力，身心俱疲，但現在不是放棄的時候，勝利就在眼前。",
              "保持警惕，最後的階段可能會出現意想不到的問題，你需要隨時準備應對。",
              "你的堅韌和不屈不撓的精神是你最寶貴的資產。"
            ]
        },
        "reversed": {
          "summary": "在最後關頭感到精疲力竭，防線崩潰，或者因為固執己見而拒絕他人的幫助。",
          "details": [
              "你是否感到自己已經到了極限，再也無法堅持下去了？",
              "你可能因為過於頑固而錯過了尋求支援的最佳時機，導致項目功虧一簣。",
              "有時候，承認自己的疲憊並尋求幫助，比一個人硬撐更需要勇氣。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你對人際關係抱持著謹慎和防禦的態度，很難完全信任新朋友。",
          "details": [
              "過去的背叛或傷害讓你學會了保護自己，在建立新的友誼時需要更多時間。",
              "雖然你感到疲憊，但你仍然在為維護重要的人際關係而努力。",
              "設定清晰的個人界線是必要的，這能幫助你感到安全。"
            ]
        },
        "reversed": {
          "summary": "你對所有人都充滿了不信任感，或者因為過度的防禦而將關心你的人推開。",
          "details": [
              "你是否覺得全世界都在與你為敵？這種偏執的想法讓你感到孤立。",
              "你拒絕了朋友的善意幫助，因為你無法放下戒心。",
              "你需要區分合理的謹慎和非理性的恐懼，否則你將永遠活在自己建造的堡壘中。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你正在與一個長期的或慢性的健康問題作鬥爭，雖然疲憊但依然堅持。",
          "details": [
              "這是一場耐力賽，你的毅力將是決定康復的關鍵。",
              "即使感到疲憊，也不要放棄你的治療方案和健康習慣。",
              "你從過去的病痛中學到了很多，這些經驗讓你變得更強大。"
            ]
        },
        "reversed": {
          "summary": "舊病復發，或者因為精神上的疲憊而放棄了對健康的努力。",
          "details": [
              "你可能對漫長的康復過程感到絕望，甚至開始自暴自棄。",
              "一個被你忽視的小問題可能演變成了更嚴重的狀況。",
              "你需要重新燃起鬥志。記住你為何開始，並尋求家人朋友的精神支持。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "儘管經歷了無數挑戰和挫折，你依然堅守著自己的核心信念。",
          "details": [
              "你的人生是一場戰鬥，而你是一位身經百戰的勇士。",
              "你的每一次受傷都讓你變得更堅強、更有智慧。",
              "在最後的考驗面前，保持你的勇氣和毅力，你離成功只有一步之遙。"
            ]
        },
        "reversed": {
          "summary": "你被過去的失敗所定義，失去了戰鬥的意志，或者變得頑固不化。",
          "details": [
              "你是否讓過去的創傷變成了你無法前行的藉口？",
              "你可能在無休止地抱怨和防禦，而不是從經驗中學習和成長。",
              "你需要放下受害者的心態。你的傷疤應該是力量的象徵，而不是軟弱的標記。"
            ]
        }
      }
    }
    },
  {
    "id": "ten_of_wands",
    "name": "權杖十",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "這段關係讓你感到負擔沉重，你可能承擔了太多的責任。",
          "details": [
              "你是否覺得自己是關係中唯一在付出和努力的人？",
              "愛情變成了一種沉重的義務，而不是喜悅的分享。",
              "你需要和伴侶溝通，重新分配責任，否則你將被這段關係壓垮。"
            ]
        },
        "reversed": {
          "summary": "你終於卸下了感情中的重擔，或者學會了分擔責任，關係變得輕鬆。",
          "details": [
              "你可能決定結束一段讓你痛苦不堪的關係，感到了前所未有的解脫。",
              "你和伴侶學會了共同分擔生活的壓力，不再是一個人獨自承受。",
              "學會拒絕和放手，是你在這段時期最重要的課題。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你承擔了過多的工作和責任，壓力巨大，感到不堪重負。",
          "details": [
              "你是否不懂得拒絕，把所有的工作都攬在了自己身上？",
              "雖然你可能即將完成一個大項目，但你已經被壓得喘不過氣，失去了工作的樂趣。",
              "你需要學會授權、委派任務，或者向上級反映你的困境。燃燒自己不是長久之計。"
            ]
        },
        "reversed": {
          "summary": "你成功地卸下了部分工作職責，或者學會了更聰明地工作，壓力得到緩解。",
          "details": [
              "你可能完成了一個重大項目，終於可以鬆一口氣了。",
              "你學會了拒絕不合理的要求，並將工作有效地分配給團隊成員。",
              "你意識到自己不必獨自承擔一切，團隊合作和尋求幫助讓你重獲新生。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你為朋友或家人付出了太多，感覺自己的人際關係變成了一種負擔。",
          "details": [
              "你是否總是在扮演「老好人」的角色，對所有人的請求都有求必應？",
              "你可能覺得自己總是在照顧別人，卻沒有人關心你的感受。",
              "你需要學會為自己的精力設定界線，否則你的人際關係會讓你精疲力竭。"
            ]
        },
        "reversed": {
          "summary": "你放下了不必要的社交負擔，或者與朋友劃清了責任界線。",
          "details": [
              "你可能選擇遠離那些只會消耗你能量的「朋友」。",
              "你學會了說「不」，不再為他人的問題過度負責。",
              "卸下重擔後，你發現自己有更多的時間和精力去經營那些真正重要和健康的關係。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "壓力過大正在嚴重影響你的身心健康，你正處於崩潰的邊緣。",
          "details": [
              "長期的壓力和過度勞累可能導致背痛、頭痛或各種與壓力相關的疾病。",
              "你完全忽視了身體發出的警訊，只是機械地繼續前行。",
              "你必須停下來！這張牌是一個嚴厲的警告，你需要立即減輕你的負擔，否則健康將會崩潰。"
            ]
        },
        "reversed": {
          "summary": "你開始正視並處理你的壓力問題，學會了放鬆和減負。",
          "details": [
              "你可能透過瑜珈、冥想或心理諮詢等方式，找到了釋放壓力的有效途徑。",
              "你終於意識到健康的重要性，並開始將自己的身心需求放在首位。",
              "卸下重擔讓你感覺如釋重負，身體狀況也因此得到改善。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你被自己的目標和野心所奴役，為了達成目標而犧牲了生活的全部。",
          "details": [
              "你是否忘記了自己當初為何出發？現在只剩下沉重的責任感。",
              "你的人生就像一場永無止境的苦役，你已經失去了所有的樂趣和靈活性。",
              "你需要重新審視你的目標。如果一個目標讓你如此痛苦，它還值得追求嗎？學會放手是智慧的表現。"
            ]
        },
        "reversed": {
          "summary": "你學會了放下執著，釋放了不必要的自我期許，找到了更輕鬆的生活方式。",
          "details": [
              "你意識到自己不必獨自扛起整個世界，並開始與他人分享你的脆弱和責任。",
              "你放下了那個讓你痛苦不堪的目標，反而找到了一條更適合你的、充滿樂趣的道路。",
              "這是一個關於「斷捨離」的時期，不僅是物質上的，更是精神上的。放下，才能獲得真正的自由。"
            ]
        }
      }
    }
  },
  {
    "id": "page_of_wands",
    "name": "權杖侍者",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你對愛情充滿了熱情和好奇，可能會有一段輕鬆、有趣的短期戀情。",
          "details": [
              "你可能會收到一個讓你興奮的約會邀請，或者與某人產生了充滿火花的曖昧情愫。",
              "這是一個享受調情樂趣、勇敢表達好感的時期，不要想得太複雜。",
              "對於現有關係，這代表著一起嘗試新事物，為愛情生活注入新的活力和樂趣。"
            ]
        },
        "reversed": {
          "summary": "熱情來得快去得也快，缺乏承諾，或者因為猶豫不決而錯失了機會。",
          "details": [
              "你可能對追求愛情感到厭倦，或者發現自己只是三分鐘熱度。",
              "一個潛在的機會可能因為你的膽怯和不自信而溜走。",
              "小心那些只追求新鮮感、不願做出承諾的對象。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "一個令人興奮的新想法或新機會出現，你充滿了學習和探索的熱情。",
          "details": [
              "你可能會接到一個全新的、充滿挑戰性的任務，這激發了你的創造力。",
              "這是一個學習新技能、探索新職業領域的好時機。",
              "保持你開放和好奇的心態，一個不起眼的小想法可能會發展成一個大項目。"
            ]
        },
        "reversed": {
          "summary": "想法不成熟，計劃缺乏方向，或者因為害怕失敗而不敢開始。",
          "details": [
              "你可能有很多點子，但都只是紙上談兵，從未真正付諸實踐。",
              "你收到的可能是一個壞消息，或者一個新機會最終被證明是空歡喜一場。",
              "缺乏明確的目標和計劃，讓你的熱情無處安放，最終只會原地打轉。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你渴望結識新朋友，探索新的社交圈，充滿了外向的能量。",
          "details": [
              "你可能會收到一個有趣的聚會邀請，並在那裡成為眾人的焦點。",
              "這是一個展現你風趣幽默一面的好時機，你的熱情會感染周圍的人。",
              "一個充滿活力的新朋友可能會進入你的生活，帶給你很多新的體驗。"
            ]
        },
        "reversed": {
          "summary": "在社交中感到害羞或不自在，或者因為行為不成熟而引起他人的反感。",
          "details": [
              "你可能想結識新朋友，但又害怕被拒絕，表現得畏首畏尾。",
              "你可能因為過於張揚或不夠圓滑而得罪了人。",
              "一個充滿希望的新友誼可能因為你的猶豫而未能開始。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你充滿了嘗試新運動或健康生活方式的熱情和能量。",
          "details": [
              "這是開始一項新運動，比如舞蹈、攀岩或任何讓你感到興奮的活動的絕佳時機。",
              "你的身體充滿了年輕的活力，恢復得很快。",
              "將這股能量投入到積極的戶外活動中去吧！"
            ]
        },
        "reversed": {
          "summary": "開始新的健身計劃時三分鐘熱度，或者因為魯莽而導致運動傷害。",
          "details": [
              "你可能報名了健身房，但只去了一兩次就放棄了。",
              "在嘗試新運動時，要小心因為過於興奮或準備不足而受傷。",
              "缺乏持之以恆的毅力是你健康計劃失敗的主要原因。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你內心的創造力被喚醒，你渴望探索自己的潛能和這個世界的無限可能。",
          "details": [
              "這是一個追隨你的好奇心，去學習、去旅行、去體驗的時刻。",
              "一個新的靈感或頓悟讓你對人生有了全新的看法。",
              "不要害怕犯錯，侍者代表著學習的過程。每一次嘗試都是寶貴的經驗。"
            ]
        },
        "reversed": {
          "summary": "感到靈感枯竭，對任何事都提不起興趣，或者因為害怕未知而停滯不前。",
          "details": [
              "你是否覺得生活一成不變，失去了所有的激情和好奇心？",
              "你可能有很多想法，但總是停留在「如果…」的階段，從不敢真正去探索。",
              "你需要重新點燃你內心的火焰。試著從一件小小的、你從未做過的事情開始。"
            ]
        }
      }
    }
  },
  {
    "id": "knight_of_wands",
    "name": "權杖騎士",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段充滿激情和魅力的戀情，對方可能是一個極具行動力和自信的人。",
          "details": [
              "你的愛情生活充滿了活力和意想不到的驚喜，就像一場刺激的冒險。",
              "這張牌代表一個熱情、迷人但可能不太會安定下來的愛人。",
              "享受當下的激情，但也要思考這段快速發展的關係是否是你想要的未來。"
            ]
        },
        "reversed": {
          "summary": "魯莽的行動和衝動的決定給關係帶來了麻煩，或者對方的熱情迅速冷卻。",
          "details": [
              "你或你的伴侶可能因為一時衝動而說出傷人的話或做出後悔的決定。",
              "這段關係可能因為缺乏耐心和深思熟慮而充滿了不確定性。",
              "小心那些只追求刺激，不願為關係的穩定付出努力的人。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你充滿了能量和動力，準備好迎接挑戰，果斷地採取行動。",
          "details": [
              "這是一個執行計劃、推動項目進展的絕佳時機，你的行動力將會帶來顯著的成果。",
              "你可能會接到一個需要你立刻行動的緊急任務，或者決定搬遷到一個新的城市去尋求發展。",
              "你的自信和魄力讓你成為團隊中的火車頭，帶領大家向前衝。"
            ]
        },
        "reversed": {
          "summary": "因為魯莽和缺乏規劃而導致項目失敗，或者感到精力分散，無法集中。",
          "details": [
              "你可能因為急於求成而犯下錯誤，或者在多個項目之間疲於奔命，結果一事無成。",
              "一個看似充滿希望的計劃可能因為你的衝動而偏離了軌道。",
              "你需要停下來，重新評估你的方向。行動力雖好，但沒有方向的行動只是在浪費能量。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是一個充滿活力的社交達人，總是能帶動氣氛，發起新的活動。",
          "details": [
              "你可能會心血來潮地組織一場派對或一次即興旅行，你的朋友都很喜歡你的熱情。",
              "你的生活充滿了變化和新鮮感，總有新的朋友和新的故事。",
              "你就像團隊中的能量核心，有你在的地方就不會沉悶。"
            ]
        },
        "reversed": {
          "summary": "你的衝動和不可預測性可能讓朋友感到不安，或者你對社交活動感到厭倦。",
          "details": [
              "你可能因為一時的口無遮攔而傷害了朋友，或者你的行為讓人覺得你不可靠。",
              "不斷地追逐新鮮感讓你無法建立深厚的友誼。",
              "你需要學會在熱情和穩定之間找到平衡，否則你的朋友會因為跟不上你的腳步而離開。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你充滿了運動的能量和動力，身體處於一個活躍和健康的狀態。",
          "details": [
              "這是一個挑戰自己體能極限的好時機，例如參加馬拉松或進行高強度訓練。",
              "你的新陳代謝旺盛，精力充沛。",
              "將這股強大的能量投入到你喜歡的體育活動中，你會感到無比的暢快。"
            ]
        },
        "reversed": {
          "summary": "因為過度運動或魯莽的行為而導致受傷，或者感到精力耗盡。",
          "details": [
              "你可能因為好勝心強而在運動中不顧後果，導致了拉傷或更嚴重的傷害。",
              "你像一台失控的跑車，能量正在被不受控制地消耗，你需要學會休息。",
              "衝動的飲食或生活習慣正在損害你的健康。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你充滿了改變和行動的勇氣，準備好去追逐你的夢想。",
          "details": [
              "這是一個將想法轉化為現實的時刻。不要再等了，現在就去做！",
              "你可能會決定搬家、換工作、或者開始一場說走就走的長途旅行，去探索未知的自己。",
              "你的熱情和自信是你最強大的驅動力，相信你的直覺，勇敢地向前衝。"
            ]
        },
        "reversed": {
          "summary": "你感到焦躁不安，能量無法被有效利用，或者因為害怕改變而停滯不前。",
          "details": [
              "你有很多想法和衝動，但它們混亂無序，讓你感到沮喪和無力。",
              "你渴望改變，但又害怕離開舒適區，這種內耗讓你筋疲力盡。",
              "你需要一個明確的目標來引導你這股強大的能量。先找到你的目的地，然後再全速前進。"
            ]
        }
      }
    }
  },
  {
    "id": "queen_of_wands",
    "name": "權杖皇后",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你或你的伴侶在關係中展現出熱情、自信和獨立的魅力。",
          "details": [
              "這是一段充滿活力和平等尊重的關係，雙方都有自己的生活和追求，同時又深深地吸引著對方。",
              "你對自己充滿自信，這種魅力讓你成為眾人矚目的焦點。",
              "對於單身者，這張牌鼓勵你勇敢地展現自我，你的熱情和獨立會吸引到欣賞你的人。"
            ]
        },
        "reversed": {
          "summary": "關係中出現嫉妒、控制欲，或者一方的熱情變成了咄咄逼人的壓力。",
          "details": [
              "你或你的伴侶可能因為不安全感而試圖控制對方，導致關係緊張。",
              "過度的戲劇化和情緒化正在消耗你們的感情。",
              "你可能因為害怕失去自我而不敢投入一段關係，或者在關係中變得過於強勢。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你充滿創造力和熱情，在工作中表現出色，善於激勵團隊。",
          "details": [
              "你的自信和領導力讓你成為團隊的核心，能夠帶領大家朝著目標前進。",
              "這是一個發揮你創造力的絕佳時機，你的點子將會得到認可和執行。",
              "你善於處理多重任務，並且享受在忙碌中實現自我價值。"
            ]
        },
        "reversed": {
          "summary": "在工作中變得專橫、缺乏耐心，或者因為害怕競爭而變得畏縮。",
          "details": [
              "你可能因為壓力而變得易怒和不耐煩，影響了團隊合作。",
              "你對自己的能力產生了懷疑，不敢承擔領導責任或提出自己的想法。",
              "小心不要讓你的野心變成不擇手段的競爭，這會損害你的聲譽。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是一個充滿魅力的社交女王，善於組織活動，深受朋友歡迎。",
          "details": [
              "你的家總是朋友聚會的中心，你熱情好客，讓每個人都感到賓至如歸。",
              "你樂觀、開朗的性格讓你擁有廣泛的人脈，總能給周圍的人帶來正能量。",
              "你是一個忠誠且充滿保護欲的朋友，會為朋友挺身而出。"
            ]
        },
        "reversed": {
          "summary": "你可能變得愛管閒事、喜歡八卦，或者因為嫉妒而與朋友產生矛盾。",
          "details": [
              "你是否過於在意別人的眼光，或者喜歡在背後議論他人？",
              "你可能因為嫉妒朋友的成功而產生了不平衡的心態。",
              "你需要學會管理自己的情緒，不要讓負面的能量破壞你的友誼。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你充滿活力，對自己的身體狀況感到自信和滿意。",
          "details": [
              "你的身心都處於一個非常健康和平衡的狀態，充滿了生命力。",
              "這張牌也與生育能力和旺盛的性能量有關。",
              "你樂於透過運動和健康的飲食來保持自己的最佳狀態。"
            ]
        },
        "reversed": {
          "summary": "你可能因為壓力或情緒問題而忽略了自己的健康，感到精力衰退。",
          "details": [
              "你是否因為過於關注外界而忘記了照顧自己？",
              "情緒上的不穩定可能正在影響你的身體健康，例如荷爾蒙失調。",
              "你需要重新將注意力放回自己身上，學會愛護和滋養你的身體。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你勇敢地做自己，活出了最真實、最熱情的版本，充滿自信和創造力。",
          "details": [
              "你清楚自己的慾望和目標，並有能力去實現它們。",
              "你不再害怕他人的眼光，你的獨立和自信是你最大的魅力。",
              "這是一個全然擁抱自己、慶祝自己獨一無二的時刻。"
            ]
        },
        "reversed": {
          "summary": "你對自己缺乏信心，過度依賴他人的肯定，或者被嫉妒和不安全感所困擾。",
          "details": [
              "你是否總是在模仿別人，卻忘記了自己是誰？",
              "你內心的不安全感讓你無法真正地快樂和自信。",
              "你需要停止與他人比較，轉而向內探索，找到並點燃屬於你自己的那團火焰。"
            ]
        }
      }
    }
  },
  {
    "id": "king_of_wands",
    "name": "權杖國王",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你或你的伴侶在關係中扮演著一個充滿魅力、自信且可靠的領導者角色。",
          "details": [
              "這是一段成熟、充滿活力且目標明確的關係。你們不僅是愛人，更是共同創造未來的夥伴。",
              "你的伴侶可能是一個非常有遠見和領導力的人，他/她的熱情深深地激勵著你。",
              "你對自己和這段關係都充滿信心，能夠以一種成熟的方式來處理感情中的挑戰。"
            ]
        },
        "reversed": {
          "summary": "關係中出現了專橫、控制和缺乏耐心的問題，一方的強勢變成了傲慢。",
          "details": [
              "你或你的伴侶可能變得過於強勢和固執，不願意傾聽對方的意見。",
              "對未來的期望過高，或者過於急躁，給關係帶來了巨大的壓力。",
              "一個曾經充滿魅力的領導者，現在可能變成了一個不容置疑的暴君。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你是一位天生的領袖，充滿遠見，能夠帶領團隊實現宏大的目標。",
          "details": [
              "這是你展現領導才能、開創事業版圖的絕佳時機。你的願景將會激勵所有人。",
              "你不僅有創新的想法，更有將其付諸實踐的強大執行力。",
              "作為一個領導者，你既有權威，又不失熱情，深受下屬的尊敬和愛戴。"
            ]
        },
        "reversed": {
          "summary": "你可能變得專斷、傲慢，聽不進任何反對意見，導致決策失誤。",
          "details": [
              "你對自己的計劃過於自信，高估了自己的能力，拒絕採納他人的建議。",
              "作為領導，你可能對下屬缺乏耐心，要求過於苛刻，導致團隊士氣低落。",
              "一個宏大的願景可能因為你的魯莽和缺乏深思熟慮而最終失敗。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是一個社群的領袖，你的遠見和熱情能夠將人們團結在一起。",
          "details": [
              "你善於激勵朋友，帶領大家去完成一些有意義的事情。",
              "你在朋友圈中擁有很高的聲望，大家都很信任你的判斷和決定。",
              "你是一個既能啟發他人，又能給予他人實際支持的可靠朋友。"
            ]
        },
        "reversed": {
          "summary": "你可能在朋友面前表現得過於強勢和自大，或者對他人做出不切實際的承諾。",
          "details": [
              "你是否總想成為注意力的中心，並強迫他人接受你的觀點？",
              "你可能承諾了你無法兌現的事情，讓朋友們對你感到失望。",
              "你需要學會尊重他人，一個真正的領袖是懂得傾聽和謙遜的。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你對自己的健康有著完全的掌控力，精力充沛，充滿活力。",
          "details": [
              "你的身體處於巔峰狀態，充滿了火一般的生命能量。",
              "你有著強大的意志力，能夠長期堅持一個健康的、積極的生活方式。",
              "你是自己健康的主人，完全有能力去實現你設定的任何健身目標。"
            ]
        },
        "reversed": {
          "summary": "你可能因為過於自信而忽視了身體的警訊，或者因為壓力過大而感到精疲力竭。",
          "details": [
              "你是否因為工作狂的狀態而透支了你的體力？",
              "你可能對自己的身體過於自信，從事一些超出你能力範圍的高風險活動。",
              "即使是國王也需要休息。你需要學會放慢腳步，傾聽你身體的聲音。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你完全掌控了自己的生命方向，你的內在願景和外在行動達到了完美的統一。",
          "details": [
              "你不再只是有想法，而是有能力將任何想法轉化為現實。",
              "你活出了自己最真實、最強大的版本，你就是自己王國的國王。",
              "你的存在本身就在激勵和啟發著周圍的人，你是一個天生的創造者和領導者。"
            ]
        },
        "reversed": {
          "summary": "你的野心和控制欲失控，或者你因為害怕失敗而不敢去追求你真正的願景。",
          "details": [
              "你是否變得為了成功而不擇手段，失去了最初的熱情和正直？",
              "你擁有宏大的願景，但卻被執行層面的困難或對失敗的恐懼所束縛。",
              "你需要重新找回你內心的火焰，並確保你的行動是出於創造，而不是出於恐懼或權力慾。"
            ]
        }
      }
    }
  },
  {
    "id": "ace_of_cups",
    "name": "聖杯一",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段深刻、充滿愛意的新關係即將開始，或者現有關係進入了情感更深厚的階段。",
          "details": [
              "你的心是敞開的，準備好去愛與被愛。這是一段真誠、發自內心的情感的開端。",
              "對於單身者，這預示著一段靈魂伴侶般的戀情即將出現。",
              "在現有關係中，這代表著情感的昇華、懷孕或是一個充滿愛的全新開始。"
            ]
        },
        "reversed": {
          "summary": "情感被壓抑或堵塞，你可能在情感上封閉了自己，或者一段關係讓你感到空虛。",
          "details": [
              "你是否害怕表達自己的真實情感，或者害怕接受他人的愛？",
              "一段關係可能只是表面上的，缺乏真正的情感交流，讓你感到孤獨。",
              "你需要傾聽你內心的聲音，找出是什麼阻礙了你情感的流動。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你在工作中找到了情感上的滿足感，或者一個充滿創造力的項目讓你充滿熱情。",
          "details": [
              "你對你的工作充滿了熱愛，而不僅僅是為了薪水。",
              "這是一個發揮你藝術或創作才能的絕佳時機，你的作品將充滿情感和感染力。",
              "工作環境充滿了關懷和支持，同事關係和諧。"
            ]
        },
        "reversed": {
          "summary": "工作讓你感到情感枯竭、缺乏創造力，或者你對目前的工作感到不滿。",
          "details": [
              "你可能正在從事一份你不喜歡的工作，每天都感到情緒低落。",
              "你的創意被壓抑，無法在工作中找到自我價值和滿足感。",
              "你需要找到一份能讓你投入情感和熱情的工作，而不僅僅是一份差事。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "一段深刻的新友誼正在萌芽，或者你與朋友、家人的情感聯繫更加緊密。",
          "details": [
              "你可能會遇到一位能與你心靈相通的新朋友。",
              "你與家人或朋友之間的誤會得到化解，彼此的關係充滿了愛和寬恕。",
              "這是一個向你關心的人表達愛意和感激的好時機。"
            ]
        },
        "reversed": {
          "summary": "在人際關係中感到孤獨，或者與朋友、家人的情感交流受阻。",
          "details": [
              "你可能覺得沒有人真正理解你，感到被孤立。",
              "你與朋友或家人之間可能存在一些未說出口的情感問題，導致關係變得冷淡。",
              "你需要更主動地去溝通，表達你的感受，而不是將自己封閉起來。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的情緒健康狀況良好，內心充滿平靜與喜悅，這對身體健康有積極影響。",
          "details": [
              "這張牌強烈關聯到情緒健康。一個快樂的心靈是身體健康最好的良藥。",
              "這也可能預示著懷孕或一個新生命的到來。",
              "多從事能滋養你心靈的活動，例如冥想、接觸大自然或與所愛的人相處。"
            ]
        },
        "reversed": {
          "summary": "被壓抑的情緒正在影響你的身體健康，你可能感到沮多愁善感或情緒低落。",
          "details": [
              "你是否感到莫名的悲傷或焦慮？這些情緒可能正在以身體症狀的形式表現出來。",
              "這也可能代表著與懷孕或荷爾蒙相關的問題。",
              "你需要正視並處理你的情緒問題，尋求心理支持或從事能讓你情緒得到釋放的活動。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你的心靈正在覺醒，你開始與自己的直覺和更深層次的情感產生連結。",
          "details": [
              "這是一個靈性成長的開始，你對愛、慈悲和宇宙有了新的領悟。",
              "你的直覺變得異常敏銳，學會傾聽並相信你內心的聲音。",
              "透過愛自己，你將學會如何去愛整個世界。這是一個自我接納和心靈療癒的過程。"
            ]
        },
        "reversed": {
          "summary": "你與自己的情感和直覺失去了連結，感到內心空虛和迷茫。",
          "details": [
              "你是否過於依賴邏輯和理性，而忽視了自己內心的感受？",
              "你可能在刻意壓抑某些讓你感到不舒服的情緒，但這只會讓你離真實的自己越來越遠。",
              "你需要重新學會感受。花些時間獨處，問問你的心，它真正渴望的是什麼。"
            ]
        }
      }
    }
  },
  {
    "id": "two_of_cups",
    "name": "聖杯二",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段充滿吸引力、互相尊重的愛情關係，你們是平等的靈魂伴侶。",
          "details": [
              "你和你的伴侶之間有著深刻的情感連結和心靈感應。",
              "這張牌預示著一段新的、美好的戀情的開始，或者現有關係進入了訂婚或結婚的階段。",
              "你們之間的吸引力是相互的，這是一段建立在平等和尊重基礎上的健康關係。"
            ]
        },
        "reversed": {
          "summary": "關係失衡，情感交流中斷，或者吸引力僅僅是單方面的。",
          "details": [
              "你和伴侶之間可能出現了裂痕，缺乏溝通，導致情感疏遠。",
              "你是否感覺在這段關係中，只有你一個人在付出？",
              "一段看似美好的關係可能因為缺乏真正的連結而變得脆弱，甚至可能面臨分手。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "一個成功的商業夥伴關係或合作項目，團隊合作非常愉快。",
          "details": [
              "你可能會找到一個與你一拍即合的合作夥伴，共同開創事業。",
              "這是一個簽訂合約、達成協議的絕佳時機，雙方都能從中受益。",
              "你在工作中的人際關係非常和諧，能夠得到同事的支持與合作。"
            ]
        },
        "reversed": {
          "summary": "合作關係破裂，夥伴之間缺乏信任，或者一個重要的合約告吹。",
          "details": [
              "你和你的合作夥伴可能因為目標不一致或利益衝突而分道揚鑣。",
              "溝通不暢和互相猜忌正在破壞你們的團隊合作。",
              "在簽署任何合約之前，請務必仔細審查條款，避免未來的糾紛。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你和某個朋友之間有著深刻的連結，或者一段重要的友誼得以和解。",
          "details": [
              "你可能會遇到一個讓你感覺像是認識了很久的知己。",
              "如果你和朋友之間有過爭執，這張牌預示著你們將會和解，重歸於好。",
              "這是一段建立在相互理解和支持基礎上的、非常健康的友誼。"
            ]
        },
        "reversed": {
          "summary": "友誼出現裂痕，彼此不再信任，或者你感到被朋友誤解。",
          "details": [
              "你和朋友之間可能因為一些小事而產生了隔閡，關係變得緊張。",
              "你可能覺得你的付出沒有得到朋友的回應，感到不平衡。",
              "你需要坦誠地與朋友溝通，解決你們之間的問題，否則這段友誼可能會結束。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身心處於一個和諧平衡的狀態，情緒的穩定促進了身體的健康。",
          "details": [
              "這張牌強調了身心連結的重要性。當你的情緒穩定時，你的身體也會更健康。",
              "與伴侶或朋友的良好關係是你重要的精神支柱，對你的健康有積極影響。",
              "這是一個尋求平衡的生活方式，例如結合運動和冥想的好時機。"
            ]
        },
        "reversed": {
          "summary": "身心失衡，情緒的波動正在影響你的健康。",
          "details": [
              "人際關係的壓力或情感上的不和諧可能正在對你的身體造成負面影響。",
              "你可能感到內分泌失調或荷爾蒙水平不穩定。",
              "你需要找到讓自己內心恢復平靜的方法，解決情感問題是改善健康的第一步。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在學習如何愛自己，並與自己內在的不同部分達成和解。",
          "details": [
              "這是一個自我整合的過程，你開始接納自己的全部，包括你的優點和缺點。",
              "你與自己的關係達成了和諧，不再有內心的衝突和自我批判。",
              "當你真正學會與自己和平相處時，你才能與他人建立真正健康的關係。"
            ]
        },
        "reversed": {
          "summary": "你處於內心衝突的狀態，自我憎恨或缺乏自愛。",
          "details": [
              "你是否對自己過於苛刻，無法接納自己的不完美？",
              "你內心的陰暗面和光明面正在交戰，讓你感到分裂和痛苦。",
              "你需要學會寬恕和愛自己。尋求心理諮詢或進行內在小孩療癒可能會對你有幫助。"
            ]
        }
      }
    }
  },
  {
    "id": "three_of_cups",
    "name": "聖杯三",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "戀情發展順利，可能是時候將伴侶介紹給你的朋友圈，或者慶祝一個重要的紀念日。",
          "details": [
              "你的愛情得到了朋友們的祝福和支持。",
              "這張牌也可能暗示著「三人行」的關係，但通常是指向積極的、開放的關係模式，或者是從友誼發展成的愛情。",
              "享受與伴侶和朋友們一起的歡樂時光，例如參加派對或婚禮。"
            ]
        },
        "reversed": {
          "summary": "關係中可能出現了第三者，或者因為過度沉迷於社交而忽略了伴侶。",
          "details": [
              "你需要警惕潛在的三角關係或不忠的行為。",
              "你或你的伴侶是否花太多時間和朋友在一起，而冷落了對方？",
              "一場本應快樂的慶祝活動可能因為爭吵或嫉妒而變了味。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "團隊合作項目取得了成功，是時候與同事們一起慶祝成果了。",
          "details": [
              "你的工作環境非常和諧，團隊成員之間相處融洽，合作無間。",
              "一個重要的項目成功收尾，公司可能會舉辦慶功宴。",
              "這是一個建立良好同事關係、享受團隊合作樂趣的時期。"
            ]
        },
        "reversed": {
          "summary": "團隊中出現了小團體或辦公室八卦，影響了合作氛圍和工作效率。",
          "details": [
              "你可能覺得自己被排擠在某個小圈子之外，或者團隊內部存在不健康的競爭。",
              "一個項目可能因為團隊成員之間的不和而失敗。",
              "你需要遠離辦公室政治和背後的閒言碎語，專注於你自己的工作。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "與朋友們的歡樂時光，享受團體活動和慶祝的喜悅。",
          "details": [
              "這是一張完美的「閨蜜牌」或「兄弟牌」，代表著與朋友們無憂無慮地分享快樂。",
              "你可能會參加一場婚禮、生日派對、畢業典禮或任何形式的慶祝活動。",
              "你的社交生活非常豐富多彩，你感覺自己被一個充滿愛的社群所包圍。"
            ]
        },
        "reversed": {
          "summary": "友誼中出現了小團體或排擠現象，或者你感到與朋友們格格不入。",
          "details": [
              "你是否覺得自己被最好的朋友們排除在外了？",
              "一場聚會可能因為過度飲酒或不當言行而變得不歡而散。",
              "你需要警惕那些只在享樂時出現，卻在你需要時消失的「酒肉朋友」。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身心都處於一個快樂和諧的狀態，社交活動有助於你的心理健康。",
          "details": [
              "與朋友和家人共度的歡樂時光是你最好的壓力釋放劑。",
              "這張牌也可能代表著成功戒除某個壞習慣後的慶祝。",
              "保持樂觀和積極的心態，這對你的整體健康非常有益。"
            ]
        },
        "reversed": {
          "summary": "過度的社交和玩樂正在影響你的健康，例如宿醉或睡眠不足。",
          "details": [
              "你是否因為頻繁的派對和熬夜而感到筋疲力竭？",
              "你需要學會在享樂和自律之間找到平衡。",
              "孤立和缺乏社交也可能導致心理健康問題，你需要找到一個健康的社交平衡點。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在享受與他人合作和分享的樂趣，並從中找到了自我價值。",
          "details": [
              "你意識到自己不是一座孤島，與他人連結和分享能帶來巨大的快樂和成長。",
              "這是一個參與社群活動、志願者工作或任何形式的集體創作的好時機。",
              "透過與他人分享你的快樂，你的快樂會加倍。"
            ]
        },
        "reversed": {
          "summary": "你寧願獨自一人，或者在集體中感到不自在，無法融入。",
          "details": [
              "你是否覺得自己與周圍的人缺乏共同語言，寧願獨處？",
              "你可能因為過於在意他人的看法而無法在集體中真實地做自己。",
              "獨處是必要的，但完全的孤立會阻礙你的成長。你需要找到一個能讓你感到安全和被接納的社群。"
            ]
        }
      }
    }
  },
  {
    "id": "four_of_cups",
    "name": "聖杯四",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你對目前的感情狀況感到厭倦或不滿，或者對新的追求者視而不見。",
          "details": [
              "你是否覺得目前的關係一成不變，失去了新鮮感？",
              "對於單身者，你可能因為沉浸在過去的傷痛或對愛情抱持不切實際的幻想，而錯過了身邊的好機會。",
              "你可能需要一些獨處的時間來思考你真正想要的愛情是什麼樣的。"
            ]
        },
        "reversed": {
          "summary": "你開始走出自己的世界，願意接受新的機會，或者重新對現有關係燃起興趣。",
          "details": [
              "你終於意識到自己不能再這樣消沉下去，決定主動去尋找或接受愛。",
              "你開始欣賞伴侶的優點，並願意為改善關係而努力。",
              "一個被你忽略已久的機會或追求者，現在你決定給彼此一個機會。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你對目前的工作感到厭倦、缺乏動力，對新的機會也提不起興趣。",
          "details": [
              "你是否覺得工作重複乏味，失去了所有的熱情？",
              "一個很好的晉升或合作機會可能就在你面前，但你卻因為不滿或冷漠而沒有察覺。",
              "你需要花時間進行內省，思考這份工作是否還符合你的價值觀和目標。"
            ]
        },
        "reversed": {
          "summary": "你重新燃起了對工作的熱情，開始積極尋找或把握新的機會。",
          "details": [
              "一段休息和反思之後，你帶著新的動力回到了工作崗位。",
              "你開始主動尋求新的挑戰和項目，不再沉浸於過去的倦怠中。",
              "你意識到自己不能再錯過機會，並開始為自己的職業生涯採取積極的行動。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你對社交活動感到厭倦，寧願獨處，因此可能錯過了結識新朋友的機會。",
          "details": [
              "你是否覺得參加聚會很累，不想進行無意義的社交？",
              "你可能因為沉浸在自己的小世界裡，而忽略了朋友們的關心和邀請。",
              "適度的獨處是好的，但完全的孤立會讓你錯過很多美好的連結。"
            ]
        },
        "reversed": {
          "summary": "你決定走出孤獨，重新投入社交生活，並對建立新的人際關係持開放態度。",
          "details": [
              "你意識到人際關係的重要性，並開始主動聯繫朋友，參加社交活動。",
              "你放下了過去的偏見或不滿，願意給予他人新的機會。",
              "你的人際關係因為你的開放態度而變得更加活躍和積極。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你可能因為情緒低落或缺乏動力而忽略了自己的健康。",
          "details": [
              "你是否對運動或健康的飲食提不起勁，寧願躺在沙發上？",
              "情緒上的冷漠和倦怠可能正在影響你的身體活力。",
              "你需要找到一個能激發你熱情的新目標，來帶動你的身心重新活躍起來。"
            ]
        },
        "reversed": {
          "summary": "你開始重新關注自己的健康，並採取積極的行動來改善身心狀態。",
          "details": [
              "你走出了情緒的低谷，開始享受運動和健康飲食帶來的積極感受。",
              "你找到了一個適合自己的、能讓你充滿動力的健康計劃。",
              "你意識到心理健康和身體健康是密不可分的，並開始同時照顧這兩方面。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正處於一個內省和退縮的時期，對外界的一切都感到索然無味。",
          "details": [
              "這是一個向內看的時期，你可能在反思人生的意義，或者對現狀感到不滿。",
              "小心不要因為過度沉浸在自己的世界裡，而錯過了宇宙遞給你的禮物（機會）。",
              "你需要弄清楚，你是在進行有益的內省，還是在無謂地鑽牛角尖。"
            ]
        },
        "reversed": {
          "summary": "你結束了內省期，帶著新的領悟重新擁抱世界，對生活充滿了新的熱情。",
          "details": [
              "你已經從沉思和冥想中獲得了答案，現在是時候將它們付諸實踐了。",
              "你不再專注於你所沒有的，而是開始感恩和利用你所擁有的。",
              "你的視野變得開闊，能夠看到之前被你忽略的種種可能性。"
            ]
        }
      }
    }
  },
  {
    "id": "five_of_cups",
    "name": "聖杯五",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你正為一段逝去的感情或關係中的失落而悲傷，無法自拔。",
          "details": [
              "你可能正在經歷分手或被拒絕的痛苦，你的注意力完全集中在失去的東西上。",
              "你是否總是在回憶過去的美好，而忽略了眼前伴侶的感受？",
              "這張牌提醒你，雖然悲傷是必要的過程，但不要忘記你身邊仍然有愛你的人和新的可能性。"
            ]
        },
        "reversed": {
          "summary": "你開始從失落的情感中走出來，願意放下過去，並看到了新的希望。",
          "details": [
              "你終於意識到，沉浸在悲傷中無濟於事，並開始尋找新的幸福。",
              "你學會了原諒自己和他人，並從過去的錯誤中吸取了教訓。",
              "你轉過身，看到了那兩個仍然立著的聖杯——代表著新的愛情機會或現有關係的和解。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "一個重要的項目失敗了，或者你錯失了一個重要的機會，為此感到非常失望和後悔。",
          "details": [
              "你可能因為一個錯誤的決定而導致了重大的損失。",
              "你的注意力完全集中在失敗的項目上，而忽略了其他仍在進行中的工作或新的機會。",
              "允許自己為失敗感到難過，但不要讓這種情緒持續太久。你需要從失敗中學習並繼續前進。"
            ]
        },
        "reversed": {
          "summary": "你從失敗的陰影中走出來，開始尋找新的工作機會或補救措施。",
          "details": [
              "你不再為打翻的牛奶哭泣，而是開始思考如何補救損失或開闢新的道路。",
              "你意識到一次失敗並不代表世界末日，你仍然擁有其他的資源和能力。",
              "這是一個重拾信心、重新出發的時期。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你可能因為與朋友的爭吵或失去一段重要的友誼而感到悲傷。",
          "details": [
              "你沉浸在失去朋友的痛苦中，無法看到身邊其他支持你的朋友。",
              "你可能因為說錯話或做錯事而感到深深的自責和後悔。",
              "你需要時間來療癒，但也要記住，真正的朋友會理解和原諒你。"
            ]
        },
        "reversed": {
          "summary": "你開始修復受損的友誼，或者願意放下過去，結識新的朋友。",
          "details": [
              "你主動向朋友道歉，或者接受了朋友的和解請求。",
              "你意識到不能讓一段失敗的友誼定義你所有的人際關係。",
              "你開始將注意力從失去的朋友轉移到那些一直在你身邊支持你的人身上。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你可能因為一次流產、一個令人失望的診斷結果或康復過程中的挫折而感到悲傷。",
          "details": [
              "情緒上的失落和悲傷正在影響你的身體健康，讓你感到疲憊和虛弱。",
              "你可能過於專注於你無法控制的健康問題，而忽略了你可以改善的部分。",
              "尋求心理支持和情感上的疏導，對於你身體的康復至關重要。"
            ]
        },
        "reversed": {
          "summary": "你開始接受現實，並以更積極的心態面對你的健康問題。",
          "details": [
              "你不再為無法改變的事情而悲傷，而是專注於如何讓自己變得更好。",
              "你找到了新的治療方法或支持團體，讓你重拾希望。",
              "你學會了與你的健康問題共存，並從中找到了新的力量和智慧。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你被困在對過去的悔恨和失望中，無法看到未來的希望。",
          "details": [
              "你是否總是在想「如果當初…就好了」？這種想法讓你無法前進。",
              "你只看到了自己的失敗和失去，卻沒有看到自己仍然擁有的優點和機會。",
              "悲傷是一個必要的過程，但你需要設定一個期限。問問自己：我身後那兩個立著的杯子裡裝的是什麼？"
            ]
        },
        "reversed": {
          "summary": "你學會了放下過去，從失敗中汲取智慧，並準備好迎接新的開始。",
          "details": [
              "你意識到每一次的失去都為新的獲得騰出了空間。",
              "你不再將自己視為一個受害者，而是將過去的經歷視為成長的養分。",
              "這是一個深刻的療癒和轉化的過程，你正在變得更加完整和富有同情心。"
            ]
        }
      }
    }
    },
  {
    "id": "six_of_cups",
    "name": "聖杯六",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你可能會與青梅竹馬或舊情人重逢，或者在現有關係中重溫過去的美好。",
          "details": [
              "這是一段充滿純真和甜蜜情感的時期，就像回到了初戀的感覺。",
              "你和伴侶可能會回到你們第一次約會的地方，或者一起翻看舊照片，重溫往事。",
              "對於單身者，你的下一個伴侶可能是一個你已經認識很久的人。"
            ]
        },
        "reversed": {
          "summary": "你過於沉溺在對過去戀情的幻想中，無法活在當下，或者一段舊情人的出現帶來了麻煩。",
          "details": [
              "你是否總是用過去的完美戀人來和現在的對象比較？",
              "你需要放下過去，才能為新的愛情騰出空間。",
              "一個舊情人的再次出現可能不是浪漫的重逢，而是揭開了尚未癒合的舊傷疤。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你可能會回到一個你曾經工作過的地方，或者在工作中運用到過去的經驗。",
          "details": [
              "一個過去的同事或老闆可能會為你提供一個新的工作機會。",
              "你的工作可能與兒童、教育或慈善事業有關。",
              "這是一個充滿創造力和團隊合作的時期，工作氛圍像家一樣溫暖。"
            ]
        },
        "reversed": {
          "summary": "你被過去的工作模式所束縛，無法適應新的環境，或者感到工作幼稚、缺乏挑戰。",
          "details": [
              "你是否總是在說「我們以前都是這麼做的」？你需要學習新的技能和方法。",
              "你可能覺得目前的工作無法讓你成長，讓你感到停滯不前。",
              "你需要離開你的舒適區，去尋找一個更能激發你潛能的環境。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "與童年時的朋友或老同學重逢，一起回憶過去的快樂時光。",
          "details": [
              "你可能會收到一個同學會的邀請，或者在社交媒體上與失聯已久的朋友重新取得聯繫。",
              "這是一個充滿懷舊氣氛的時期，你會非常享受和老朋友在一起的感覺。",
              "你可能會回到你的家鄉，與家人和兒時的玩伴共度一段美好的時光。"
            ]
        },
        "reversed": {
          "summary": "你被困在過去的人際關係中，或者與老朋友的重逢並不愉快。",
          "details": [
              "你可能發現自己和老朋友們已經沒有共同話題，彼此都變了。",
              "過去的某些不愉快的經歷可能再次浮現，影響了你現在的人際關係。",
              "你需要活在當下，去結識新的朋友，而不是總想著回到過去。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康問題可能與遺傳或童年時期的經歷有關。",
          "details": [
              "這張牌提醒你關注你的家族病史。",
              "你的身心健康狀況可能因為回憶起快樂的童年時光而得到改善。",
              "這也可能代表著透過一些充滿童趣的活動（如玩遊戲、塗鴉）來療癒心靈。"
            ]
        },
        "reversed": {
          "summary": "一個童年時期的創傷或被壓抑的記憶可能正在影響你現在的健康。",
          "details": [
              "你是否有一些無法解釋的健康問題？它們可能根植於你早已忘卻的過去。",
              "你需要正視並處理這些來自過去的創傷，才能獲得真正的療癒。",
              "尋求心理治療或催眠等方式可能會幫助你找到問題的根源。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在與你的內在小孩重新連結，重拾純真、好奇和快樂。",
          "details": [
              "這是一個療癒童年創傷、擁抱內在小孩的絕佳時機。",
              "允許自己像個孩子一樣去玩耍、去夢想，不要被成人的規則所束縛。",
              "你的過去是你的一部分，它塑造了今天的你。學會感恩和接納你的全部經歷。"
            ]
        },
        "reversed": {
          "summary": "你被過去的陰影所困，無法成長，或者你正在逃避作為一個成年人應負的責任。",
          "details": [
              "你是否還像個孩子一樣，希望有人能為你解決所有問題？",
              "童年的不愉快經歷可能讓你對世界產生了負面的看法，阻礙了你的個人發展。",
              "你需要學會區分健康的懷舊和不健康的逃避。是時候長大了，並為自己的人生負責。"
            ]
        }
      }
    }
  },
  {
    "id": "seven_of_cups",
    "name": "聖杯七",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你可能對愛情抱有過多的幻想，或者面臨多個追求者而難以抉擇。",
          "details": [
              "你是否在網路上與多人曖昧，享受著被追求的感覺，卻不想做出任何承諾？",
              "你可能愛上的是你腦中幻想出來的完美對象，而不是真實的他/她。",
              "你需要分清哪些是真實的情感，哪些只是你的一廂情願或短暫的迷戀。"
            ]
        },
        "reversed": {
          "summary": "你從幻想中清醒過來，開始以務實的態度面對愛情，並做出了明確的選擇。",
          "details": [
              "你不再被花言巧語所迷惑，而是更看重一個人的真實品質和行動。",
              "在眾多選擇中，你終於明確了自己的心意，並決定專注於一段關係。",
              "你意識到完美的愛情並不存在，並開始珍惜和經營眼前真實的幸福。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你面臨著太多的職業選擇和機會，但很多都可能是不切實際的幻想。",
          "details": [
              "你是否有很多「如果我去做…就一定會成功」的想法，卻從未付諸行動？",
              "小心那些聽起來好得令人難以置信的商業機會，它們很可能是一個陷阱。",
              "你需要進行詳細的市場調查和自我評估，而不是僅僅憑空想像。將你的注意力集中在一個最可行的目標上。"
            ]
        },
        "reversed": {
          "summary": "你不再好高騖遠，而是選擇了一個明確、可行的職業目標，並開始專注地努力。",
          "details": [
              "你排除了所有不切實際的選項，找到了最適合你的那條路。",
              "你不再三心二意，而是將所有的精力都投入到一個項目中，這將大大提高你的成功率。",
              "清晰的目標和務實的態度是你現階段成功的關鍵。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你的社交生活可能充滿了表面功夫，或者你對朋友抱有不切實際的期望。",
          "details": [
              "你可能有很多網路上的「朋友」，但卻缺乏一個可以深入交心的知己。",
              "你是否對朋友有過高的期望，當他們達不到時就感到失望？",
              "你需要分清哪些是真正的友誼，哪些只是虛假的社交應酬。"
            ]
        },
        "reversed": {
          "summary": "你開始專注於經營幾段真誠、深入的友誼，而不是追求數量的多寡。",
          "details": [
              "你意識到朋友在精不在多，並開始花更多的時間與你真正的朋友在一起。",
              "你不再對朋友抱有不切實際的幻想，而是學會了接納他們的本來面目。",
              "你的一個選擇（例如，決定與誰深交）將會鞏固一段重要的友誼。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你可能被網路上各種相互矛盾的健康資訊所迷惑，不知道該相信哪一個。",
          "details": [
              "你是否嘗試了各種神奇的減肥方法或保健品，卻沒有一個真正有效？",
              "你需要警惕那些誇大其詞的健康承諾，它們往往是不切實際的。",
              "與其在眾多選擇中迷失，不如諮詢專業醫生或營養師，制定一個簡單、可行的健康計劃。"
            ]
        },
        "reversed": {
          "summary": "你不再聽信偏方，而是選擇了一種經過驗證的、科學的健康方法，並堅持下去。",
          "details": [
              "你找到了適合自己的飲食和運動方式，不再被五花八門的選擇所困擾。",
              "你專注於一個明確的健康目標，並為之付諸行動。",
              "清晰和專注是你改善健康狀況的關鍵。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你沉浸在白日夢和幻想中，有很多夢想，但缺乏實現它們的行動力。",
          "details": [
              "你是否花費了大量的時間在幻想未來，而不是為之努力？",
              "你需要學會將你的創造力導向一個具體的目標，否則它只會變成不切實際的空想。",
              "這張牌提醒你，選擇太多等於沒有選擇。你需要做出決定，並開始行動。"
            ]
        },
        "reversed": {
          "summary": "你從幻想中醒來，將你的創造力付諸實踐，並選擇了一個明確的人生方向。",
          "details": [
              "你不再只是夢想家，而是成為了一個實幹家。",
              "你找到了自己真正想要的，並願意為此放棄其他所有的可能性。",
              "這個決定可能很困難，但它會讓你的人生道路變得前所未有的清晰和充滿力量。"
            ]
        }
      }
    }
  },
  {
    "id": "eight_of_cups",
    "name": "聖杯八",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你可能會離開一段已經失去熱情的關係，或者意識到自己需要獨處的時間來整理思緒。",
          "details": [
              "你是否覺得這段關係已經無法再滿足你的情感需求？",
              "你可能需要暫時或永久地離開，以尋找真正能讓你快樂的愛情。",
              "這不是一個輕率的決定，而是一個經過深思熟慮的選擇，為了追求更真實的自我和幸福。"
            ]
        },
        "reversed": {
          "summary": "你意識到離開並不是唯一的解決方案，或者你已經準備好重新開始一段新的戀情。",
          "details": [
              "你可能決定給這段關係第二次機會，並願意為之付出努力。",
              "或者，你已經從過去的傷痛中走出來，準備好迎接新的愛情。",
              "你學會了如何在不完美的關係中找到滿足感，或者如何獨自生活而不感到孤獨。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你可能會辭去一份穩定的工作，去追求更有意義的職業生涯，或者開始自己的事業。",
          "details": [
              "你是否覺得現在的工作毫無挑戰性，或者與你的價值觀不符？",
              "這張牌鼓勵你聽從內心的聲音，即使這意味著要冒一定的風險。",
              "你需要的勇氣和決心已經在你內心深處，現在是時候採取行動了。"
            ]
        },
        "reversed": {
          "summary": "你決定留在目前的工作崗位上，但會尋找新的方式來獲得滿足感。",
          "details": [
              "你可能意識到，與其盲目地追求改變，不如在現有的環境中創造價值。",
              "你開始尋找工作與生活的平衡，或者在工作中找到新的意義。",
              "這是一個重新評估你的職業目標和優先事項的時期。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你可能會與某些朋友或社交圈保持距離，因為你覺得他們不再與你志同道合。",
          "details": [
              "你是否覺得與某些朋友在一起時，你無法做真實的自己？",
              "這張牌鼓勵你遠離那些消耗你能量的人，去尋找真正理解和支持你的朋友。",
              "獨處並不可怕，它給了你重新認識自己、傾聽內心聲音的機會。"
            ]
        },
        "reversed": {
          "summary": "你開始重新與老朋友聯繫，或者找到了一個新的、更適合你的社交圈。",
          "details": [
              "你可能意識到，你之前離開的朋友或團體對你來說仍然很重要。",
              "你學會了在獨處和社交之間找到平衡。",
              "你現在的人際關係更加真誠，因為你不再害怕展現真實的自我。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你可能需要離開當前的治療方案或生活習慣，去尋找更適合你的健康方式。",
          "details": [
              "你是否覺得目前的治療方法對你無效，或者甚至讓你的情況變得更糟？",
              "這張牌鼓勵你傾聽你的身體，並尋找替代的治療方法。",
              "有時候，離開舒適區，嘗試新的健康習慣，是邁向康復的第一步。"
            ]
        },
        "reversed": {
          "summary": "你開始看到健康狀況的改善，或者找到了一種更適合你的治療方法。",
          "details": [
              "你可能已經放棄了一些不健康的習慣，並開始感受到積極的變化。",
              "你學會了如何照顧自己的身體和心靈，並找到了內心的平靜。",
              "你的健康之旅可能充滿挑戰，但你已經走上了正確的道路。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在經歷一段深刻的內在轉變，需要離開過去的信念和模式，去追尋更高的真理。",
          "details": [
              "你是否覺得自己被困在一個不再適合你的角色或身份中？",
              "這張牌象徵著一段精神上的朝聖之旅，你將獨自面對你的恐懼和慾望。",
              "這是一個艱難但必要的過程，它將引領你走向更真實、更充實的生活。"
            ]
        },
        "reversed": {
          "summary": "你已經完成了內在的轉變，並準備好以一個全新的視角來看待世界。",
          "details": [
              "你不再被過去的創傷或限制性信念所束縛。",
              "你學會了如何與自己的陰暗面共處，並從中汲取力量。",
              "你現在擁有了更清晰的自我認知，並準備好迎接人生的下一個階段。"
            ]
        }
      }
    }
  },
  {
    "id": "nine_of_cups",
    "name": "聖杯九",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你的感情生活非常美滿，你和伴侶之間的關係充滿了愛、理解和滿足。",
          "details": [
              "這是一段充滿浪漫和激情的時期，你們彼此深愛著對方。",
              "單身者可能會遇到一個符合你所有期待的對象，你們之間有強烈的吸引力。",
              "你們的關係建立在相互尊重和理解的基礎上，這讓你們都感到非常幸福和滿足。"
            ]
        },
        "reversed": {
          "summary": "你可能對愛情有過高的期望，或者過於注重物質享受而忽略了情感上的交流。",
          "details": [
              "你是否在尋找一個「完美」的伴侶，而忽略了現實中的人？",
              "你可能過於關注伴侶的外在條件，而忽略了內在品質。",
              "這張牌提醒你，真正的幸福來自於內心的滿足，而不是外在的條件。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你在事業上取得了巨大的成功，你的努力得到了回報，你對自己的工作感到非常滿意。",
          "details": [
              "你可能會獲得晉升、加薪，或者得到一個你一直夢寐以求的工作機會。",
              "你的才華和努力得到了認可，你為自己感到驕傲。",
              "這是一個享受成功果實的時期，你應該為自己慶祝。"
            ]
        },
        "reversed": {
          "summary": "你可能對自己的職業成就感到不滿足，或者過於追求物質上的成功而忽略了內心的空虛。",
          "details": [
              "你是否達到了所有的職業目標，卻仍然感到空虛？",
              "你可能需要重新評估你的優先事項，並尋找能帶給你真正滿足感的工作。",
              "這張牌提醒你，成功不僅僅是金錢和地位，更是內心的平靜和滿足。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你與朋友和家人的關係非常和諧，你感到被愛和支持包圍。",
          "details": [
              "你可能會收到來自朋友或家人的好消息，或者你們之間的關係會更加親密。",
              "你是一個慷慨大方的人，總是願意幫助他人，這讓你的人際關係非常融洽。",
              "這是一個與親朋好友共度美好時光的絕佳時期。"
            ]
        },
        "reversed": {
          "summary": "你可能過於以自我為中心，或者過於追求享樂而忽略了朋友的感受。",
          "details": [
              "你是否只顧著自己的快樂，而忽略了朋友的需要？",
              "你可能需要學會更加體貼和關心他人，才能建立更健康的人際關係。",
              "這張牌提醒你，真正的快樂來自於與他人分享，而不僅僅是自我滿足。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身體和心靈都處於一個非常健康的狀態，你感到充滿活力和能量。",
          "details": [
              "你可能已經養成了健康的生活習慣，這讓你的身心都感到非常舒適。",
              "你對自己的身體感到滿意，並且享受著健康帶來的好處。",
              "這是一個繼續保持健康生活方式的絕佳時期。"
            ]
        },
        "reversed": {
          "summary": "你可能過度放縱自己，沉迷於享樂而忽略了健康。",
          "details": [
              "你是否過度飲食、飲酒或沉迷於其他不良習慣？",
              "你可能需要重新審視你的生活方式，並做出一些積極的改變。",
              "這張牌提醒你，健康是最重要的財富，你應該好好照顧自己。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你對自己和生活感到非常滿意，你已經學會了如何享受當下，並為自己所擁有的一切感到感恩。",
          "details": [
              "你已經實現了許多目標，並且對自己的成就感到自豪。",
              "你是一個樂觀積極的人，總是能看到生活中美好的一面。",
              "這是一個自我接納和內心平和的時期，你應該好好享受它。"
            ]
        },
        "reversed": {
          "summary": "你可能對自己要求過高，或者過於追求完美而忽略了生活中的美好。",
          "details": [
              "你是否總是覺得自己不夠好，或者擁有的還不夠多？",
              "你可能需要學會更加接納自己，並欣賞自己所擁有的一切。",
              "這張牌提醒你，幸福不是目的地，而是一種心態。"
            ]
        }
      }
    }
  },
  {
    "id": "ten_of_cups",
    "name": "聖杯十",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你和伴侶之間的關係達到了和諧美滿的狀態，你們彼此深愛著對方，並對未來充滿了共同的夢想。",
          "details": [
              "你們的愛情建立在深厚的感情基礎上，彼此信任、尊重和理解。",
              "這張牌可能預示著訂婚、結婚或組建家庭的好消息。",
              "你們的關係不僅僅是兩個人的結合，更是兩個家庭的融合，充滿了愛與支持。"
            ]
        },
        "reversed": {
          "summary": "你可能對家庭生活或伴侶關係感到不滿，或者你們之間存在著一些未解決的問題。",
          "details": [
              "你們可能因為家庭瑣事或價值觀的差異而產生矛盾。",
              "你可能需要重新審視你對愛情的期望，並學會接納伴侶的不完美。",
              "這張牌提醒你，真正的幸福來自於內心的滿足，而不是外在的條件。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你對目前的工作環境和團隊氛圍感到非常滿意，你與同事之間的關係融洽，工作充滿樂趣。",
          "details": [
              "你可能會在工作中結識一些志同道合的朋友，你們彼此支持，共同成長。",
              "這張牌也預示著一個和諧的工作環境，你的努力會得到認可和回報。",
              "這是一個適合團隊合作、共創佳績的時期。"
            ]
        },
        "reversed": {
          "summary": "你可能對目前的工作環境感到不滿，或者與同事之間的關係緊張。",
          "details": [
              "你可能覺得自己與團隊格格不入，或者對公司的價值觀產生質疑。",
              "這張牌提醒你，工作不僅僅是為了謀生，更是為了實現自我價值。",
              "你可能需要考慮換一個更適合你的工作環境。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你與家人和朋友之間的關係非常融洽，你感到被愛和支持包圍。",
          "details": [
              "你可能會與家人共度一段美好的時光，或者與老朋友重聚。",
              "這張牌也預示著家庭聚會、慶祝活動或團圓的喜悅。",
              "你是一個重視家庭和友情的人，你的人際關係充滿了溫暖和愛。"
            ]
        },
        "reversed": {
          "summary": "你可能與家人或朋友之間存在一些誤會或矛盾，或者你感到孤獨和被孤立。",
          "details": [
              "你可能需要主動修復與親友之間的關係，或者學會獨立面對生活的挑戰。",
              "這張牌提醒你，家庭和友情是人生中最重要的財富，值得你用心經營。",
              "你可以嘗試與親友進行坦誠的溝通，表達你的感受和需求。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身體和心靈都處於一個非常健康的狀態，你感到充滿活力和能量。",
          "details": [
              "你可能已經養成了健康的生活習慣，這讓你的身心都感到非常舒適。",
              "你對自己的身體感到滿意，並且享受著健康帶來的好處。",
              "這是一個繼續保持健康生活方式的絕佳時期。"
            ]
        },
        "reversed": {
          "summary": "你可能因為家庭或情感問題而影響到健康，或者你忽視了自己的身體需求。",
          "details": [
              "你可能需要關注自己的情緒健康，並學會釋放壓力。",
              "這張牌提醒你，健康是最重要的財富，你應該好好照顧自己。",
              "你可以嘗試一些放鬆身心的活動，例如瑜伽、冥想或散步。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你對自己和生活感到非常滿意，你已經找到了內心的平靜和滿足。",
          "details": [
              "你學會了接納自己的一切，包括優點和缺點。",
              "你對未來充滿了希望和信心，你知道自己有能力創造幸福的生活。",
              "這是一個感恩和慶祝的時刻，你應該為自己感到驕傲。"
            ]
        },
        "reversed": {
          "summary": "你可能對自己的生活感到不滿，或者你還沒有找到真正的幸福。",
          "details": [
              "你可能需要重新審視自己的價值觀和人生目標。",
              "這張牌提醒你，幸福不是外在的，而是來自於內心的滿足。",
              "你可以嘗試一些新的活動或愛好，探索自己的興趣和熱情。"
            ]
        }
      }
    }
  },
  {
    "id": "page_of_cups",
    "name": "聖杯侍者",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你可能會遇到一個溫柔、體貼的對象，他/她對你充滿了愛意和好奇心。",
          "details": [
              "這是一段純真而美好的感情，你們彼此吸引，願意探索愛情的可能性。",
              "單身者可能會收到一個意外的告白，或者遇到一個讓你心動的人。",
              "你們的關係建立在真誠和信任的基礎上，充滿了浪漫和甜蜜。"
            ]
        },
        "reversed": {
          "summary": "你可能對愛情抱有不切實際的幻想，或者過於情緒化，容易受到傷害。",
          "details": [
              "你是否對伴侶有過高的期望，或者對愛情過於理想化？",
              "你可能需要學會更加理性地面對感情，而不是被情緒左右。",
              "這張牌提醒你，愛情需要雙方的付出和理解，而不僅僅是浪漫的幻想。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你可能會收到一個新的工作機會或創意項目的邀請，這將激發你的熱情和創造力。",
          "details": [
              "這是一個適合學習新技能或開展新項目的時期，你的直覺會幫助你做出正確的決定。",
              "你可能會遇到一位年輕有為的導師或合作夥伴，他/她會給你帶來靈感。",
              "保持開放的心態，接受新的挑戰和機會。"
            ]
        },
        "reversed": {
          "summary": "你可能缺乏動力或方向感，對工作感到迷茫或不安。",
          "details": [
              "你是否對自己的職業生涯感到不確定，或者缺乏自信？",
              "你可能需要重新點燃對工作的熱情，或者尋找一個更符合你興趣的領域。",
              "這張牌提醒你，相信自己內心的聲音，勇敢追求夢想。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你與朋友之間的關係充滿了溫暖和關懷，你們願意傾聽彼此的心聲。",
          "details": [
              "你可能會結識一位新朋友，他/她真誠而富有同情心。",
              "這是一個適合與朋友分享你的感受和夢想的時期，他們會給你支持和鼓勵。",
              "你的人際關係將因為你的真誠和善良而更加深厚。"
            ]
        },
        "reversed": {
          "summary": "你可能過於敏感或情緒化，容易因為小事而與朋友產生誤會。",
          "details": [
              "你是否因為過度解讀他人的話語而感到受傷？",
              "你可能需要學會更加理性地面對人際關係，而不是被情緒左右。",
              "這張牌提醒你，溝通是解決問題的關鍵，不要害怕表達自己的感受。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身體和心靈都處於一個非常健康的狀態，你感到充滿活力和創造力。",
          "details": [
              "這是一個適合嘗試新的運動或健康習慣的時期，你的身體會對此做出積極的反應。",
              "你可能會對藝術、音樂或寫作等創造性活動產生濃厚的興趣，這對你的心理健康非常有益。",
              "保持積極樂觀的心態，享受生活的美好。"
            ]
        },
        "reversed": {
          "summary": "你可能因為情緒波動或壓力而感到身體不適，需要關注自己的心理健康。",
          "details": [
              "你是否因為過度擔心或焦慮而影響到身體健康？",
              "你可能需要學會放鬆自己，並找到適合自己的減壓方式。",
              "這張牌提醒你，身心健康同樣重要，不要忽視任何一個方面。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在經歷一段內在成長的時期，你的直覺和創造力將幫助你找到真正的自我。",
          "details": [
              "這是一個適合探索自己內心世界的時期，你可以通過日記、冥想或藝術創作來表達自己。",
              "你可能會有一些靈感或直覺，這些都將幫助你更好地理解自己的需求和願望。",
              "保持開放的心態，接受來自內心的指引。"
            ]
        },
        "reversed": {
          "summary": "你可能對自己缺乏信心，或者過於依賴他人的意見，而忽略了自己內心的聲音。",
          "details": [
              "你是否經常懷疑自己的決定，或者害怕表達真實的想法？",
              "你可能需要學會更加信任自己，並勇敢地面對內心的恐懼。",
              "這張牌提醒你，真正的智慧來自於內心的平靜和自信。"
            ]
        }
      }
    }
  },
  {
    "id": "knight_of_cups",
    "name": "聖杯騎士",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你可能會遇到一位浪漫、溫柔且充滿魅力的對象，他/她會用真誠和熱情打動你的心。",
          "details": [
              "這是一段充滿激情和浪漫的關係，你們彼此吸引，願意為愛付出一切。",
              "單身者可能會遇到一位讓你心動的對象，他/她會用甜言蜜語和浪漫的舉動贏得你的心。",
              "你們的關係充滿了情感上的共鳴和深層的連結。"
            ]
        },
        "reversed": {
          "summary": "你可能會遇到一位花言巧語但缺乏真誠的對象，或者你對愛情抱有不切實際的幻想。",
          "details": [
              "你是否被對方的外表或甜言蜜語所迷惑，而忽略了現實中的問題？",
              "你可能需要更加理性地面對感情，不要被一時的激情沖昏頭腦。",
              "這張牌提醒你，真愛需要時間和考驗，不要急於投入一段關係。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你可能會收到一個充滿創意和靈感的項目機會，或者你的才華會得到認可。",
          "details": [
              "這是一個適合發揮你的創造力和想像力的時期，你的直覺會幫助你找到新的方向。",
              "你可能會遇到一位賞識你的導師或合作夥伴，他/她會給你帶來靈感和支持。",
              "保持開放的心態，接受新的挑戰和機會。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為情緒化或缺乏行動力而錯失機會，或者對工作感到迷茫。",
          "details": [
              "你是否因為過於理想化或缺乏計劃而導致項目進展不順？",
              "你可能需要更加務實地面對工作，並學會將創意轉化為實際行動。",
              "這張牌提醒你，成功需要努力和堅持，而不僅僅是靈感。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你與朋友之間的關係充滿了情感上的支持和理解，你們願意彼此分享內心的感受。",
          "details": [
              "你可能會結識一位新朋友，他/她溫柔體貼，善解人意。",
              "這是一個適合與朋友深入交流的時期，你們會因為彼此的信任而更加親密。",
              "你的人際關係將因為你的真誠和關懷而更加深厚。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為過於情緒化或敏感而與朋友產生誤會，或者感到孤獨和被誤解。",
          "details": [
              "你是否因為過度解讀他人的話語而感到受傷？",
              "你可能需要學會更加理性地面對人際關係，而不是被情緒左右。",
              "這張牌提醒你，溝通是解決問題的關鍵，不要害怕表達自己的感受。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身體和心靈都處於一個和諧的狀態，你感到充滿活力和創造力。",
          "details": [
              "這是一個適合嘗試新的運動或健康習慣的時期，你的身體會對此做出積極的反應。",
              "你可能會對藝術、音樂或寫作等創造性活動產生濃厚的興趣，這對你的心理健康非常有益。",
              "保持積極樂觀的心態，享受生活的美好。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為情緒波動或壓力而感到身體不適，需要關注自己的心理健康。",
          "details": [
              "你是否因為過度擔心或焦慮而影響到身體健康？",
              "你可能需要學會放鬆自己，並找到適合自己的減壓方式。",
              "這張牌提醒你，身心健康同樣重要，不要忽視任何一個方面。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在經歷一段內在成長的時期，你的直覺和創造力將幫助你找到真正的自我。",
          "details": [
              "這是一個適合探索自己內心世界的時期，你可以通過日記、冥想或藝術創作來表達自己。",
              "你可能會有一些靈感或直覺，這些都將幫助你更好地理解自己的需求和願望。",
              "保持開放的心態，接受來自內心的指引。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為缺乏自信或過於依賴他人的意見而迷失自我。",
          "details": [
              "你是否經常懷疑自己的決定，或者害怕表達真實的想法？",
              "你可能需要學會更加信任自己，並勇敢地面對內心的恐懼。",
              "這張牌提醒你，真正的智慧來自於內心的平靜和自信。"
            ]
        }
      }
    }
  },
  {
    "id": "queen_of_cups",
    "name": "聖杯皇后",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你與伴侶之間的關係充滿了深厚的情感和理解，你們彼此支持，心靈相通。",
          "details": [
              "這是一段充滿愛與和諧的關係，你們能夠感受到對方的情感需求並給予回應。",
              "單身者可能會遇到一位溫柔、體貼且富有同情心的對象，他/她會成為你心靈的伴侶。",
              "你們的關係建立在真誠和信任的基礎上，充滿了溫暖和安全感。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為過於情緒化或依賴性強而影響到感情，或者遇到一位情感不穩定的對象。",
          "details": [
              "你是否因為過度解讀伴侶的行為而感到不安？",
              "你可能需要學會更加獨立，並學會在關係中保持平衡。",
              "這張牌提醒你，健康的愛情需要雙方的付出和空間。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你在工作中展現出極強的同理心和直覺，能夠理解並滿足他人的需求。",
          "details": [
              "這是一個適合從事與人相關的工作的時期，例如諮詢、教育或藝術創作。",
              "你可能會因為你的敏感度和創造力而獲得同事和上司的讚賞。",
              "保持開放的心態，你的直覺會幫助你做出正確的決策。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為過於情緒化或缺乏自信而影響到工作表現。",
          "details": [
              "你是否因為害怕失敗而不敢表達自己的想法？",
              "你可能需要學會更加理性地面對挑戰，並相信自己的能力。",
              "這張牌提醒你，成功來自於內心的平靜和自信。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你與朋友和家人之間的關係非常融洽，你願意傾聽並支持他們。",
          "details": [
              "你可能會成為朋友們的傾訴對象，因為你善解人意且富有同情心。",
              "這是一個適合與親友共度美好時光的時期，你們的關係會因為真誠的交流而更加深厚。",
              "你的溫柔和關懷會讓身邊的人感到被愛和重視。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為過於敏感或情緒化而與他人產生誤會。",
          "details": [
              "你是否因為過度解讀他人的話語而感到受傷？",
              "你可能需要學會更加理性地面對人際關係，而不是被情緒左右。",
              "這張牌提醒你，溝通是解決問題的關鍵。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身體和心靈處於一個非常和諧的狀態，你感到平靜且充滿活力。",
          "details": [
              "這是一個適合關注情緒健康的時期，你可以通過冥想、瑜伽或藝術創作來放鬆身心。",
              "你可能會對自然療法或心理學產生興趣，這對你的整體健康非常有益。",
              "保持積極的心態，享受生活的美好。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為情緒波動或壓力而感到身體不適，需要關注心理健康。",
          "details": [
              "你是否因為過度擔心或焦慮而影響到身體健康？",
              "你可能需要學會放鬆自己，並找到適合自己的減壓方式。",
              "這張牌提醒你，身心健康同樣重要，不要忽視任何一個方面。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在經歷一段深刻的內在成長，你的直覺和情感智慧將幫助你找到內心的平靜。",
          "details": [
              "這是一個適合探索自己內心世界的時期，你可以通過日記、冥想或藝術創作來表達自己。",
              "你可能會有一些靈感或直覺，這些都將幫助你更好地理解自己的需求和願望。",
              "保持開放的心態，接受來自內心的指引。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為缺乏自信或過於依賴他人的意見而迷失自我。",
          "details": [
              "你是否經常懷疑自己的決定，或者害怕表達真實的想法？",
              "你可能需要學會更加信任自己，並勇敢地面對內心的恐懼。",
              "這張牌提醒你，真正的智慧來自於內心的平靜和自信。"
            ]
        }
      }
    }
  },
  {
    "id": "king_of_cups",
    "name": "聖杯國王",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你與伴侶之間的關係充滿了成熟的情感和深厚的信任，你們彼此支持，共同成長。",
          "details": [
              "這是一段穩定且充滿安全感的關係，你們能夠理性地面對問題並找到解決方案。",
              "單身者可能會遇到一位成熟、穩重且富有同情心的對象，他/她會成為你的精神支柱。",
              "你們的關係建立在互相尊重和理解的基礎上，充滿了溫暖和安全感。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為過於理性或壓抑情感而影響到關係，或者遇到一位情感冷漠的對象。",
          "details": [
              "你是否因為害怕受傷而不敢表達真實的情感？",
              "你可能需要學會更加開放地表達自己的感受，並接納伴侶的情感需求。",
              "這張牌提醒你，愛情需要情感的流動和真誠的溝通。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你在工作中展現出極強的情緒智慧和領導力，能夠冷靜地面對挑戰並做出明智的決策。",
          "details": [
              "這是一個適合擔任領導角色的時期，你能夠平衡理性與情感，贏得同事和下屬的尊重。",
              "你可能會因為你的冷靜和智慧而獲得晉升或新的職業機會。",
              "保持謙遜和同理心，這將幫助你在職場中建立長期的成功。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為情緒波動或缺乏自信而影響到工作表現，或者感到職業上的迷茫。",
          "details": [
              "你是否因為過度擔心失敗而不敢承擔責任？",
              "你可能需要學會信任自己的能力，並冷靜地面對挑戰。",
              "這張牌提醒你，真正的領導力來自於內心的平靜和自信。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你與朋友和家人之間的關係非常穩固，你願意在他們需要時提供支持和建議。",
          "details": [
              "你可能會成為朋友們的依靠，因為你善於傾聽並給予建設性的意見。",
              "這是一個適合與親友分享生活經驗和智慧的時期，你們的關係會因為真誠的交流而更加深厚。",
              "你的成熟和穩重會讓身邊的人感到安心和被理解。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為過於理性或情感封閉而與他人產生距離。",
          "details": [
              "你是否因為害怕被傷害而不敢敞開心扉？",
              "你可能需要學會更加開放地表達自己的情感，並接納他人的關心。",
              "這張牌提醒你，人際關係需要情感的交流和真誠的互動。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身體和心靈處於一個平衡且健康的狀態，你能夠冷靜地面對壓力和挑戰。",
          "details": [
              "這是一個適合關注心理健康的時期，你可以通過冥想、運動或與親友交流來保持情緒的穩定。",
              "你可能會對心理學或靈性成長產生興趣，這對你的整體健康非常有益。",
              "保持積極的心態，享受生活的平靜與和諧。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為情緒壓抑或壓力過大而影響到身體健康。",
          "details": [
              "你是否因為過度控制情緒而感到身心俱疲？",
              "你可能需要學會釋放情感，並找到適合自己的減壓方式。",
              "這張牌提醒你，身心健康同樣重要，不要忽視任何一個方面。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在經歷一段深刻的內在成長，你的情感智慧和直覺將幫助你找到內心的平靜。",
          "details": [
              "這是一個適合反思和自我提升的時期，你可以通過閱讀、冥想或與導師交流來深化自我認識。",
              "你可能會有一些靈感或洞見，這些都將幫助你更好地理解自己的情感需求和人生目標。",
              "保持開放的心態，接受來自內心的指引。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為過於理性或壓抑情感而忽略內心的聲音。",
          "details": [
              "你是否因為害怕面對真實的感受而選擇逃避？",
              "你可能需要學會接納自己的情感，並勇敢地面對內心的恐懼。",
              "這張牌提醒你，真正的智慧來自於內心的平靜和情感的流動。"
            ]
        }
      }
    }
  },
  {
    "id": "ace_of_swords",
    "name": "寶劍一",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你對愛情有了新的理解和洞見，這可能是一段關係的開始，或者現有關係中的一個重要轉折點。",
          "details": [
              "你可能會遇到一位與你思想契合的對象，你們的交流充滿智慧和深度。",
              "這是一個適合坦誠溝通的時期，你的清晰思維將幫助你解決關係中的問題。",
              "單身者可能會因為一個突然的領悟而改變對愛情的看法。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為思維混亂或溝通不暢而影響到感情，或者遇到一位言辭尖銳的對象。",
          "details": [
              "你是否因為過度分析而忽略了內心的感受？",
              "你可能需要學會在理性與情感之間找到平衡。",
              "這張牌提醒你，真誠的溝通需要同時傾聽頭腦和心靈的聲音。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你將迎來一個突破性的想法或機會，這可能會改變你的職業軌跡。",
          "details": [
              "這是一個適合開展新項目或學習新技能的時期，你的思維清晰且具有洞察力。",
              "你可能會因為一個創新的想法而獲得認可或晉升。",
              "保持開放的態度，新的機會可能來自意想不到的地方。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為思維混亂或決策失誤而影響到工作表現。",
          "details": [
              "你是否因為資訊過載而難以做出決定？",
              "你可能需要暫時停下來，整理思緒，避免倉促行動。",
              "這張牌提醒你，清晰的思維是成功的關鍵。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你與朋友或家人之間的溝通變得更加直接和真誠，這將幫助你們解決長期的誤會。",
          "details": [
              "這是一個適合進行深入對話的時期，你的理性分析能力將幫助你理解他人的觀點。",
              "你可能會成為朋友們的顧問，因為你能夠客觀地看待問題。",
              "保持開放的態度，接受不同的意見和建議。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為言辭尖銳或固執己見而與他人產生衝突。",
          "details": [
              "你是否因為過於堅持自己的觀點而忽略了別人的感受？",
              "你可能需要學會更加溫和地表達自己的想法。",
              "這張牌提醒你，有效的溝通需要同理心和耐心。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的思維清晰，精神狀態良好，這是一個適合制定健康計劃的時期。",
          "details": [
              "你可能會對心理健康或大腦保健產生興趣，例如通過冥想或閱讀來提升思維能力。",
              "保持積極的心態，清晰的思維將幫助你做出對健康有益的決定。",
              "這是一個適合學習新知識或技能的時期，你的大腦處於最佳狀態。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為思維混亂或壓力過大而影響到身體健康。",
          "details": [
              "你是否因為過度思考而感到焦慮或失眠？",
              "你可能需要學會放鬆身心，例如通過運動或冥想來緩解壓力。",
              "這張牌提醒你，身心健康同樣重要，不要忽視任何一個方面。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在經歷一個思想上的覺醒，新的見解和靈感將幫助你突破舊有的思維模式。",
          "details": [
              "這是一個適合自我反省和學習的時期，你的直覺和邏輯思維將達到完美的平衡。",
              "你可能會有一些突破性的想法，這些將幫助你更清楚地認識自己和世界。",
              "保持開放的態度，接受新的觀點和可能性。"
            ]
        },
        "reversed": {
          "summary": "你可能會因為思維混亂或自我懷疑而影響到自我成長。",
          "details": [
              "你是否因為過度分析而陷入自我懷疑？",
              "你可能需要學會信任自己的直覺，並勇敢地面對內心的恐懼。",
              "這張牌提醒你，真正的智慧來自於內心的平靜和清晰的思維。"
            ]
        }
      }
    }
  },
  {
    "id": "two_of_swords",
    "name": "寶劍二",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你正面臨一個情感上的抉擇，需要冷靜思考並傾聽內心的聲音。",
          "details": [
              "這可能是一段關係中的關鍵時刻，你需要權衡利弊並做出決定。",
              "單身者可能因為猶豫不決而錯過機會，或者對感情持觀望態度。",
              "給自己一些時間和空間，避免在情緒波動時做出衝動的決定。"
            ]
        },
        "reversed": {
          "summary": "你可能因為逃避問題或拒絕面對現實而陷入情感困境。",
          "details": [
              "你是否因為害怕受傷而選擇逃避感情的真相？",
              "這張牌提醒你，拖延只會讓問題變得更加複雜。",
              "試著敞開心扉，與伴侶或信任的朋友分享你的感受。"
            ]
        }
      },
      "career": {
        "upright": {
          "summary": "你在工作中面臨一個需要冷靜分析和理性判斷的抉擇。",
          "details": [
              "這可能是一個關於職業方向或項目選擇的決定，需要你權衡利弊。",
              "避免被情緒左右，試著列出選項的優缺點來幫助決策。",
              "如果感到困惑，尋求客觀的建議可能會有所幫助。"
            ]
        },
        "reversed": {
          "summary": "你可能因為優柔寡斷或資訊不足而陷入職業瓶頸。",
          "details": [
              "你是否因為害怕失敗而遲遲不敢做出決定？",
              "這張牌提醒你，有時候不選擇也是一種選擇，但可能會錯失機會。",
              "試著收集更多資訊，並設定一個決策的最後期限。"
            ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你與他人之間的關係可能處於一種微妙的平衡狀態，需要謹慎處理。",
          "details": [
              "這是一個需要冷靜溝通的時期，避免因誤解而產生衝突。",
              "如果你在友誼或家庭關係中感到為難，試著站在對方的角度思考。",
              "保持開放的態度，但也要保護自己的界限。"
            ]
        },
        "reversed": {
          "summary": "你可能因為逃避溝通或隱藏真實想法而與他人產生隔閡。",
          "details": [
              "你是否因為害怕衝突而選擇沉默？",
              "這張牌提醒你，真正的和諧來自於坦誠的對話。",
              "試著表達你的感受，即使這可能讓你感到不安。"
            ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身心狀態可能需要更多的平衡和調適。",
          "details": [
              "這是一個關注心理健康的時期，特別是壓力和焦慮管理。",
              "試著找到適合你的放鬆方式，例如冥想、瑜伽或散步。",
              "如果感到不適，不要猶豫尋求專業的醫療建議。"
            ]
        },
        "reversed": {
          "summary": "你可能因為忽視身體或情緒的警訊而導致健康問題。",
          "details": [
              "你是否因為忙碌或逃避而忽略了身體的不適？",
              "這張牌提醒你，健康是最重要的財富。",
              "試著調整生活方式，並給自己足夠的休息時間。"
            ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正處於一個需要內省和自我反思的階段。",
          "details": [
              "這是一個探索內心衝突和矛盾的時期，試著理解自己的真實需求。",
              "你可能會發現，某些長期的困惑源於內心的抗拒或恐懼。",
              "保持耐心，給自己時間去釐清思緒。"
            ]
        },
        "reversed": {
          "summary": "你可能因為逃避自我反省而陷入混亂或停滯。",
          "details": [
              "你是否因為害怕面對內心的真相而選擇分心或逃避？",
              "這張牌提醒你，真正的成長來自於接納自己的全部。",
              "試著寫日記或與信任的人交流，幫助你理清思緒。"
            ]
        }
      }
    }
  },
  {
    "id": "three_of_swords",
    "name": "寶劍三",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你可能正在經歷感情上的痛苦或失望，這可能源於爭吵、背叛或分離。",
          "details": [
            "這是一段需要面對情感創傷的時期，允許自己感受這些情緒是療癒的開始。",
            "如果你正在經歷分手或關係中的困難，請記住這些痛苦是暫時的。",
            "尋求朋友、家人或專業人士的支持可以幫助你度過這個艱難時期。"
        ]
        },
        "reversed": {
          "summary": "你正在從過去的情感創傷中恢復，傷口開始癒合。",
          "details": [
            "雖然傷痛可能仍然存在，但你已經開始看到希望的曙光。",
            "這是一個原諒和釋懷的時期，無論是原諒他人還是自己。",
            "讓時間來治癒傷口，並從這次經歷中學習和成長。"
        ]
        }
      },
      "career": {
        "upright": {
          "summary": "你可能會面臨工作上的挫折、批評或失望。",
          "details": [
            "這可能是一個項目失敗、錯失晉升機會或與同事發生衝突的時期。",
            "雖然這些經歷令人痛苦，但它們也提供了寶貴的學習機會。",
            "保持專業態度，從中吸取教訓，並為未來的成功做準備。"
        ]
        },
        "reversed": {
          "summary": "你正在從工作上的挫折中恢復，並開始看到新的可能性。",
          "details": [
            "雖然過去的失望可能仍然影響著你，但你已經開始重建信心。",
            "這是一個重新評估職業目標和優先事項的好時機。",
            "記住，每一次挫折都是成長的機會。"
        ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你可能會經歷與親友之間的誤會、爭吵或疏遠。",
          "details": [
            "這是一個需要誠實溝通和理解的時期。",
            "如果你傷害了他人，請勇於道歉；如果你被傷害，請嘗試原諒。",
            "真正的關係經得起考驗，這次經歷可能會讓你們的關係更加牢固。"
        ]
        },
        "reversed": {
          "summary": "你正在修復受損的關係，並從中學習和成長。",
          "details": [
            "雖然傷口可能尚未完全癒合，但你們已經開始重建信任。",
            "這是一個學習更健康溝通方式的機會。",
            "記住，脆弱和真誠是建立深厚關係的基礎。"
        ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身體可能正在反映你內心的痛苦或壓力。",
          "details": [
            "這可能表現為頭痛、失眠或免疫力下降等症狀。",
            "除了關注身體健康，也要照顧好自己的情緒和心理健康。",
            "考慮尋求專業幫助，如諮詢或治療，以處理潛在的情緒問題。"
        ]
        },
        "reversed": {
          "summary": "你開始從身體或情緒的低谷中恢復。",
          "details": [
            "雖然康復的過程可能緩慢，但進展是顯而易見的。",
            "繼續照顧好自己的身體和心靈，給自己足夠的時間來完全康復。",
            "這是一個學習更健康生活方式的機會。"
        ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正面臨一個需要面對內心痛苦或真相的時刻。",
          "details": [
            "這可能是一個覺醒的時刻，雖然痛苦，但對於個人成長至關重要。",
            "允許自己感受這些情緒，不要壓抑或逃避。",
            "通過面對這些挑戰，你將變得更加堅強和智慧。"
        ]
        },
        "reversed": {
          "summary": "你開始從情感創傷中恢復，並從中獲得新的見解。",
          "details": [
            "你正在學習將痛苦轉化為智慧和力量。",
            "這段經歷可能會改變你對自己和他人的看法。",
            "記住，治癒是一個過程，要對自己溫柔以待。"
        ]
        }
      }
    }
  },
  {
    "id": "four_of_swords",
    "name": "寶劍四",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "這是一個需要獨處和反思的時期，暫時遠離關係中的紛擾。",
          "details": [
            "如果你正在經歷感情上的困難，給彼此一些空間可能對雙方都有好處。",
            "單身者可能需要暫時遠離約會場景，專注於自我療癒。",
            "利用這段時間思考你真正想要的是什麼樣的關係。"
        ]
        },
        "reversed": {
          "summary": "你可能正在從情感疲憊中恢復，準備好重新投入關係。",
          "details": [
            "經過一段時間的休息和反思，你現在對自己的需求有了更清晰的認識。",
            "這是一個重新評估你的關係目標和界限的好時機。",
            "慢慢來，不要急於投入新的關係或做出重大決定。"
        ]
        }
      },
      "career": {
        "upright": {
          "summary": "這是一個需要暫時退後一步，重新評估職業目標的時期。",
          "details": [
            "考慮請個短假或減少工作量，以避免職業倦怠。",
            "利用這段時間學習新技能或參加培訓課程，為未來的機會做準備。",
            "有時候，暫時的停頓可以帶來更大的進步。"
        ]
        },
        "reversed": {
          "summary": "你準備好從休息中回歸，帶著新的視角和能量。",
          "details": [
            "你已經準備好將學到的東西應用到工作中。",
            "考慮如何將你的新見解融入日常工作。",
            "記住保持工作與生活的平衡，避免再次陷入過度工作的循環。"
        ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "這是一個需要暫時遠離社交活動，專注於自我照顧的時期。",
          "details": [
            "給自己一些獨處的時間來充電和恢復。",
            "與親密的朋友或家人保持聯繫，但不要害怕設定界限。",
            "記住，照顧好自己才能更好地照顧他人。"
        ]
        },
        "reversed": {
          "summary": "你準備好重新與他人建立聯繫，帶著新的視角。",
          "details": [
            "你已經準備好以更健康的方式與他人互動。",
            "考慮如何將你學到的自我照顧技巧應用到人際關係中。",
            "慢慢來，不要急於填滿你的社交日程。"
        ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身體需要休息和恢復的時間。",
          "details": [
            "優先考慮睡眠、健康飲食和減壓活動。",
            "考慮嘗試冥想、瑜伽或其他放鬆技巧。",
            "如果感到不適，請務必就醫。"
        ]
        },
        "reversed": {
          "summary": "你開始從疾病或疲憊中恢復，感覺更有活力。",
          "details": [
            "逐漸恢復日常活動，但要注意不要過度勞累。",
            "繼續優先考慮自我照顧，即使你感覺好轉。",
            "考慮將健康的習慣融入日常生活中。"
        ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "這是一個內省和自我反思的時期。",
          "details": [
            "花時間獨處，思考你的目標、價值觀和優先事項。",
            "考慮寫日記或冥想，以獲得清晰度。",
            "記住，自我照顧不是自私的，而是必要的。"
        ]
        },
        "reversed": {
          "summary": "你準備好將你的見解付諸行動。",
          "details": [
            "你已經準備好將學到的東西應用到生活中。",
            "考慮如何將你的新視角融入日常生活。",
            "記住保持自我反思的習慣，即使你變得更活躍。"
        ]
        }
      }
    }
  },
  {
    "id": "five_of_swords",
    "name": "寶劍五",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你可能正面臨關係中的衝突或權力鬥爭，需要小心處理。",
          "details": [
            "這可能是一場沒有真正贏家的爭吵，考慮是否值得為此傷害感情。",
            "單身者可能因為過於強勢或固執而嚇跑潛在的伴侶。",
            "學習妥協和理解對方的立場可以幫助緩解緊張局勢。"
        ]
        },
        "reversed": {
          "summary": "你正在從關係的衝突中學習，開始明白和平相處的重要性。",
          "details": [
            "這是一個放下自我，尋求和解的時期。",
            "你可能會選擇原諒過去的傷害，或者決定結束一段不健康的關係。",
            "記住，真正的勝利是內心的平靜與和諧。"
        ]
        }
      },
      "career": {
        "upright": {
          "summary": "職場上可能出現競爭、衝突或不公平的情況。",
          "details": [
            "你可能會遇到不擇手段的同事或競爭對手。",
            "這不是一個適合冒險或挑戰權威的時期。",
            "保持低調，專注於自己的工作，避免捲入辦公室政治。"
        ]
        },
        "reversed": {
          "summary": "你正在從職場挫折中恢復，並從中吸取教訓。",
          "details": [
            "你可能會選擇以更成熟的方式處理衝突。",
            "這是一個重新評估職業目標和人際關係的時期。",
            "記住，長期的成功比短暫的勝利更重要。"
        ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你可能會經歷與朋友或家人之間的爭吵或誤會。",
          "details": [
            "這不是一個固執己見的好時機，試著理解對方的觀點。",
            "避免說出日後可能後悔的話。",
            "有時候，選擇和平比證明自己是對的更重要。"
        ]
        },
        "reversed": {
          "summary": "你正在修復受損的關係，並從中學習和成長。",
          "details": [
            "你可能會選擇原諒或尋求原諒。",
            "這是一個學習更有效溝通方式的機會。",
            "記住，真正的友誼和家庭關係比任何爭論都重要。"
        ]
        }
      },
      "health": {
        "upright": {
          "summary": "壓力、焦慮或衝突可能正在影響你的健康。",
          "details": [
            "這可能表現為頭痛、失眠或消化問題。",
            "尋找健康的減壓方式，如運動、冥想或與朋友交談。",
            "如果問題持續，請考慮尋求專業幫助。"
        ]
        },
        "reversed": {
          "summary": "你開始從壓力或健康問題中恢復。",
          "details": [
            "這是一個學習更健康應對壓力的時期。",
            "考慮調整生活方式，以支持你的整體健康。",
            "記住，照顧好自己是最重要的。"
        ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你可能正在經歷內心的衝突或自我懷疑。",
          "details": [
            "這是一個反思你的行為和動機的時期。",
            "考慮你的行為如何影響他人。",
            "記住，真正的成長來自於自我反省和改變。"
        ]
        },
        "reversed": {
          "summary": "你開始從自我懷疑中走出來，找到內心的平靜。",
          "details": [
            "這是一個原諒自己和他人的時期。",
            "你可能會選擇放下過去的傷害，繼續前進。",
            "記住，每個人都會犯錯，重要的是我們從中學習。"
        ]
        }
      }
    }
  },
  {
    "id": "six_of_swords",
    "name": "寶劍六",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "這是一個過渡期，你可能正在從一段困難的關係中走出來，或者準備好開始新的感情旅程。",
          "details": [
            "如果你剛結束一段關係，給自己時間來療傷和恢復。",
            "單身者可能會遇到一個能幫助你從過去走出來的人。",
            "記住，治癒需要時間，不要急於投入新的關係。"
        ]
        },
        "reversed": {
          "summary": "你可能會發現難以放下過去的情感包袱，或者拒絕接受關係中的變化。",
          "details": [
            "這是一個面對和處理未解決情感問題的時期。",
            "尋求專業幫助或與信任的朋友交談可能對你有益。",
            "記住，只有正視過去，才能真正地向前邁進。"
        ]
        }
      },
      "career": {
        "upright": {
          "summary": "你可能正在經歷職業上的轉變，這可能涉及換工作、換行業或改變職業方向。",
          "details": [
            "這是一個離開舒適區，追求更適合你的職業道路的時期。",
            "雖然改變可能令人不安，但它也帶來了新的機會。",
            "相信你的直覺，並記住每一步都是向前邁進。"
        ]
        },
        "reversed": {
          "summary": "你可能會感到職業上的停滯或對未來的方向感到不確定。",
          "details": [
            "這是一個重新評估你的職業目標和優先事項的時期。",
            "考慮尋求職業指導或與導師交談，以獲得新的視角。",
            "記住，改變是成長的一部分。"
        ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "這是一個修復受損關係或從衝突中恢復的時期。",
          "details": [
            "你可能會與疏遠的朋友或家人重新建立聯繫。",
            "這是一個尋求和解和理解的時期。",
            "記住，溝通和同理心是修復關係的關鍵。"
        ]
        },
        "reversed": {
          "summary": "你可能會發現難以擺脫過去的衝突或誤會。",
          "details": [
            "這是一個面對和解決未解決問題的時期。",
            "考慮主動邁出第一步，修復受損的關係。",
            "記住，和解需要雙方的努力。"
        ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康狀況可能正在改善，或者你正在從疾病或手術中恢復。",
          "details": [
            "這是一個關注整體健康的時期，包括身體、情感和精神健康。",
            "考慮嘗試新的健康習慣，如均衡飲食、規律運動和減壓技巧。",
            "記住，康復是一個過程，要對自己有耐心。"
        ]
        },
        "reversed": {
          "summary": "你可能會忽視健康問題，或者難以擺脫不健康的生活習慣。",
          "details": [
            "這是一個重新評估你的生活方式和健康習慣的時期。",
            "考慮尋求專業幫助，以解決任何健康問題。",
            "記住，照顧好自己是最重要的。"
        ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "這是一個從過去的創傷或困難中學習和成長的時期。",
          "details": [
            "你可能會發現自己對生活有了新的看法。",
            "這是一個反思你的經歷並從中吸取教訓的時期。",
            "記住，每一次挑戰都是一個成長的機會。"
        ]
        },
        "reversed": {
          "summary": "你可能會發現難以擺脫過去的陰影，或者拒絕接受變化。",
          "details": [
            "這是一個面對和處理未解決情感問題的時期。",
            "考慮尋求專業幫助或與信任的朋友交談。",
            "記住，只有正視過去，才能真正地向前邁進。"
        ]
        }
      }
    }
  },
  {
    "id": "seven_of_swords",
    "name": "寶劍七",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你可能會遇到不誠實或欺騙的行為，或者你自己可能隱瞞了一些事情。",
          "details": [
            "這可能是一個關係中的信任危機時期。",
            "單身者可能會遇到不可靠的潛在伴侶。",
            "誠實和透明是解決問題的關鍵。"
        ]
        },
        "reversed": {
          "summary": "你可能會發現真相，或者決定面對關係中的問題。",
          "details": [
            "這是一個面對現實並做出必要改變的時期。",
            "你可能會決定結束一段不健康的關係。",
            "記住，誠實地面對自己是邁向更健康關係的第一步。"
        ]
        }
      },
      "career": {
        "upright": {
          "summary": "你可能會遇到職場上的欺騙、偷竊或不道德的行為。",
          "details": [
            "這可能是一個需要謹慎行事的時期。",
            "避免參與不誠實的行為，即使這看起來是捷徑。",
            "保護你的聲譽比短期利益更重要。"
        ]
        },
        "reversed": {
          "summary": "你可能會揭露欺騙行為，或者決定離開不誠實的工作環境。",
          "details": [
            "這是一個堅持你的價值觀和原則的時期。",
            "考慮尋求法律或人力資源部門的建議。",
            "記住，誠實和正直最終會得到回報。"
        ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你可能會發現朋友或家人對你不誠實，或者你自己可能隱瞞了一些事情。",
          "details": [
            "這是一個審視你周圍人際關係的時期。",
            "考慮哪些關係是基於信任和誠實的。",
            "記住，真正的友誼和家庭關係應該建立在誠實的基礎上。"
        ]
        },
        "reversed": {
          "summary": "你可能會決定面對人際關係中的問題，或者結束不健康的關係。",
          "details": [
            "這是一個設定界限和保護自己情緒健康的時期。",
            "考慮與信任的朋友或治療師交談。",
            "記住，你有權遠離有毒的關係。"
        ]
        }
      },
      "health": {
        "upright": {
          "summary": "你可能會忽視健康問題，或者對醫生隱瞞症狀。",
          "details": [
            "這是一個誠實面對健康狀況的時期。",
            "尋求專業的醫療建議，不要自我診斷。",
            "記住，早期發現和治療通常會帶來更好的結果。"
        ]
        },
        "reversed": {
          "summary": "你可能會開始正視健康問題，並尋求幫助。",
          "details": [
            "這是一個採取積極步驟改善健康的時期。",
            "考慮尋求第二意見或嘗試不同的治療方法。",
            "記住，照顧好自己是最重要的。"
        ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你可能會欺騙自己，或者拒絕面對現實。",
          "details": [
            "這是一個誠實面對自己的時期。",
            "考慮你的行為和決定如何影響你自己和他人。",
            "記住，自我欺騙只會阻礙你的成長。"
        ]
        },
        "reversed": {
          "summary": "你可能會開始面對真相，並對自己更加誠實。",
          "details": [
            "這是一個自我反省和個人成長的時期。",
            "考慮尋求治療或輔導，以幫助你處理困難的情緒。",
            "記住，承認自己的錯誤是成長的一部分。"
        ]
        }
      }
    }
  },
  {
    "id": "eight_of_swords",
    "name": "寶劍八",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你感到被困在這段關係中，動彈不得，但束縛可能來自於你自己的內心。",
          "details": [
            "你可能覺得自己在這段關係中沒有選擇，害怕離開，也害怕留下。",
            "你是否因為害怕孤單或他人的眼光，而不敢結束一段不健康的關係？",
            "這張牌提醒你，困住你的往往不是外界的鎖鏈，而是你自己的思想。你需要改變你的觀點，才能看到出路。"
          ]
        },
        "reversed": {
          "summary": "你正在意識到自己擁有掙脫束縛的力量，並開始尋找解決方案。",
          "details": [
            "你開始看清，那些你以為的限制其實並不存在，你完全有能力改變現狀。",
            "這是掙脫一段有毒關係、或是解決長期存在問題的開始。",
            "相信自己的判斷力，勇敢地走出第一步，你會發現世界比你想像的要開闊。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "在工作中感到無力、受限，覺得自己像個無關緊要的棋子。",
          "details": [
            "你可能覺得自己被困在一個沒有前景的工作中，但又因為害怕而不敢辭職。",
            "你是否覺得自己的意見總是被忽視，無法在工作中發揮自己的價值？",
            "你需要挑戰那些「我別無選擇」的想法。真的是這樣嗎？還是你限制了自己去看見其他的可能性？"
          ]
        },
        "reversed": {
          "summary": "你正在打破職業上的僵局，重拾主導權。",
          "details": [
            "你開始主動尋找新的機會，或者在現有工作中找到了新的突破口。",
            "你不再被他人的意見或公司的規定所束縛，開始為自己的職業生涯負責。",
            "這是一個釋放潛力、挑戰現狀的好時機。你的自信正在回歸。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "在社交圈中感到孤立和無助，害怕表達真實的自己。",
          "details": [
            "你可能因為害怕被評判或排擠，而在朋友面前戴上假面具。",
            "你是否感到被某個小團體的規則所束縛，無法自由地做自己？",
            "你需要明白，真正的朋友會接受你真實的樣子。如果一個圈子讓你感到壓抑，那它可能並不適合你。"
          ]
        },
        "reversed": {
          "summary": "你正在從一個讓你感到壓抑的社交環境中解放出來。",
          "details": [
            "你開始不在意他人的眼光，勇敢地表達自己的觀點和感受。",
            "你可能會選擇離開一個有毒的社交圈，去尋找那些真正能讓你感到自在的朋友。",
            "這是重塑你社交網絡、建立更健康人際關係的時刻。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康問題可能與心理壓力、焦慮和無力感密切相關。",
          "details": [
            "這張牌常常指向由焦慮、恐懼和壓力引起的身體症狀，例如頭痛、失眠或恐慌發作。",
            "你可能對自己的健康狀況感到悲觀，覺得自己被疾病困住了，無能為力。",
            "你需要尋求心理上的支持，處理你內心的恐懼，這對你的身體康復至關重要。"
          ]
        },
        "reversed": {
          "summary": "你正在積極地尋找解決健康問題的方法，重拾對康復的信心。",
          "details": [
            "你開始意識到心理狀態對身體的影響，並主動尋求心理諮商或治療。",
            "你不再被動地接受診斷，而是主動去了解你的病情，並參與到治療決策中。",
            "這是一個充滿希望的轉變，你正在從思想的牢籠中解放出來，這將極大地促進你的康復。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你被自己的負面思想和限制性信念所困，陷入了分析癱瘓的狀態。",
          "details": [
            "你腦中有太多的「我不行」、「我不能」和「我應該」，這些聲音讓你動彈不得。",
            "你過度思考，反覆權衡，卻始終不敢邁出第一步，因為你害怕犯錯。",
            "你需要意識到，這些思想的牢籠是你自己建造的。只有你才能拆掉它。試著從一個微小的、可控的行動開始。"
          ]
        },
        "reversed": {
          "summary": "你正在經歷一次重大的思想突破，挑戰並釋放了長久以來的限制性信念。",
          "details": [
            "你終於意識到，唯一能困住你的人就是你自己。這個領悟讓你獲得了巨大的自由。",
            "你不再害怕犯錯，而是將其視為學習的機會。你開始用行動代替空想。",
            "這是一個心智解放的過程。你正在打開你的眼罩，移除你身邊的劍，準備好去擁抱一個充滿可能性的世界。"
          ]
        }
      }
    }
  },
  {
    "id": "nine_of_swords",
    "name": "寶劍九",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你正被對關係的極度焦慮、嫉妒或罪惡感所折磨。",
          "details": [
            "你可能在夜深人靜時，反覆思考關係中的問題，讓自己陷入恐慌和絕望。",
            "你是否在為過去犯下的錯誤而深深自責，或者無端地懷疑你的伴侶？",
            "這張牌提醒你，你需要將你的恐懼說出來。與你的伴侶溝通，或者尋求朋友、諮商師的幫助，不要讓自己一個人承受這一切。"
          ]
        },
        "reversed": {
          "summary": "你正在從極度的焦慮中慢慢恢復，或者你誇大了問題的嚴重性。",
          "details": [
            "最壞的時期可能已經過去，你開始看到隧道盡頭的光芒。",
            "你是否意識到，你所擔心的最壞情況其實並沒有發生？你的恐懼可能比現實更可怕。",
            "這是一個學習如何管理你的焦慮，並用更理性的角度看待問題的時刻。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "工作上的巨大壓力讓你夜不能寐，對自己的表現感到極度焦-慮。",
          "details": [
            "你可能害怕被解僱、害怕專案失敗，或者對即將到來的報告感到恐慌。",
            "你是否把所有的責任都扛在了自己肩上，讓自己不堪重負？",
            "你需要尋求支持。和你的同事或上司談談你的壓力，或者將工作分解成更小的、可管理的任務，一步一步來。"
          ]
        },
        "reversed": {
          "summary": "工作壓力正在減輕，或者你發現情況並沒有你想像的那麼糟糕。",
          "details": [
            "你可能成功地度過了一個困難時期，現在可以稍微鬆一口氣了。",
            "你開始意識到你需要更好地管理你的壓力，並尋求更健康的工作與生活平衡。",
            "不要再為工作而犧牲你的睡眠和健康。學會放下，學會求助。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你可能因為一段人際關係而感到極度的痛苦、內疚或焦慮。",
          "details": [
            "你是否因為與朋友的爭吵而徹夜難眠，或者因為說錯了話而感到深深的後悔？",
            "你可能正在經歷被朋友背叛或排擠的痛苦。",
            "你需要找到一個可以傾訴的對象。壓抑這些情緒只會讓情況變得更糟。"
          ]
        },
        "reversed": {
          "summary": "你正在從一段痛苦的人際關係經歷中恢復，或者你選擇原諒並放下。",
          "details": [
            "你開始意識到，你不能讓別人的錯誤來懲罰你自己。",
            "你正在學習如何設立界限，保護自己不再受到同樣的傷害。",
            "雖然傷口還在，但你正在走向療癒的道路。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "這張牌強烈指向心理健康問題，特別是焦慮症、憂鬱症和失眠。",
          "details": [
            "你的精神壓力已經達到了極限，並開始嚴重影響你的身體健康，特別是你的睡眠品質。",
            "你可能被噩夢、恐慌發作或持續的負面思想所困擾。",
            "請務必尋求專業的醫療幫助。心理健康問題不是靠意志力就能克服的，你需要專業的指導和支持。"
          ]
        },
        "reversed": {
          "summary": "你終於開始正視並處理你的心理健康問題。",
          "details": [
            "你可能已經開始接受心理治療或藥物治療，並且情況正在好轉。",
            "你正在學習新的應對機制來管理你的焦慮和壓力。",
            "這是一個漫長但充滿希望的過程。為自己尋求幫助的勇氣感到驕傲吧。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你被內心的惡魔所困擾，陷入了絕望和痛苦的深淵。",
          "details": [
            "這張牌描繪了思想能夠帶來的極致痛苦。你的恐懼、罪惡感和悔恨在你的腦海中無限放大，讓你無法喘息。",
            "你感到孤立無援，覺得沒有人能理解你的痛苦。",
            "但請記住，這九把劍並沒有真正刺傷你。它們是你思想的產物。你需要向外界伸出求助之手，讓陽光照進你黑暗的房間。"
          ]
        },
        "reversed": {
          "summary": "你正在從精神的谷底爬出來，學會了與你的內心惡魔共存，甚至戰勝它們。",
          "details": [
            "你開始質疑那些讓你痛苦的負面思想，並意識到它們並不是真理。",
            "你正在學習自我同情和自我原諒，釋放那些沉重的罪惡感和悔恨。",
            "這是一個從黑暗走向光明的過程。你正在從自己思想的囚徒，轉變為自己思想的主人。"
          ]
        }
      }
    }
  },
  {
    "id": "ten_of_swords",
    "name": "寶劍十",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段關係走到了痛苦的盡頭，可能伴隨著背叛和心碎。",
          "details": [
            "這是一段關係的終結，而且過程可能非常痛苦和突然，讓你感到被徹底擊垮。",
            "你可能經歷了背叛，或者發現了一些讓你無法接受的真相。",
            "雖然現在極度痛苦，但這也是一個必要的結局。這個結束為一個更健康的未來騰出了空間。"
          ]
        },
        "reversed": {
          "summary": "你正在從一次毀滅性的心碎中慢慢恢復過來，但過程非常艱難。",
          "details": [
            "你可能在抗拒這個不可避免的結局，試圖挽回一段已經死去的關係，這只會延長你的痛苦。",
            "你正在從背叛的陰影中走出來，但傷口依然很深，需要時間來癒合。",
            "最壞的時刻已經過去了。你需要做的就是接受現實，放手，並相信自己有能力重新站起來。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的工作或事業遭遇了災難性的失敗或終結。",
          "details": [
            "這可能代表著被解僱、一個重要專案的徹底失敗，或者是公司倒閉。",
            "你可能感到被同事或上司背後捅刀，讓你對工作環境感到絕望。",
            "雖然這是一個痛苦的打擊，但它也強迫你離開一個可能不再適合你的地方，去尋找新的機會。"
          ]
        },
        "reversed": {
          "summary": "你正在從一次重大的職業打擊中倖存下來，並試圖重新開始。",
          "details": [
            "你可能在避免一次本應發生的裁員，或者在一次失敗後努力收拾殘局。",
            "你意識到，你需要從這次經歷中吸取教訓，才能避免重蹈覆轍。",
            "雖然前路依然艱難，但你已經度過了最黑暗的時刻。現在是時候療傷、反思，並規劃你的下一步了。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "一段友誼因為背叛或激烈的衝突而走到了盡頭。",
          "details": [
            "你可能被一個你非常信任的朋友深深地傷害了，導致這段關係無法修復。",
            "一個社交圈子可能因為內部的矛盾而分崩離析。",
            "這是一個痛苦的結局，但它也讓你認清了誰是真正的朋友。"
          ]
        },
        "reversed": {
          "summary": "你正在從一次朋友的背叛中恢復，或者一段關係在崩潰的邊緣被挽救了回來。",
          "details": [
            "你可能選擇原諒，但關係已經不可能回到從前。傷痕依然存在。",
            "你正在努力修復一段瀕臨破裂的關係，但這個過程需要雙方巨大的努力。",
            "你需要問問自己，這段關係是否還值得你投入精力去拯救。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "這張牌可能指向一個健康危機、手術，或者一個讓你感到徹底耗盡的疾病。",
          "details": [
            "你的身體狀況可能達到了谷底，讓你感到無助和絕望。",
            "在某些情況下，這張牌也代表著針灸治療，因為牌面上的劍就像針一樣。",
            "雖然情況看起來很糟，但這也代表著一個轉折點。在谷底之後，唯一的方向就是向上。你的康復之路將從這裡開始。"
          ]
        },
        "reversed": {
          "summary": "你正在從一個嚴重的健康問題中緩慢恢復，或者你僥倖躲過了一場健康危機。",
          "details": [
            "你的康復之路可能比預期的要長，讓你感到沮喪，但重要的是你正在好轉。",
            "你可能意識到你需要徹底改變你的生活方式，才能避免未來的健康問題。",
            "不要放棄。即使進展緩慢，但每一步都是朝著健康邁進的。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你已經到達了痛苦的極點，一個舊的自我或信念系統已經徹底死亡。",
          "details": [
            "這是一種『觸底反彈』的能量。你經歷了最深的黑暗，現在除了光明，無處可去。",
            "你可能扮演了一個『受害者』的角色，將所有的不幸都歸咎於外界。現在是時候收回你的力量了。",
            "接受這個痛苦的結局。放開那些不再為你服務的東西。黎明就在眼前，一個全新的你即將重生。"
          ]
        },
        "reversed": {
          "summary": "你在抗拒一個必要的結束，或者沉溺在自己的痛苦中無法自拔。",
          "details": [
            "你是否在不斷地重溫你的創傷，讓自己一直停留在受害者的角色裡？",
            "你害怕放手，因為未知比已知的痛苦更讓你恐懼。",
            "你需要意識到，只有徹底地面對和接受這個結局，你才能真正地開始療癒。你是唯一能把自己從地上扶起來的人。"
          ]
        }
      }
    }
  },
  {
    "id": "page_of_swords",
    "name": "寶劍侍衛",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "關係中充滿了好奇心和坦率的溝通，但可能缺乏情感深度。",
          "details": [
            "你或你的伴侶可能對彼此充滿了好奇，喜歡進行智力上的交流和辯論。",
            "需要注意，過於直接或尖銳的言辭可能會傷害到對方。",
            "如果你是單身，你可能會被一個聰明、健談的人所吸引。"
          ]
        },
        "reversed": {
          "summary": "溝通中充滿了誤解、謊言或傷人的話語。",
          "details": [
            "你或你的伴侶可能在說話前沒有經過深思熟慮，導致不必要的爭吵。",
            "小心背後的閒言閒語或不實的謠言正在影響你們的關係。",
            "這是一個需要謹言慎行的時期，不要輕易地相信你所聽到的一切。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你充滿了學習新技能和探索新想法的熱情。",
          "details": [
            "這是一個非常適合開始新課程、接受培訓或研究新領域的時期。",
            "你充滿了好奇心和能量，渴望在工作中證明自己。",
            "勇敢地提出你的新想法，即使它們看起來有些不成熟，你的熱情也會感染他人。"
          ]
        },
        "reversed": {
          "summary": "你的想法可能不切實際，或者你在工作中說話不經大腦。",
          "details": [
            "你可能有很多點子，但都缺乏詳細的計畫和執行的能力。",
            "小心不要在同事或客戶面前說錯話，你的言辭可能會給你帶來麻煩。",
            "在做出任何承諾或發表意見之前，請務必三思。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你渴望與人交流思想，但可能顯得有些好辯。",
          "details": [
            "你喜歡與朋友進行智力上的辯論，分享新的資訊和觀點。",
            "你是一個充滿好奇心的朋友，但有時可能會因為過於直接而無意中傷害到他人。",
            "小心不要變成一個愛管閒事或喜歡八卦的人。"
          ]
        },
        "reversed": {
          "summary": "你可能在散播謠言，或者用言語傷害了你的朋友。",
          "details": [
            "你在背後說的話可能已經傳到了當事人的耳朵裡，造成了傷害。",
            "你可能因為說話不經思考而與朋友發生了不必要的爭執。",
            "現在是時候為你的言行負責，並向你傷害過的人道歉了。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你對了解自己的健康狀況充滿了好奇心，並積極尋求資訊。",
          "details": [
            "你可能會花很多時間在網上研究你的症狀或健康知識。",
            "這是一個與你的醫生進行清晰、直接溝通的好時機，多問問題。",
            "你的精神非常活躍，可以嘗試一些需要專注力的腦力活動，如解謎或學習新語言。"
          ]
        },
        "reversed": {
          "summary": "你可能因為網上的不實資訊而對自己的健康感到焦慮，或者與醫生溝通不暢。",
          "details": [
            "不要在網上自我診斷，這可能會給你帶來不必要的恐慌。請相信專業的醫生。",
            "你可能沒有向醫生提供完整的資訊，或者沒有完全理解醫生的建議。",
            "你感到精神緊張，無法放鬆。嘗試一些正念練習來讓你的大腦休息一下。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你充滿了求知慾，渴望探索新的思想和觀點。",
          "details": [
            "這是一個學習新事物、挑戰舊有信念的絕佳時機。你的大腦像一塊海綿，渴望吸收知識。",
            "保持開放的心態，去探索那些讓你感到好奇的領域。",
            "你需要用清晰的邏輯和批判性思維來分辨真偽，不要盲目地接受所有資訊。"
          ]
        },
        "reversed": {
          "summary": "你的思想混亂，缺乏焦點，或者你在用言語作為武器。",
          "details": [
            "你可能有很多想法，但都淺嚐輒止，無法深入。你需要學會專注。",
            "你是否在用尖酸刻薄的言辭來掩飾你的不安全感？這種行為只會傷害他人，也傷害自己。",
            "你需要為你的言論負責。在說話之前，先問問自己：這是真的嗎？這是善意的嗎？這是有必要的嗎？"
          ]
        }
      }
    }
  },
  {
    "id": "knight_of_swords",
    "name": "寶劍騎士",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段關係正在快速發展，充滿了直接的溝通和果斷的行動。",
          "details": [
            "你或你的伴侶可能會迅速地確定關係，或者做出一個重大的承諾。",
            "這段關係可能缺乏浪漫的溫存，但充滿了智力上的火花和共同的目標。",
            "如果你是單身，一個聰明、果斷、充滿魅力的人可能會旋風般地進入你的生活。"
          ]
        },
        "reversed": {
          "summary": "關係中充滿了衝動的決定、激烈的爭吵和魯莽的行為。",
          "details": [
            "你或你的伴侶可能在沒有深思熟慮的情況下就想結束關係，或者說出一些傷人的話。",
            "這段關係可能發展得太快，以至於根基不穩，現在正暴露出問題。",
            "你需要放慢腳步。在做出任何無法挽回的決定之前，先給自己一些冷靜思考的時間。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你充滿了野心和決心，正以極快的速度朝著你的目標前進。",
          "details": [
            "這是一個採取果斷行動、抓住機會的絕佳時機。你的思維清晰，充滿了戰鬥力。",
            "你可能會在一個競爭激烈的環境中脫穎而出，你的果斷和效率將給人留下深刻印象。",
            "確保你的行動是基於清晰的計畫，而不僅僅是一時的衝動。"
          ]
        },
        "reversed": {
          "summary": "你的行動過於魯莽和衝動，缺乏計畫，可能會導致嚴重的錯誤。",
          "details": [
            "你可能因為急於求成而忽略了重要的細節，或者得罪了關鍵人物。",
            "你的野心可能超出了你的實際能力，導致你做出錯誤的判斷。",
            "你需要停下來，重新評估你的策略。速度並不代表一切，有時候，謹慎和耐心更為重要。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是一個充滿活力、直言不諱的朋友，但有時可能顯得有些強勢。",
          "details": [
            "你喜歡和朋友們進行快節奏的、充滿挑戰性的對話。",
            "你是一個會為了朋友挺身而出、仗義執言的人。",
            "需要注意，你的直接可能會無意中傷害到一些比較敏感的朋友。"
          ]
        },
        "reversed": {
          "summary": "你可能因為過於好鬥或衝動的言辭而與朋友發生衝突。",
          "details": [
            "你是否為了贏得一場辯論而傷害了朋友的感情？",
            "你可能在沒有了解全部事實的情況下，就衝動地為朋友出頭，結果卻把事情搞得更糟。",
            "你需要學會在表達自己和尊重他人之間找到平衡。不是所有的戰鬥都值得去打。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的精神和身體都充滿了能量，渴望挑戰和運動。",
          "details": [
            "這是一個開始新的、高強度運動計畫的好時機。",
            "你的思維非常活躍，能夠快速地處理資訊和做出決定。",
            "小心不要因為過度興奮而導致意外傷害。在行動前做好熱身和安全措施。"
          ]
        },
        "reversed": {
          "summary": "你可能因為過於魯莽而導致意外受傷，或者你的精神能量已經耗盡。",
          "details": [
            "你是否在運動或日常活動中因為急躁而受傷？你需要更加小心。",
            "你可能因為長期的精神高度緊張而感到精疲力竭，大腦無法停止運轉。",
            "你需要找到讓自己身心都慢下來的方法，例如冥想、散步或瑜伽。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你擁有清晰的頭腦和堅定的決心，去追求你認定的真理和目標。",
          "details": [
            "這是一個打破思想束縛、挑戰傳統觀念的時刻。你的頭腦是你最強大的武器。",
            "你充滿了自信，不畏懼任何挑戰，準備好為你的信念而戰。",
            "確保你的追求是來自於你自己的思考，而不是僅僅為了反對而反對。"
          ]
        },
        "reversed": {
          "summary": "你的思想變得混亂而具攻擊性，為了勝利而犧牲了真理。",
          "details": [
            "你是否在辯論中變得咄咄逼人，只是為了證明自己是對的，而不在乎事實是什麼？",
            "你可能因為衝動而做出了一個讓你後悔的決定，但又因為驕傲而不願承認錯誤。",
            "你需要找回你的初心。你追求的是什麼？是無意義的勝利，還是真正的智慧和真理？"
          ]
        }
      }
    }
  },
  {
    "id": "queen_of_swords",
    "name": "寶劍皇后",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你在愛情中尋求智力上的平等和清晰的溝通，非常重視個人空間。",
          "details": [
            "你是一個獨立的伴侶，需要大量的個人時間和空間。你更喜歡用清晰的語言溝通，而不是模糊的情感表達。",
            "你可能被一個同樣聰明、獨立且尊重你界限的人所吸引。",
            "這張牌也可能代表一位經歷過情傷，現在變得更加謹慎和理性的女性。"
          ]
        },
        "reversed": {
          "summary": "你可能變得過於挑剔、冷漠，或者因為過去的傷害而無法敞開心扉。",
          "details": [
            "你是否在用尖酸刻薄的言辭來推開你的伴侶，以保護自己不再受傷？",
            "你可能因為過於悲觀或憤世嫉俗，而無法看到關係中積極的一面。",
            "這張牌提醒你要警惕因為孤獨和痛苦而變得冷酷無情。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你以清晰的頭腦、公正的判斷和專業的態度處理工作。",
          "details": [
            "你是一個出色的溝通者和決策者，能夠快速地抓住問題的核心。",
            "你非常獨立，能夠獨自完成複雜的任務。你的同事和上司都很尊重你的專業意見。",
            "這是一個設立清晰界限、不受辦公室政治干擾、專注於工作的時期。"
          ]
        },
        "reversed": {
          "summary": "你可能在工作中變得過於嚴厲、缺乏同理心，或者與同事溝通不暢。",
          "details": [
            "你是否因為對他人期望過高而變得過於挑剔，導致團隊合作出現問題？",
            "你可能因為資訊不暢或溝通不良而做出錯誤的判斷。",
            "小心不要捲入辦公室的八卦或權力鬥爭中。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是一個聰明、風趣但需要個人空間的朋友。",
          "details": [
            "你以誠實和直接著稱，朋友們都很信任你的判斷力。",
            "你不是一個黏人的朋友，你尊重自己和朋友的獨立性。",
            "你可能更喜歡進行有深度的、一對一的對話，而不是參加大型的、膚淺的社交聚會。"
          ]
        },
        "reversed": {
          "summary": "你可能因為言語尖刻或過於冷漠而疏遠了朋友。",
          "details": [
            "你是否在不經意間用你的『幽默感』傷害了朋友的感情？",
            "你可能因為感到孤獨或被誤解而變得充滿怨氣，喜歡在背後說閒話。",
            "你需要重新學習如何用更溫和、更有同理心的方式與人溝通。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你需要用清晰、理性的頭腦來處理你的健康問題。",
          "details": [
            "這是一個尋求第二醫療意見、研究你的病情、並與醫生進行清晰溝通的好時機。",
            "你需要的是事實和數據，而不是模糊的安慰。你會成為自己健康狀況的專家。",
            "這張牌也可能代表一位非常專業、經驗豐富的女性醫療人員。"
          ]
        },
        "reversed": {
          "summary": "你可能因為思緒混亂而對健康問題感到焦慮，或者與醫療人員溝通不良。",
          "details": [
            "你可能因為接收到太多相互矛盾的資訊而感到不知所措。",
            "你是否因為對醫生不信任而沒有完全遵循治療計畫？",
            "你需要找到一種方法讓你的頭腦冷靜下來，並找到一位你能夠信任的、可以清晰溝通的醫療專家。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在用智慧和清晰的眼光審視自己和世界，不受情緒的干擾。",
          "details": [
            "你已經學會了從過去的痛苦中吸取教訓，而不是沉溺其中。你的經歷讓你變得更有智慧。",
            "這是一個設立個人界限、剪除生活中不再為你服務的人和事的絕佳時機。",
            "你的判斷力非常敏銳。相信你的直覺和你的邏輯，它們會引導你走向真理。"
          ]
        },
        "reversed": {
          "summary": "你可能被過去的痛苦所困，變得尖酸刻薄、充滿怨恨。",
          "details": [
            "你是否還在為過去的傷害而耿耿於懷，讓這些負面情緒定義了你是誰？",
            "你可能用冷漠和理性作為盔甲，來隔絕自己與他人的情感連結，但這也讓你變得孤獨。",
            "你需要學會原諒——不僅是原諒他人，更是原諒自己。這樣你才能從過去的陰影中走出來，重新擁抱溫暖和連結。"
          ]
        }
      }
    }
  },
  {
    "id": "king_of_swords",
    "name": "寶劍國王",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你在尋找一位能夠與你在智力上匹敵、溝通清晰且尊重界限的伴侶。",
          "details": [
            "這段關係可能更多地建立在相互尊重、共同的價值觀和智力交流之上，而非濃烈的情感。",
            "你需要一個能夠給你足夠空間，並用成熟、理性的方式解決問題的伴侶。",
            "如果你是單身，你可能會被一位年長的、有權威的、像律師、教授或醫生一樣的專業人士所吸引。"
          ]
        },
        "reversed": {
          "summary": "你或你的伴侶可能表現得過於專制、冷酷無情，或者在濫用言語權力。",
          "details": [
            "一方可能在用言語操控或欺凌另一方，將自己的意志強加於人。",
            "關係中缺乏溫暖和情感的交流，只剩下冰冷的邏輯和評判。",
            "你需要警惕這種不健康的權力動態，並保護自己免受言語上的傷害。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你正處於權威和智力的巔峰，能夠做出清晰、公正且有遠見的決策。",
          "details": [
            "這是一個擔任領導角色、制定規則或在你的專業領域成為權威的絕佳時機。",
            "你的判斷力非常可靠，能夠不受情緒影響，做出最符合邏輯和道德的選擇。",
            "你可能會扮演顧問、法官或仲裁者的角色，為他人提供指導和解決方案。"
          ]
        },
        "reversed": {
          "summary": "你可能在濫用你的權力，或者你的判斷力因為偏見而變得不再公正。",
          "details": [
            "你是否變成了一個專制的暴君，聽不進任何不同的意見？",
            "你的決策可能過於嚴厲，缺乏人情味，導致團隊士氣低落。",
            "你需要反思你的領導風格。真正的權威來自於智慧和公正，而非權力和恐懼。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是一位受人尊敬、言而有信的朋友，總能給出公正的建議。",
          "details": [
            "朋友們都很信任你的判斷力，當他們遇到難題時，會來向你尋求建議。",
            "你是一個非常有原則的人，你的友誼建立在誠實和相互尊重的基礎之上。",
            "你可能更喜歡與那些能夠進行深度智力交流的朋友交往。"
          ]
        },
        "reversed": {
          "summary": "你可能在朋友面前表現得過於傲慢、好為人師，或者在散播不實言論。",
          "details": [
            "你是否總是以一種高高在上的姿態與朋友說話，讓他們感到不舒服？",
            "你可能在利用你所知道的資訊來操控或評判你的朋友。",
            "你需要放下你的優越感。真正的友誼是平等的，而不是權力的展示。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你需要用最清晰、最權威的資訊來管理你的健康。",
          "details": [
            "這是一個尋求頂級專家意見、制定嚴謹治療計畫的時刻。",
            "你需要完全的透明和誠實，無論是來自你的醫生，還是你自己對待病情的態度。",
            "這張牌常常代表著外科醫生或某一領域的頂級醫療專家。"
          ]
        },
        "reversed": {
          "summary": "你可能得到了一個冷酷的診斷，或者你正在與一位專橫的醫療人員打交道。",
          "details": [
            "你可能對一個過於嚴厲或缺乏人情味的診斷結果感到難以接受。",
            "你是否覺得你的醫生沒有在聽取你的意見，只是在發號施令？",
            "你有權利尋求第二意見，並找到一位你能夠與之建立信任關係的醫生。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你已經達到了智力和道德的頂峰，你的思想塑造了你的現實。",
          "details": [
            "你擁有制定自己人生法則的能力。你的思想清晰、有力和充滿權威。",
            "你能夠客觀地審視自己的信念，並拋棄那些不再服務於最高真理的觀點。",
            "這是一個關於真理、誠實和智力誠信的時刻。用你的智慧去創造一個更公正、更有序的世界，從你自己開始。"
          ]
        },
        "reversed": {
          "summary": "你的思想變得僵化、專制，或者你正在濫用你的智力來操控他人。",
          "details": [
            "你是否變成了一個思想上的暴君，無法容忍任何與你不同的觀點？",
            "你可能在玩弄文字遊戲，或者用複雜的理論來掩蓋一個簡單的、不那麼光彩的真相。",
            "你需要警惕智力上的傲慢。最高的智慧總是與謙遜和同情心相伴。你需要讓你的心來軟化你過於鋒利的頭腦。"
          ]
        }
      }
    }
  },
  {
    "id": "ace_of_pentacles",
    "name": "錢幣一",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段穩定、可靠且有長期潛力的關係的開端。",
          "details": [
            "這不僅僅是激情，更是一份可以觸摸到的、真實的承諾。",
            "你們的關係建立在穩固的基礎之上，有潛力共同創造一個富足和安穩的未來。",
            "如果你是單身，這張牌預示著一個實際、可靠的伴侶即將出現。"
          ]
        },
        "reversed": {
          "summary": "一個看似美好的機會可能存在風險，或者你因為猶豫而錯失良機。",
          "details": [
            "在開始一段新關係之前，請務必做好『盡職調查』。對方是否像他表現出來的那樣可靠？",
            "你可能因為過於關注物質條件而錯過了一個真正有潛力的伴侶。",
            "不要因為害怕風險而不敢投入。有時候，你需要一點點信念來抓住幸福。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "一個帶來財富和穩定性的新機會，例如新工作、晉升或創業。",
          "details": [
            "這是一個將你的想法轉化為現實成果的絕佳時機。",
            "你可能會得到一份薪水更高、更穩定的工作，或者你的新創事業將獲得第一筆投資。",
            "這是一個播種的時刻。只要你努力耕耘，未來的收穫將會非常豐碩。"
          ]
        },
        "reversed": {
          "summary": "一個看似很好的工作機會可能是一個陷阱，或者你因為計畫不周而錯失了機會。",
          "details": [
            "在接受一份新工作或簽署一份重要合約之前，請仔細閱讀所有條款。",
            "你可能因為準備不足或猶豫不決而錯過了一個絕佳的職業發展機會。",
            "你需要重新評估你的計畫。確保你的基礎是穩固的，然後再行動。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "一段新的、穩固且互惠互利的友誼或合作關係的開始。",
          "details": [
            "你會遇到一些實際、可靠的朋友，他們會在物質和精神上都給予你支持。",
            "這是一個非常適合開始新的商業合作或團隊專案的時期。",
            "你的社交圈將為你帶來實際的好處和機會。"
          ]
        },
        "reversed": {
          "summary": "一段新的關係可能並不牢固，或者你因為貪婪而損害了友誼。",
          "details": [
            "小心那些看起來只想從你身上獲取好處的新朋友。",
            "你是否因為金錢或利益問題而與朋友產生了分歧？",
            "你需要建立基於信任和相互尊重的關係，而不僅僅是利益交換。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "開始一個新的、務實的健康計畫或生活方式的絕佳時機。",
          "details": [
            "這是一個將健康目標付諸實踐的時刻，例如開始一個新的飲食計畫、健身習慣或規律的作息。",
            "你的身體處於一個很好的狀態，能夠很好地回應你的努力。",
            "專注於那些能帶來長期、穩定效果的健康習慣。"
          ]
        },
        "reversed": {
          "summary": "你的健康計畫可能因為缺乏堅持而失敗，或者你忽視了你的身體需求。",
          "details": [
            "你可能為自己設定了一個不切實際的健康目標，導致你很快就放棄了。",
            "你是否因為工作或賺錢而犧牲了你的健康？",
            "你需要一個更務實、更可持續的計畫。從小的、容易實現的改變開始。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "宇宙給了你一顆顯化的種子，一個將夢想變為現實的機會。",
          "details": [
            "這是一個將你的靈性領悟和人生目標，在物質世界中紮根的時刻。",
            "你的想法不再是空想，它們擁有轉化為有形財富、健康和成功的潛力。",
            "抓住這個機會，保持務實和耐心。你的辛勤耕耘終將結出豐碩的果實。"
          ]
        },
        "reversed": {
          "summary": "你可能錯過了一個重要的機會，或者你的計畫缺乏穩固的基礎。",
          "details": [
            "你是否因為害怕失敗或不願付出努力，而讓一個絕佳的機會從指縫中溜走？",
            "你的夢想可能過於宏大而不切實際，缺乏一個可行的、一步一步的計畫。",
            "你需要回到繪圖板前。腳踏實地，將你的大目標分解成小的、可管理的步驟。成功始於一個穩固的地基。"
          ]
        }
      }
    }
  },
  {
    "id": "two_of_pentacles",
    "name": "錢幣二",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你正在努力平衡愛情與生活的其他方面，關係需要靈活性。",
          "details": [
            "你可能感到需要在伴侶、工作、家庭和個人時間之間做出權衡。",
            "這段關係充滿了動態和變化，需要雙方共同適應和調整。",
            "如果你正在約會，你可能在兩個潛在的對象之間猶豫不決。"
          ]
        },
        "reversed": {
          "summary": "你因為承擔了太多而感到不堪重負，導致關係出現問題。",
          "details": [
            "你可能因為過於忙碌而忽略了你的伴侶，讓對方感到被冷落。",
            "財務壓力或生活上的混亂正在對你們的關係造成負面影響。",
            "你需要重新審視你的優先順序。有些事情可能需要暫時放下，才能維護關係的穩定。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你正忙於應付多個專案或任務，需要良好的時間管理能力。",
          "details": [
            "這是一個非常忙碌的時期，你可能需要同時處理很多事情。",
            "你的適應能力和靈活性是你的最大資產，能夠幫助你應對各種變化。",
            "這也可能代表你需要做出一個關於職業生涯的重要選擇，或者在兩個工作機會之間權衡。"
          ]
        },
        "reversed": {
          "summary": "你因為承擔了過多的工作而感到不堪重負，導致效率低下。",
          "details": [
            "你試圖同時做所有的事情，結果卻沒有一件事情能做好。你正在丟球。",
            "混亂的財務管理或糟糕的優先級排序讓你的工作陷入困境。",
            "你需要停下來，深呼吸，然後重新組織。學會說『不』，並專注於最重要的事情。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你正在努力平衡你的社交生活和個人責任。",
          "details": [
            "你可能有很多社交邀約，需要在朋友、家人和工作之間找到平衡點。",
            "你是一個有趣且適應性強的朋友，能夠輕鬆地融入不同的社交場合。",
            "享受這段充滿活力的社交生活，但也要確保你有足夠的時間留給自己。"
          ]
        },
        "reversed": {
          "summary": "你因為過度承諾而感到社交疲憊，或者忽略了你的朋友。",
          "details": [
            "你可能答應了太多的聚會，現在感到分身乏術，無法真正享受其中。",
            "你是否因為太忙而取消了與朋友的約定，讓他們感到失望？",
            "你需要簡化你的社交日曆。有時候，一場有品質的深度交流勝過十場膚淺的派對。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你需要找到一個可持續的、平衡的生活方式。",
          "details": [
            "這張牌提醒你要在運動、飲食、工作和休息之間找到平衡點。",
            "你的能量水平可能會有起伏，學會根據身體的節奏來調整你的活動。",
            "這是一個嘗試不同健康方法，看看哪種最適合你的好時機。"
          ]
        },
        "reversed": {
          "summary": "不規律的生活方式和壓力正在損害你的健康。",
          "details": [
            "你可能因為過於忙碌而飲食不規律、睡眠不足，導致身心俱疲。",
            "壓力讓你感到喘不過氣來，你的身體已經發出了警報。",
            "你需要將你的健康放在首位。沒有什麼比你的身心平衡更重要。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "生活充滿了變化和起伏，你需要學會隨之起舞。",
          "details": [
            "這是一個關於適應性、靈活性和優先級排序的課題。",
            "不要害怕變化，將其視為一個保持生活有趣和動態的機會。",
            "你正在學習如何在混亂中保持優雅和幽默感。這是一種寶貴的生活智慧。"
          ]
        },
        "reversed": {
          "summary": "你感到生活失去了控制，被各種瑣事壓得喘不過氣。",
          "details": [
            "你試圖抓住所有東西，結果卻讓自己陷入了混亂和焦慮的漩渦。",
            "你可能在抗拒一個必要的改變，試圖維持一個早已不可持續的現狀。",
            "你需要放手。接受你不可能完成所有事情這個事實。學會選擇，學會放棄，這樣你才能重新找回你的中心和平衡。"
          ]
        }
      }
    }
  },
  {
    "id": "three_of_pentacles",
    "name": "錢幣三",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你們正在共同努力，為關係打下堅實的基礎。",
          "details": [
            "這是一張代表『共同建設』的牌。你們可能正在一起裝修房子、規劃未來，或者共同學習如何成為更好的伴侶。",
            "你們的關係建立在團隊合作和相互尊重的基礎之上。",
            "這是一個非常積極的信號，表明你們的關係正在朝著正確的方向發展。"
          ]
        },
        "reversed": {
          "summary": "關係中缺乏合作精神，或者一方的努力沒有得到認可。",
          "details": [
            "你們可能在為一些小事爭吵，而不是像一個團隊一樣共同解決問題。",
            "是否有一方在關係中付出了更多，而另一方卻視為理所當然？",
            "你需要重新學習如何與你的伴侶合作。記住，你們是隊友，而不是對手。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的專業技能得到認可，團隊合作將帶來初步的成功。",
          "details": [
            "這是一個展示你專業能力的絕佳時機。你的努力和才華將被同事和上司看見。",
            "團隊合作是成功的關鍵。與他人分享你的知識，並虛心學習他人的長處。",
            "一個重要的專案可能即將完成，並得到積極的評價。這是你應得的初步回報。"
          ]
        },
        "reversed": {
          "summary": "團隊合作中出現了問題，或者你的工作品質不佳。",
          "details": [
            "團隊中可能存在溝通不暢、目標不一致或權力鬥爭的問題。",
            "你是否因為缺乏動力或技能不足，而沒有盡你最大的努力去完成工作？",
            "你需要提升你的專業技能，並學習如何更好地與他人協作。有時候，你需要放下自我，才能成就更大的事業。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你正在與朋友們共同創造一些有意義的事情。",
          "details": [
            "這可能是一個共同的專案、一個社團活動，或者僅僅是建立一個充滿支持和協作精神的社交圈。",
            "每個人都在貢獻自己獨特的才能，共同創造出比個人所能達成的更偉大的成果。",
            "珍惜你的團隊，並為你在其中的角色感到自豪。"
          ]
        },
        "reversed": {
          "summary": "一個團體專案可能因為內部矛盾而停滯不前。",
          "details": [
            "團隊中可能有人在敷衍了事，或者大家對專案的方向有不同的看法。",
            "你可能感到自己的貢獻沒有得到應有的重視和尊重。",
            "你需要進行一次開誠布公的團隊會議，解決存在的問題，重新統一步伐。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康計畫正在初見成效，堅持下去。",
          "details": [
            "你為改善健康所付出的努力，例如規律運動或健康飲食，已經開始帶來積極的改變。",
            "這也可能代表你需要一個『健康團隊』，例如醫生、營養師和健身教練，來共同幫助你達成目標。",
            "繼續執行你的計畫，你正走在正確的道路上。"
          ]
        },
        "reversed": {
          "summary": "你的健康計畫缺乏一致性，或者你沒有得到專業的指導。",
          "details": [
            "你可能時而堅持，時而放棄，導致你的健康狀況停滯不前。",
            "你是否在沒有諮詢專家的情況下，就自己隨意地嘗試各種健康方法？",
            "你需要一個清晰、可行的計畫，並尋求專業人士的幫助來確保你的努力是安全有效的。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在將你的想法和計畫付諸實踐，並取得了初步的成果。",
          "details": [
            "這是一個關於『實幹』的時刻。你不再只是空想，而是開始動手去建設你的夢想。",
            "你正在學習一門新的手藝或技能，並且樂在其中。",
            "你的努力正在為你的未來打下堅實的基礎。為你的每一步進展感到驕傲吧。"
          ]
        },
        "reversed": {
          "summary": "你可能只有三分鐘熱度，或者你的計畫缺乏堅實的基礎。",
          "details": [
            "你是否有很多偉大的想法，但從未真正地投入時間和精力去實現它們？",
            "你可能因為基礎不牢而導致專案失敗，或者因為工作品質差而需要返工。",
            "你需要回到基礎。在建造摩天大樓之前，先確保你的地基是穩固的。耐心和毅力是成功的關鍵。"
          ]
        }
      }
    }
  },
  {
    "id": "four_of_pentacles",
    "name": "錢幣四",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "關係中存在著控制欲和佔有慾，害怕失去對方。",
          "details": [
            "你或你的伴侶可能因為缺乏安全感而試圖控制對方，例如檢查手機或限制社交。",
            "你們的關係可能非常穩定，但也可能因此變得有些沉悶和缺乏彈性。",
            "你需要學會放手。真正的愛是建立在信任之上，而不是控制。"
          ]
        },
        "reversed": {
          "summary": "你正在釋放你的控制欲，或者一段停滯的關係開始出現轉機。",
          "details": [
            "你開始意識到，緊緊抓住只會讓對方離你更遠。你正在學習給予對方更多的信任和自由。",
            "這也可能代表你因為一次魯莽的投資或開銷，而打破了你們原本穩定的財務狀況。",
            "這是一個重新評估你對『安全感』定義的時刻。它真的來自於控制嗎？"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你非常注重工作的穩定性和財務安全，但可能因此變得過於保守。",
          "details": [
            "你可能在一個非常穩定的公司工作，緊緊地守著你的職位，不敢冒任何風險。",
            "你對預算和資源的控制非常嚴格，這有助於公司的穩定，但也可能扼殺創新。",
            "你需要思考，為了穩定，你是否犧牲了成長的機會？"
          ]
        },
        "reversed": {
          "summary": "你開始願意承擔一些風險，或者你因為一次失誤而失去了對局面的控制。",
          "details": [
            "你可能決定離開一個穩定的工作，去追求一個更有挑戰性但風險更高的機會。",
            "你可能因為一次失敗的投資或糟糕的財務決策，而讓你的事業陷入混亂。",
            "這是一個重新評估風險的時刻。有時候，最大的風險就是從不冒險。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你可能在人際關係中設立了過於嚴格的界限，顯得有些孤僻。",
          "details": [
            "你可能害怕與人建立過於親密的關係，因為你害怕受傷或失去控制。",
            "你對你的朋友可能很慷慨，但你內心深處的某些部分是從不與人分享的。",
            "你需要學會適度地敞開心扉。分享你的脆弱，有時會讓友誼更加堅固。"
          ]
        },
        "reversed": {
          "summary": "你正在變得更加開放和慷慨，或者你因為過於大方而陷入困境。",
          "details": [
            "你開始願意與朋友分享你的時間、資源和情感，讓你的社交生活變得更加豐富。",
            "另一方面，這也可能代表你因為不懂得拒絕，而讓自己被他人利用。",
            "你需要學會在慷慨和自我保護之間找到平衡。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你可能因為過於僵化的生活習慣而導致健康問題，例如便秘或關節僵硬。",
          "details": [
            "你的身體和你的思想一樣，需要流動和彈性。過於固定的生活模式可能會導致能量的堵塞。",
            "你是否因為害怕改變而固守著一些不健康的習慣？",
            "你需要為你的生活注入一些新的元素。嘗試新的運動、新的食物，讓你的身心重新流動起來。"
          ]
        },
        "reversed": {
          "summary": "你正在打破一個不健康的習慣，或者你因為一次放縱而影響了健康。",
          "details": [
            "你可能終於下定決心戒菸、戒酒，或者改變一個長期困擾你的壞習慣。",
            "這也可能代表你因為一次失控的暴飲暴食或衝動行為而讓自己感到後悔。",
            "改變是困難的，但也是必要的。為你的努力感到驕傲，即使偶爾失足，也要繼續前行。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你緊緊地抓住你的物質財富、信念和身份認同，害怕任何形式的改變。",
          "details": [
            "你用你所擁有的東西來定義你是誰。你的房子、你的車、你的頭銜...但這些真的是你嗎？",
            "你對未知的恐懼讓你無法放手，即使你所擁有的東西已經成為了你的負擔。",
            "你需要問問自己：我害怕失去什麼？如果我失去這一切，我還是我嗎？這個練習將會帶給你深刻的解放。"
          ]
        },
        "reversed": {
          "summary": "你正在經歷一個『斷捨離』的過程，釋放那些不再為你服務的物質和信念。",
          "details": [
            "你意識到，真正的財富和安全感來自於內在，而非外在的擁有。",
            "這個過程可能會讓你感到不安，就像鬆開了緊握的拳頭，但最終你會感到前所未有的自由和輕鬆。",
            "這是一個重新定義你與物質世界關係的時刻。從『擁有』模式，切換到『存在』模式。"
          ]
        }
      }
    }
  },
  {
    "id": "five_of_pentacles",
    "name": "錢幣五",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你感到在情感上或物質上被伴侶拋棄，關係陷入困境。",
          "details": [
            "你可能感到孤獨、不被理解，或者因為財務問題而與伴侶產生隔閡。",
            "這是一段艱難的時期，你們需要共同面對，而不是相互指責。",
            "記住，即使感覺被關在門外，也要主動尋求幫助和溝通，可能轉機就在眼前。"
          ]
        },
        "reversed": {
          "summary": "一段困難時期即將結束，關係開始出現復甦的跡象。",
          "details": [
            "你們可能找到了解決財務問題的方法，或者在情感上重新找到了連結。",
            "你正在從被拋棄或孤立的感覺中恢復過來，重新找回了希望。",
            "這是一個療癒和重建的過程，珍惜這個來之不易的轉機。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你可能正面臨失業、財務困難或在工作中感到被排擠。",
          "details": [
            "這是一段非常艱難的職業時期，你可能會感到前途渺茫，資源匱乏。",
            "你可能覺得自己被排除在重要的專案或決策之外，感到孤立無援。",
            "不要因為驕傲而拒絕幫助。現在是時候向你的朋友、家人或專業機構尋求援助了。"
          ]
        },
        "reversed": {
          "summary": "你的職業或財務狀況開始好轉，困難時期即將過去。",
          "details": [
            "你可能找到了一份新工作，或者一個財務危機得到了解決。",
            "你正在從被排擠的狀態中走出來，重新融入團隊。",
            "雖然還需要時間才能完全恢復，但最壞的時刻已經過去了。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你感到被你的社交圈排斥或孤立。",
          "details": [
            "你可能因為經濟狀況、觀點不同或其他原因，而感到與朋友們格格不入。",
            "這是一段感到非常孤獨的時期，你覺得沒有人能夠理解你的困境。",
            "你需要主動去尋找那些真正關心你的人。即使只有一個，也足以給你帶來溫暖。"
          ]
        },
        "reversed": {
          "summary": "你正在重新融入社交圈，或者找到了新的、更具支持性的朋友。",
          "details": [
            "一個長期的誤會可能得到了澄清，讓你重新被朋友們所接納。",
            "你可能離開了一個讓你感到不舒服的圈子，並找到了一個更溫暖、更有歸屬感的地方。",
            "你不再感到孤單，希望正在回歸。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你可能因為財務壓力或缺乏支持而導致健康問題。",
          "details": [
            "這張牌常常與因為貧困而無法獲得良好醫療照顧，或者因為壓力而導致的疾病有關。",
            "你可能感到身心俱疲，被疾病和無助感所困擾。",
            "請務必尋求幫助，無論是來自社會福利機構還是慈善組織。你不必獨自承受這一切。"
          ]
        },
        "reversed": {
          "summary": "你的健康狀況開始好轉，或者你找到了負擔得起的醫療資源。",
          "details": [
            "一個長期的疾病可能開始出現康復的跡象。",
            "你可能找到了一個慈善計畫、保險方案或是一位有同情心的醫生，讓你的治療得以繼續。",
            "這是一個充滿希望的轉變，堅持下去，情況會越來越好。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正處於人生的寒冬，感到被世界遺棄，缺乏信念。",
          "details": [
            "這是一種深刻的『匱乏心態』，你只專注於你所沒有的，而忽略了你所擁有的。",
            "你可能感到靈性上的空虛和迷失，覺得自己與神或宇宙失去了連結。",
            "但希望之光（教堂的窗戶）其實一直都在。你需要抬起頭，放下你的受害者心態，主動去尋求幫助和溫暖。你比你想像的更接近轉機。"
          ]
        },
        "reversed": {
          "summary": "你正在從一段深刻的匱乏感和孤立感中走出來，重新找回內在的豐盛。",
          "details": [
            "你開始意識到，即使在物質上不富裕，你的精神也可以是豐盛的。",
            "你正在學習如何接受他人的幫助，並為此心存感激。",
            "這是一個從內心深處開始的療癒過程。你正在從寒冬中走出來，迎接春天的到來。"
          ]
        }
      }
    }
  },
  {
    "id": "six_of_pentacles",
    "name": "錢幣六",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "關係中存在著慷慨和平衡的付出，但可能存在權力不對等。",
          "details": [
            "一方可能在物質或情感上給予另一方更多的支持，這是一種慷慨的表現。",
            "你們的關係是公平的嗎？還是一方總是在給予，而另一方總是在接受？",
            "這張牌提醒你要注意關係中的平衡，確保雙方都是平等的夥伴。"
          ]
        },
        "reversed": {
          "summary": "關係中存在著不公平的付出，或者一方在利用另一方的慷慨。",
          "details": [
            "你可能感到你的付出沒有得到應有的回報，甚至被對方視為理所當然。",
            "小心不要用金錢或禮物來控制你的伴侶，或者被對方用同樣的方式控制。",
            "你需要設立清晰的界限，並要求一段建立在相互尊重和公平基礎上的關係。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你可能會得到一筆獎金、加薪或慷慨的資助。",
          "details": [
            "這是一個關於資源流動的時刻。你可能會得到你應得的報酬，或者得到一位導師的慷慨幫助。",
            "這也可能代表你處於一個給予者的位置，例如作為老闆支付薪水，或者作為導師指導新人。",
            "無論是給予還是接受，都要保持一顆感恩和公平的心。"
          ]
        },
        "reversed": {
          "summary": "你可能面臨不公平的薪酬、拖欠的債務或糟糕的投資。",
          "details": [
            "你是否覺得你的薪水與你的付出不成正比？或者你的老闆在剝削你？",
            "你可能借錢給了不該借的人，現在難以收回。",
            "在做出任何財務決定之前，請務必謹慎。不要讓自己陷入一個不公平的交易中。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "在你的社交圈中，存在著慷慨和互助的精神。",
          "details": [
            "你是一個樂於助人的朋友，當朋友有困難時，你總會伸出援手。",
            "這也代表你會從你的朋友那裡得到需要的支持和幫助。",
            "這是一種健康的、互惠互利的社交動態。"
          ]
        },
        "reversed": {
          "summary": "友誼中出現了不平衡，一方在不斷索取，而另一方在不斷付出。",
          "details": [
            "你是否覺得自己像個『工具人』，朋友們只有在需要幫助時才會想到你？",
            "小心那些只想佔你便宜的『朋友』。",
            "真正的友誼是雙向的。你需要評估一下你的哪些關係是健康的，哪些是有毒的。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你可能會得到慈善機構的資助或他人的慷慨幫助來應對你的健康問題。",
          "details": [
            "如果你正在為醫療費用而煩惱，這張牌預示著你將會得到需要的幫助。",
            "這也可能代表你正在參與一個互助小組，與他人分享經驗和支持。",
            "慷慨地分享你的康復經驗，也可能會為他人帶來希望。"
          ]
        },
        "reversed": {
          "summary": "你可能因為資源不均而無法獲得平等的醫療照顧。",
          "details": [
            "你可能因為經濟原因而無法負擔你需要的治療。",
            "你需要積極地去尋找資源，例如政府補助、慈善基金或分期付款計畫。",
            "不要因為經濟問題而放棄你的健康。為自己爭取應得的權利。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在學習給予和接受的藝術，並在其中找到平衡。",
          "details": [
            "這是一個關於財富和資源流動的課題。你意識到，你給予的越多，你得到的也越多。",
            "你正在用你的資源（金錢、時間、知識）去幫助他人，並從中獲得了巨大的滿足感。",
            "同時，你也學會了如何謙卑地接受他人的幫助，並為此心存感激。"
          ]
        },
        "reversed": {
          "summary": "你可能在給予和接受之間掙扎，或者被債務和義務所困。",
          "details": [
            "你是否因為過度慷慨而讓自己陷入了困境？或者你因為驕傲而拒絕接受任何幫助？",
            "你可能感到對他人有所虧欠，或者被他人的期望所束縛。",
            "你需要重新審視你與『給予』和『接受』的關係。學會設立健康的界限，並認識到，有時候，接受也是一種力量。"
          ]
        }
      }
    }
  },
  {
    "id": "seven_of_pentacles",
    "name": "錢幣七",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "是時候評估你們的關係了。你正在思考這段長期的感情投資是否值得。",
          "details": [
            "你已經為這段關係付出了很多，現在你需要停下來，看看你們共同創造了什麼。",
            "這不是一個做出衝動決定的時刻，而是需要耐心和深思熟慮。",
            "問問自己：這段關係是否正在朝著我想要的方向發展？我們是否需要做出一些調整？"
          ]
        },
        "reversed": {
          "summary": "你對關係的緩慢進展感到不耐煩，或者覺得你的付出沒有得到回報。",
          "details": [
            "你可能感到所有的努力都白費了，讓你對這段關係感到失望和沮喪。",
            "你是否因為急於看到結果，而給伴侶施加了太大的壓力？",
            "你需要分辨，這是因為你真的投入錯了地方，還是僅僅因為你缺乏耐心？不要過早地放棄一個有潛力的果實。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的辛勤工作即將迎來收穫，但現在是評估進度和策略的時刻。",
          "details": [
            "你已經為一個長期專案付出了大量的努力，現在是時候停下來，審視一下成果了。",
            "這是一個反思的時刻：你的策略是否有效？是否需要調整方向？",
            "不要急於收割。耐心是成功的關鍵，確保你的果實完全成熟。"
          ]
        },
        "reversed": {
          "summary": "你感到你的努力付諸東流，對工作的回報感到極度失望。",
          "details": [
            "你可能在一個沒有前途的專案上浪費了大量的時間和精力。",
            "你對工作的熱情正在消退，因為你看不到任何實質性的進展。",
            "這是一個需要做出改變的信號。是時候考慮是否應該止損，並將你的精力投入到更有價值的事情上了。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你正在評估你的人際關係投資，看看哪些友誼是值得長期維護的。",
          "details": [
            "你開始意識到，友誼也需要時間和精力來培養。",
            "你正在花時間去思考，哪些朋友真正滋養了你，而哪些只是在消耗你。",
            "這是一個對你的人際網絡進行『修剪』的好時機。"
          ]
        },
        "reversed": {
          "summary": "你可能對一段友誼感到失望，覺得自己的付出沒有得到應有的回報。",
          "details": [
            "你是否總是在幫助某個朋友，但在你需要幫助時，他卻消失了？",
            "你可能因為對友誼的進展感到不耐煩而變得疏遠。",
            "你需要進行一次誠實的對話，或者接受一個事實：不是所有的友誼都能經得起時間的考驗。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的長期健康計畫正在顯現效果，但需要耐心等待完全康復。",
          "details": [
            "你為改善健康所做的努力，例如改變飲食或堅持運動，正在慢慢地改變你的身體。",
            "這是一個評估你的治療方案或健康習慣是否有效的時刻。",
            "康復是一個漫長的過程。對自己有耐心，並慶祝每一個微小的進步。"
          ]
        },
        "reversed": {
          "summary": "你對康復的緩慢進程感到沮-喪，甚至想要放棄。",
          "details": [
            "你可能因為沒有看到立竿見影的效果而對你的治療計畫失去了信心。",
            "你是否因為不耐煩而中斷了你的康復過程？",
            "你需要重新點燃你的毅力。與你的醫生討論你的挫折感，並尋找堅持下去的動力。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "在辛勤耕耘之後，現在是時候停下來，反思你的個人成長之路了。",
          "details": [
            "你已經為你的個人目標付出了很多努力，現在你需要評估你的進展。",
            "這是一個關於耐心的課題。真正的成長不是一蹴可幾的，它需要時間來發酵和成熟。",
            "享受這個暫停的時刻。欣賞你已經走了多遠，並為你的下一步制定一個明智的計畫。"
          ]
        },
        "reversed": {
          "summary": "你因為沒有看到快速的結果而感到沮喪，對自己的成長之路產生了懷疑。",
          "details": [
            "你是否在不同的自我提升方法之間跳來跳去，卻沒有一個能夠堅持下來？",
            "你可能在浪費你的精力在一些不會有結果的事情上。",
            "你需要重新評估你的目標和方法。確保你的努力是投入在正確的方向上。有時候，最困難的部分就是學會等待。"
          ]
        }
      }
    }
  },
  {
    "id": "eight_of_pentacles",
    "name": "錢幣八",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你願意為這段關係投入努力，不斷學習和改進，讓它變得更好。",
          "details": [
            "你將愛情視為一門需要學習和練習的技藝。你願意花時間去了解你的伴侶，並努力成為一個更好的愛人。",
            "這不是關於尋找一個『完美』的伴侶，而是關於共同努力，將一段『不完美』的關係打磨得越來越好。",
            "你們的關係正在一個穩定、務實的軌道上發展。"
          ]
        },
        "reversed": {
          "summary": "你可能對關係感到了厭倦，不願意再為之付出努力。",
          "details": [
            "你可能覺得經營關係太累了，或者你對伴侶的缺點失去了耐心。",
            "你是否在走捷徑，或者在關係中表現得懶散和不專心？",
            "你需要重新找回你的初心。是什麼讓你一開始願意為這段關係努力？如果你已經不想再努力，那也許是時候重新評估這段關係了。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你正全神貫注於你的工作，通過勤奮和專注來磨練你的技藝。",
          "details": [
            "這是一個非常適合學習新技能、參加培訓課程或攻讀學位的時期。",
            "你對你的工作充滿熱情，並以成為你所在領域的專家為目標。",
            "你的努力和對細節的關注將會得到回報，你的工作品質將會非常出色。"
          ]
        },
        "reversed": {
          "summary": "你對工作缺乏熱情，表現得懶散，或者在追求完美主義的道路上迷失了。",
          "details": [
            "你可能在工作中只是敷衍了事，得過且過，對提升自己毫無興趣。",
            "你可能因為過於專注於無關緊要的細節，而忽略了專案的整體目標，導致效率低下。",
            "你需要找回你對工作的熱情和目標感。是什麼讓你選擇了這個行業？如果熱情已逝，也許是時候考慮轉行了。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是一個勤奮且可靠的朋友，願意為友誼付出時間和精力。",
          "details": [
            "你相信友誼是需要經營的。你會記得朋友的生日，並在他們需要時提供實際的幫助。",
            "你可能正在和朋友們一起學習一項新技能或從事一個共同的愛好。",
            "你的專注和可靠讓你成為一個非常值得信賴的朋友。"
          ]
        },
        "reversed": {
          "summary": "你可能因為過於專注於自己的事情而忽略了你的朋友。",
          "details": [
            "你是否因為工作太忙而很久沒有和朋友們聯繫了？",
            "你可能對經營人際關係感到厭倦，覺得這是在浪費時間。",
            "你需要抬起頭來，看看你周圍的人。工作和個人成就固然重要，但不要為此犧牲了寶貴的友誼。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你正專注於一個詳細的健康計畫，並日復一日地堅持執行。",
          "details": [
            "你對自己的健康非常負責，你會仔細研究營養成分、制定詳細的鍛鍊計畫，並嚴格執行。",
            "這是一個通過重複和堅持來養成良好健康習慣的絕佳時機。",
            "你的努力將會帶來實質性的、持久的健康改善。"
          ]
        },
        "reversed": {
          "summary": "你可能因為追求捷徑或缺乏堅持而導致健康計畫失敗。",
          "details": [
            "你是否在尋找所謂的『減肥神藥』或『速成秘訣』，而不是願意付出持續的努力？",
            "你可能因為對細節的過度關注而感到焦慮，例如過度計算卡路里。",
            "你需要一個更平衡、更可持續的方法。健康不是一場衝刺，而是一場馬拉松。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正處於一個『學徒』階段，全神貫注地學習一門新手藝或新知識。",
          "details": [
            "這是一個關於精通和奉獻的時刻。你找到了你熱愛的事情，並願意為之投入大量的時間和精力。",
            "你從重複的練習中找到了樂趣和滿足感，每一次的進步都讓你感到喜悅。",
            "享受這個過程。成為大師的道路沒有捷徑，唯一的秘訣就是日復一日的專注和努力。"
          ]
        },
        "reversed": {
          "summary": "你可能對你的追求失去了熱情，或者因為追求完美而讓自己停滯不前。",
          "details": [
            "你是否因為害怕自己的作品不夠完美而遲遲不敢開始，或者不敢將其示人？",
            "你可能在不同的興趣之間跳來跳去，卻沒有一個能夠深入下去。",
            "你需要重新點燃你的熱情，並接受『完成比完美更重要』這個道理。先做出一個『足夠好』的東西，然後再慢慢改進它。"
          ]
        }
      }
    }
  },
  {
    "id": "nine_of_pentacles",
    "name": "錢幣九",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "你非常享受單身生活，或者在關係中保持著高度的獨立和自信。",
          "details": [
            "你不需要依靠伴侶來獲得幸福和安全感，你的快樂來自於你自己。",
            "如果你處於一段關係中，你和你的伴侶都擁有各自獨立的事業和社交圈，並相互尊重。",
            "這是一段成熟的、建立在平等和獨立基礎上的關係。"
          ]
        },
        "reversed": {
          "summary": "你可能因為過於獨立而顯得冷漠，或者在財務上過度依賴伴侶。",
          "details": [
            "你是否因為害怕失去獨立性而不敢與人建立親密關係？",
            "你可能為了維持一種奢華的生活方式而犧牲了自己的獨立性，依附於一個富有的伴侶。",
            "你需要找到獨立和親密之間的平衡。真正的力量是既能獨立自主，也敢於依賴和信任他人。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你通過自己的努力實現了財務獨立和事業上的成功。",
          "details": [
            "這是一張代表著『白手起家』的成功人士的牌。你的辛勤工作和自律為你帶來了豐厚的回報。",
            "你可能已經達到了可以退休或享受半退休生活的階段，享受你的勞動果實。",
            "你對自己的成就感到非常自豪，並且懂得如何享受你創造的財富。"
          ]
        },
        "reversed": {
          "summary": "你可能在工作中付出了很多，卻沒有得到應有的回報，或者你做出了不明智的財務決策。",
          "details": [
            "你可能為了維持一個光鮮亮麗的外表而過度消費，導致財務狀況緊張。",
            "你是否在工作中感到不滿足，覺得自己的努力沒有得到應有的認可和報酬？",
            "你需要重新評估你的財務狀況和職業道路。確保你的努力是建立在穩固的基礎之上，而不是虛假的繁榮。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你享受獨處的時光，同時也擁有高質量的友誼。",
          "details": [
            "你不需要熱鬧的派對來證明你的價值，你更喜歡與幾個知心好友進行有深度的交流。",
            "你是一個獨立且有品味的朋友，你的生活方式讓朋友們非常欣賞。",
            "你懂得如何優雅地享受生活，並且樂於與志同道合的朋友分享。"
          ]
        },
        "reversed": {
          "summary": "你可能因為過於注重物質和外表而吸引來一些膚淺的朋友。",
          "details": [
            "你是否感到孤獨，覺得身邊沒有一個可以真正交心的朋友？",
            "你可能在試圖用金錢和地位來換取友誼，但這種關係是脆弱的。",
            "你需要去尋找那些欣賞你內在品質，而不僅僅是你外在成就的朋友。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的身心處於一個非常和諧、健康的狀態，這得益於你的自律和良好的生活習慣。",
          "details": [
            "你非常注重生活品質，會選擇高品質的食物，並保持規律的作息和運動。",
            "這是一個非常適合享受戶外活動、園藝或任何能讓你與大自然連結的活動的時期。",
            "你的健康是你長期自律和投資的結果。"
          ]
        },
        "reversed": {
          "summary": "你可能因為過度放縱或忽視了自律而導致健康出現問題。",
          "details": [
            "你是否為了追求短暫的享樂而犧牲了你的長期健康？",
            "你可能需要重新審視你的生活方式，看看哪些地方需要做出調整。",
            "不要等到健康亮起紅燈才開始行動。現在就開始進行調整，還為時不晚。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你已經達到了自我實現和內在豐盛的境界，能夠優雅地享受獨處的快樂。",
          "details": [
            "你通過自己的努力和智慧，為自己創造了一個穩定、美麗且充滿安全感的世界。",
            "你不需要外界的認可來證明你的價值，你的自信來自於你的內在。",
            "這是一個關於感恩和享受的時刻。感謝你自己的努力，並盡情享受你所創造的一切美好。"
          ]
        },
        "reversed": {
          "summary": "你可能擁有物質上的富足，但內心卻感到空虛和不滿足。",
          "details": [
            "你是否在不斷地追求更多的物質財富，卻發現它們無法填補你內心的空洞？",
            "你可能因為一次失敗或挫折而對自己的能力產生了懷疑，失去了自信。",
            "你需要重新連結你的內在價值。真正的豐盛不是你擁有多少，而是你感覺如何。學會欣賞和感恩你已經擁有的一切。"
          ]
        }
      }
    }
  },
  {
    "id": "ten_of_pentacles",
    "name": "錢幣十",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段非常穩定、傳統且受到家庭祝福的長期關係。",
          "details": [
            "這是一段可以走向婚姻、建立家庭並傳承下去的關係。",
            "你們的關係不僅僅是兩個人的事，它深深地植根於你們的家庭和傳統之中。",
            "你感到非常安全和滿足，這是一份可以讓你完全放鬆和信任的愛。"
          ]
        },
        "reversed": {
          "summary": "關係可能因為家庭壓力、財務糾紛或價值觀不合而變得不穩定。",
          "details": [
            "你們的家庭可能反對這段關係，或者在家庭事務上產生了嚴重的分歧。",
            "金錢問題可能正在侵蝕你們關係的基礎。",
            "你可能感到這段關係缺乏長期的穩定性和安全感，或者它與你真正想要的家庭生活背道而馳。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你的事業達到了頂峰，帶來了長期的財務穩定和傳承的可能。",
          "details": [
            "這可能代表著一個成功的家族企業、一份可以讓你安穩退休的工作，或者一筆可以傳承下去的財富。",
            "你的事業不僅為你個人帶來成功，也為你的家庭和社群帶來了繁榮。",
            "這是一個享受你長期努力成果的時刻，你的事業根基非常穩固。"
          ]
        },
        "reversed": {
          "summary": "你的事業或財務狀況突然變得不穩定，或者家族企業出現了問題。",
          "details": [
            "一個看似穩固的事業可能突然崩潰，或者一筆預期中的遺產出現了糾紛。",
            "你可能因為家庭義務而感到事業發展受限。",
            "你需要警惕任何可能動搖你財務根基的風險。不要把所有的雞蛋放在同一個籃子裡。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你擁有一個緊密、充滿支持且穩固的家庭和社交網絡。",
          "details": [
            "家庭是你力量的來源。你享受與家人共度的時光，並為你的家族感到自豪。",
            "你的朋友們就像家人一樣，你們之間的連結非常深厚和持久。",
            "這是一個非常適合舉辦家庭聚會、慶祝傳統節日的時期。"
          ]
        },
        "reversed": {
          "summary": "家庭內部可能存在衝突，或者你感到與你的根源脫節。",
          "details": [
            "你可能因為與家人的價值觀不同而產生矛盾。",
            "你是否感到自己像一個局外人，無法融入你的家庭或社群？",
            "你需要去解決那些潛在的家庭問題，或者去尋找一個能讓你真正有歸屬感的地方。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康狀況非常穩定，這可能與良好的家族基因和傳統的養生智慧有關。",
          "details": [
            "這是一張代表著長壽和長期健康的牌。",
            "你可以從你的家族長輩那裡學習到一些寶貴的、經過時間考驗的養生方法。",
            "關注你的基因可能會帶來的潛在健康問題，並做好預防措施。"
          ]
        },
        "reversed": {
          "summary": "你可能面臨一個遺傳性的健康問題，或者家庭的壓力正在影響你的健康。",
          "details": [
            "一個之前未被發現的家族遺傳病史可能現在顯現出來。",
            "家庭的紛爭和壓力讓你感到身心俱疲。",
            "你需要更加關注你的根本健康。進行一次全面的身體檢查，並學會如何應對來自家庭的壓力。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你深刻地理解到，你的個人成就是建立在你的根源和傳承之上的。",
          "details": [
            "你為你的家族、你的文化和你的歷史感到驕傲，並從中汲取力量。",
            "你正在思考你能為後代留下什麼樣的精神和物質遺產。",
            "這是一個關於歸屬感、穩定性和長期願景的時刻。你的人生不僅僅是關於你自己，更是關於一個更大的整體。"
          ]
        },
        "reversed": {
          "summary": "你可能在抗拒你的家庭傳統，或者感到被家族的期望所束縛。",
          "details": [
            "你是否為了追求個人的自由而試圖切斷與你過去的所有聯繫？",
            "你可能感到自己無法達到家族的期望，為此感到壓力和內疚。",
            "你需要找到在你個人追求和家族傳承之間的平衡。你可以尊重你的根源，同時也走出你自己的道路。"
          ]
        }
      }
    }
  },
  {
    "id": "page_of_pentacles",
    "name": "錢幣侍衛",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段新的、有潛力的關係正在萌芽，它建立在務實和可靠的基礎之上。",
          "details": [
            "這可能不是一場轟轟烈烈的戀愛，但它充滿了真誠和長遠發展的潛力。",
            "你或你的伴侶正在以一種認真、負責的態度對待這段關係。",
            "如果你是單身，這張牌預示著一個值得信賴、腳踏實地的人即將出現。"
          ]
        },
        "reversed": {
          "summary": "你可能因為懶惰或缺乏遠見而錯過了一個好的戀愛機會。",
          "details": [
            "你是否因為害怕付出努力而對追求愛情感到猶豫？",
            "你可能對一段關係只有三分鐘熱度，缺乏將其發展下去的耐心和承諾。",
            "你需要更認真地對待你的感情生活。幸福不會自己從天而降，它需要你用心去經營。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "一個新的學習機會、工作機會或一個有前景的新專案。",
          "details": [
            "這是一個非常適合學習新技能、重返校園或開始一個新專案的時期。",
            "你對你的工作充滿了好奇心和學習的熱情，像一塊海綿一樣吸收新知識。",
            "這張牌預示著一個可以帶來長期回報的新機會，抓住它！"
          ]
        },
        "reversed": {
          "summary": "你可能因為缺乏專注力或懶惰而讓一個好機會從手中溜走。",
          "details": [
            "你是否對你的工作感到厭倦，缺乏學習新事物的動力？",
            "你可能有很多想法，但都停留在空想階段，從未付諸實踐。",
            "你需要重新點燃你的好奇心和上進心。機會總是留給有準備的人。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你可能會結交一個新的、可靠的朋友，或者開始一個新的、有趣的愛好小組。",
          "details": [
            "你對結交新朋友和學習新事物持開放態度。",
            "這是一個通過共同的興趣（例如一起上課或參加工作坊）來擴大社交圈的好時機。",
            "你是一個讓人覺得可靠、值得信賴的朋友。"
          ]
        },
        "reversed": {
          "summary": "你可能因為害羞或懶惰而錯過了結交新朋友的機會。",
          "details": [
            "你是否寧願待在家裡，也不願意外出參加社交活動？",
            "你可能對新的友誼缺乏安全感，或者覺得經營人際關係太麻煩。",
            "你需要鼓起勇氣，走出你的舒適圈。一個新的、有趣的世界正在等著你。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你正在學習關於健康的新知識，並開始一個務實的健康計畫。",
          "details": [
            "這是一個研究營養學、學習新的鍛鍊方法或諮詢健康專家的好時機。",
            "你正在為你的健康打下一個堅實的基礎，這個計畫是可持續且有效的。",
            "你的身體就是你的神殿，而你正在學習如何最好地照料它。"
          ]
        },
        "reversed": {
          "summary": "你可能對健康建議充耳不聞，或者你的健康計畫不切實際。",
          "details": [
            "你是否在忽視你的身體發出的警訊，或者懶得去改變不健康的生活習慣？",
            "你可能設定了一個過於宏大的健康目標，導致你很快就感到了挫敗並放棄。",
            "你需要從基礎做起。從一個小的、容易實現的改變開始，逐步建立你的健康大廈。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正處於一個顯化的開端，一個將夢想變為現實的學習過程。",
          "details": [
            "你充滿了好奇心，渴望學習如何將你的想法和願望在物質世界中實現。",
            "這是一個關於『落地』的時刻。你需要將你的靈感轉化為一個具體的、可執行的計畫。",
            "保持你的學生心態，對世界充滿好奇，並相信你通過務實的努力可以實現任何事情。"
          ]
        },
        "reversed": {
          "summary": "你的夢想停留在空中樓閣的階段，缺乏實現它們的計畫和行動。",
          "details": [
            "你是否有很多偉大的夢想，但卻從未真正地去研究如何實現它們？",
            "你可能因為害怕失敗或不願付出努力，而讓你的夢想永遠只是夢想。",
            "你需要將你的夢想分解成一個個小的、可實現的步驟。顯化的第一步，就是寫下你的計畫。"
          ]
        }
      }
    }
  },
  {
    "id": "knight_of_pentacles",
    "name": "錢幣騎士",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段穩定、可靠且正在朝著長期承諾發展的關係。",
          "details": [
            "你的伴侶是一個非常值得信賴和依靠的人，雖然可能有點無趣，但非常忠誠。",
            "這段關係的進展可能比較緩慢，但每一步都非常堅實。",
            "如果你是單身，一個勤奮、務實且尋求穩定關係的人可能會出現。"
          ]
        },
        "reversed": {
          "summary": "關係變得停滯不前、沉悶乏味，或者一方過於懶散。",
          "details": [
            "你們的關係可能陷入了一種日復一日的慣性中，缺乏激情和新的火花。",
            "一方可能不願意為關係的未來付出努力，表現得懶惰和不負責任。",
            "你需要為這段關係注入一些新的活力，或者評估一下，這種過於穩定的狀態是否是你真正想要的。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你通過勤奮、可靠和對細節的關注來完成你的工作。",
          "details": [
            "你是一個非常盡職盡責的員工，你會一絲不苟地完成你的日常任務。",
            "這代表著一個需要耐心和毅力的長期專案，而你正是完成它的不二人選。",
            "你的可靠性將為你贏得同事和上司的信任。"
          ]
        },
        "reversed": {
          "summary": "你對工作感到厭倦，變得懶散，或者因為過於追求常規而錯失機會。",
          "details": [
            "你可能在用最低限度的努力來應付你的工作，只是為了完成而完成。",
            "你對任何新的方法或變化都持抗拒態度，這讓你變得僵化和落後。",
            "你需要找回你的敬業精神，或者尋找一份更能激發你熱情的工作。不要讓自己陷入一潭死水。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是一個非常可靠、值得信賴的朋友，總會信守承諾。",
          "details": [
            "雖然你可能不是最有趣的朋友，但當朋友們需要幫助時，他們知道總是可以指望你。",
            "你喜歡有規律的社交活動，例如每週固定的聚餐或讀書會。",
            "你的友誼是建立在長期的信任和相互支持之上的。"
          ]
        },
        "reversed": {
          "summary": "你可能因為過於沉悶或不願嘗試新事物而被朋友們疏遠。",
          "details": [
            "你是否總是拒絕朋友們的臨時邀約或新的活動建議？",
            "你可能因為懶得經營人際關係而變得越來越孤立。",
            "你需要偶爾走出你的舒適圈。友誼需要一些新的體驗來保持活力。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你通過堅持一個常規的、有規律的健康計畫來保持健康。",
          "details": [
            "你是一個非常有毅力的人，你會日復一日地堅持你的飲食和運動計畫。",
            "這代表著一種通過常規和紀律來達成的穩定健康狀態。",
            "繼續堅持你的好習慣，它們是你健康的基石。"
          ]
        },
        "reversed": {
          "summary": "你可能因為懶惰或厭倦而中斷了你的健康計畫。",
          "details": [
            "你是否因為覺得日復一日的鍛鍊太無聊而放棄了？",
            "你可能在飲食上放縱自己，或者完全停止了運動。",
            "你需要找到一種更有趣的方式來激勵自己，或者僅僅是需要重新找回你的自制力。不要讓你之前的努力付諸東流。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你正在通過日復一日的、務實的努力來實現你的長期目標。",
          "details": [
            "這是一個關於『執行』的時刻。你將你的遠大理想分解成一個個日常的、可執行的任務。",
            "你擁有強大的毅力和自制力，你相信只要堅持不懈，就一定能到達終點。",
            "你的座右銘是：『千里之行，始於足下』。為你的堅持和可靠感到驕傲吧。"
          ]
        },
        "reversed": {
          "summary": "你感到生活陷入了停滯和無聊的常規，或者你因為懶惰而放棄了你的目標。",
          "details": [
            "你是否感到被日常瑣事所困，失去了你的遠大理想？",
            "你可能在拖延，或者為自己的不作為找各種藉口。",
            "你需要打破常規，為你的生活注入一些新的目標和挑戰。有時候，你需要一些改變來重新點燃你的鬥志。"
          ]
        }
      }
    }
  },
  {
    "id": "queen_of_pentacles",
    "name": "錢幣皇后",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段充滿溫暖、滋養和安全感的關係。你或你的伴侶扮演著照顧者的角色。",
          "details": [
            "你是一個非常務實和有愛心的伴侶，懂得如何用實際行動來表達愛，例如做一頓美味的晚餐或提供財務上的支持。",
            "你們的關係非常穩定，充滿了家庭的溫暖和舒適感。",
            "如果你是單身，你可能會被一個成熟、可靠且顧家的人所吸引。"
          ]
        },
        "reversed": {
          "summary": "關係可能因為過於注重物質或一方過於控制而變得窒息。",
          "details": [
            "你或你的伴侶可能過於擔心財務安全，而忽略了情感上的交流。",
            "一方可能以『為你好』為名，過度地干涉對方的生活，讓對方感到沒有空間。",
            "你需要警惕關係中的不平衡。愛不僅僅是物質上的給予，更需要情感上的支持和尊重。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你在事業和家庭之間取得了很好的平衡，並且在工作中表現得非常務實和高效。",
          "details": [
            "你是一個非常有能力的管理者，懂得如何將資源效益最大化。",
            "你可能正在從事與餐飲、房地產、金融或任何與『照顧』相關的行業，並取得了成功。",
            "你的同事們都很喜歡你，因為你既有能力，又懂得關心他人。"
          ]
        },
        "reversed": {
          "summary": "你可能因為工作而忽略了家庭，或者在工作中變得過於斤斤計較。",
          "details": [
            "你是否因為過度投入工作而犧牲了與家人相處的時間？",
            "你可能在工作中變得過於注重細節和成本，而忽略了更宏觀的目標和團隊士氣。",
            "你需要重新找到工作與生活的平衡點。記住，你工作是為了更好地生活，而不是反過來。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是一個慷慨、熱情好客的朋友，你的家總是對朋友們敞開。",
          "details": [
            "你喜歡用美食和舒適的環境來款待你的朋友，你是一個天生的主人。",
            "朋友們都很喜歡向你尋求務實的建議，因為你總能給出最可靠的答案。",
            "你是一個非常溫暖、讓人有安全感的朋友。"
          ]
        },
        "reversed": {
          "summary": "你可能因為嫉妒或佔有慾而讓友誼變得緊張。",
          "details": [
            "你是否會因為朋友有了新的社交圈而感到不安或嫉妒？",
            "你可能在朋友面前過於炫耀你的物質財富，引起他人的反感。",
            "你需要學會與他人分享，並為朋友的成功感到高興。真正的友誼不是佔有，而是祝福。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你非常注重通過自然、務實的方式來保持健康。",
          "details": [
            "你喜歡自己烹飪健康、美味的食物，並享受這個過程。",
            "你懂得如何傾聽身體的聲音，並用最自然的方式來照顧它。",
            "這是一個非常適合親近大自然、做一些園藝工作或享受戶外活動的時期。"
          ]
        },
        "reversed": {
          "summary": "你可能因為過度操勞或忽視了自我照顧而導致健康問題。",
          "details": [
            "你是否總是在照顧別人，卻忘記了照顧自己？",
            "你可能因為壓力而暴飲暴食，或者完全沒有時間為自己準備一頓健康的飯菜。",
            "你需要將自我照顧放在優先位置。只有先照顧好自己，你才有能力去照顧別人。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你深刻地理解到，真正的富足是身心靈的全面豐盛。",
          "details": [
            "你將你的靈性追求與日常生活完美地結合在一起。你在做飯、打掃、工作的每一個平凡瞬間，都能感受到神聖的存在。",
            "你是一個腳踏實地的人，但你的腳下踩著大地，眼中卻望著星空。",
            "你正在創造一個既舒適又充滿意義的生活。你就是豐盛女王。"
          ]
        },
        "reversed": {
          "summary": "你可能陷入了對物質的過度追求，或者因為自我懷疑而感到不安。",
          "details": [
            "你是否將你的自我價值完全建立在你擁有多少物質財富之上？",
            "你可能在與他人比較，總覺得自己不夠好、不夠富有。",
            "你需要重新找回你的內在價值。真正的安全感來自於你的內心，而不是你的銀行帳戶。學會欣賞和感恩你所擁有的一切，無論多寡。"
          ]
        }
      }
    }
  },
  {
    "id": "king_of_pentacles",
    "name": "錢幣國王",
    "type": "minor",
    "meanings": {
      "love": {
        "upright": {
          "summary": "一段非常富足、穩定且慷慨的關係。你的伴侶是一個成功的、可以提供優渥生活的人。",
          "details": [
            "這段關係充滿了安全感，你不必為麵包和牛奶而擔憂。",
            "你的伴侶非常可靠，他會用最實際的方式來表達他的愛和承諾。",
            "如果你是單身，你可能會被一位事業有成、經濟穩定且成熟的對象所吸引。"
          ]
        },
        "reversed": {
          "summary": "關係可能因為一方過於專制、貪婪或不誠實而出現問題。",
          "details": [
            "一方可能過於注重物質和地位，而忽略了情感上的連結。",
            "你需要警惕對方可能存在的財務問題或不誠實的行為。",
            "這段關係可能讓你感到窒息，因為對方試圖用金錢來控制你。"
          ]
        }
      },
      "career": {
        "upright": {
          "summary": "你已經達到了事業的頂峰，享受著財富、權力和聲望。",
          "details": [
            "你是一位成功的領導者，你的企業或投資非常成功，你擁有『點石成金』的能力。",
            "你不僅自己富有，也樂於用你的財富和影響力去幫助他人，是一位慷慨的贊助人。",
            "這是一個享受你商業帝國成果的時刻。你的成功是毋庸置疑的。"
          ]
        },
        "reversed": {
          "summary": "你可能做出了糟糕的商業決策，或者在工作中表現得貪婪和專制。",
          "details": [
            "你可能因為一次失敗的投資或賭博而面臨財務危機。",
            "你是否變成了一個為了利潤不擇手段的商人，甚至不惜犧牲道德和法律？",
            "你需要重新審視你的商業行為。真正的成功是建立在誠信和可持續發展之上的。"
          ]
        }
      },
      "relationship": {
        "upright": {
          "summary": "你是一個非常慷慨的朋友，樂於與朋友們分享你的財富和成功。",
          "details": [
            "你喜歡用最好的東西來款待你的朋友，你的慷慨讓你身邊圍繞著許多人。",
            "你是一個非常有影響力的人，朋友們都很敬重你，並樂於向你尋求建議。",
            "你享受作為一個成功人士所帶來的社交地位。"
          ]
        },
        "reversed": {
          "summary": "你可能在用金錢來衡量友誼，或者你身邊圍繞著一群只想佔你便宜的人。",
          "details": [
            "你是否在炫耀你的財富，讓朋友們感到不舒服？",
            "你需要分辨，誰是真正的朋友，誰只是因為你的錢和地位才和你在一起。",
            "不要讓金錢腐蝕了你的人際關係。真正的友誼是無價的。"
          ]
        }
      },
      "health": {
        "upright": {
          "summary": "你的健康狀況非常良好，這得益於你有資源去享受最好的醫療和生活品質。",
          "details": [
            "你能夠負擔得起最好的有機食品、私人教練和頂級的醫療服務。",
            "你的生活方式非常健康、規律且奢華。",
            "這是一張代表著極佳物質條件所帶來的健康身體的牌。"
          ]
        },
        "reversed": {
          "summary": "你可能因為過度的放縱（美食、美酒）而導致健康問題。",
          "details": [
            "你是否因為生活過於奢靡而導致了『富貴病』，例如高血壓、高血脂或痛風？",
            "你可能在用花錢來彌補健康上的不安全感，但這並不能解決根本問題。",
            "你需要回歸更簡單、更自然的生活方式。金錢買不來真正的健康。"
          ]
        }
      },
      "self-exploration": {
        "upright": {
          "summary": "你已經掌握了在物質世界中創造豐盛的秘密，並達到了世俗成功的頂點。",
          "details": [
            "你是一個顯化大師。你深刻地理解，通過務實的計畫、辛勤的工作和可靠的聲譽，你可以實現任何物質目標。",
            "你的人生課題是學習如何智慧地使用你的財富和權力，去創造一個更美好的世界。",
            "你享受你的成功，但你並不為之所困。你知道，你比你的財富更富有。"
          ]
        },
        "reversed": {
          "summary": "你可能被對財富和權力的貪婪所腐蝕，或者害怕失去你所擁有的一切。",
          "details": [
            "你是否將你所有的自我價值都與你的銀行存款和社會地位掛鉤？",
            "你可能變得極度害怕風險，不敢再進行任何投資，導致你的財富停滯不前。",
            "你需要重新思考你與金錢的關係。你是在掌控金錢，還是被金錢所掌控？學會放手，並記住你內在的、永恆的價值。"
          ]
        }
      }
    }
  }
]